exports.data = [
    {
        "category-in-bangla": "কুরআন-সুন্নাহ্‌র যিকর ও দু'আ",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيم (আ‘ঊযু বিল্লাহি মিনাশ্-শাইত্বা-নির রাজীম)। “আল্লাহ্‌র নিকট আশ্রয় চাই বিতাড়িত শয়তান থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/৯৯, নং ৩২৮২; মুসলিম ৪/২০১৫, নং ২৬১০।",
                        "ref-in-english": "",
                        "source": "https://www.hadithbd.com/books/section/?book=4"
                    }
                ],
                "sub-category-in-bangla": "৮২. ক্রোধ দমনের দো‘আ",
                "sub-category-in-english": "82 - When angry"
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "وَلَكَ (ওয়া লাকা) ১৯৭- “আর আপনাকেও।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ৫/৮২, নং ২০৭৭৮; আন-নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, পৃ. ২১৮, নং ৪২১। তাহকীক, ড. ফারূক হাম্মাদাহ।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৬. কেউ যদি বলে, ‘আল্লাহ আপনাকে ক্ষমা করুন’, তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "جَزَاكَ اللَّهُ خَيْراً (জাযা-কাল্লা-হু খাইরান)। “আল্লাহ আপনাকে উত্তম বিনিময় দান করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, হাদিস নং ২০৩৫। আরও দেখুন, সহীহুল জামে‘ ৬২৪৪; সহীহুত তিরমিযী, ২/২০০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৭. কেউ আপনার সাথে সদাচারণ করলে তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যে ব্যক্তি সূরা কাহফের প্রথম দশটি আয়াত মুখস্থ করবে, তাকে দাজ্জাল থেকে রক্ষা করা হবে।” অনুরূপভাবে প্রতি নামাযের শেষ বৈঠকে তাশাহহুদের পর তার (দাজ্জালের) বিপর্যয় থেকে রক্ষা পাবার জন্য আল্লাহ্‌র নিকট আশ্রয় প্রার্থনা করতে হবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৫৫, নং ৮০৯; অন্য বর্ণনায় এসেছে, সূরা কাহাফের শেষাংশ, ১/৫৫৬, নং ৮০৯। দেখুন, এ গ্রন্থের হাদীস নং ৫৫, ও হাদীস নং ৫৬, পৃ. ।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৮. আল্লাহ যা দ্বারা দাজ্জাল থেকে হেফাযত করবেন",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ (বা-রাকাল্লা-হু লাকা ফী আহলিকা ওয়া মা-লিকা, ইন্নামা জাযা-উস সালাফে আল-হামদু ওয়াল আদা-উ) “আল্লাহ আপনার পরিবারে ও সম্পদে বরকত দান করুন। ঋণের প্রতিদান তো কৃতজ্ঞতা প্রকাশ ও (ঠিকভাবে) আদায়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, নাসাঈ, তাঁর আমালুল ইয়াওমি ওয়াল-লাইলাহ গ্রন্থে, পৃ. ৩০০; ইবন মাজাহ, ২/৮০৯, নং ২৪২৪। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৫৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯১. কেউ ঋণ দিলে তা পরিশোধের সময় দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “যে ব্যক্তি আমার উপর একবার দরূদ পাঠ করবে, তার বিনিময়ে আল্লাহ্ তার উপর দশবার দরুদ পাঠ করবেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, মুসলিম ১/২৮৮, নং ৩৮৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “তোমরা আমার কবরকে ঈদ তথা সম্মিলনস্থলে পরিণত করবে না, আর তোমরা আমার উপর দরূদ পাঠ কর; কেননা তোমাদের দরূদ আমার কাছে পৌঁছে যায়, তোমরা যেখানেই থাক না কেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/২১৮, নং ২০৪৪; আহমাদ ২/৩৬৭, নং ৮৮০৪। আর শাইখ আলবানী একে সহীহ আবি দাঊদে ২/৩৮৩, সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “যার সামনে আমার নাম উল্লেখ করা হলো অতঃপর সে আমার উপর দরূদ পড়লো না, সে-ই কৃপণ।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, ৫/৫৫১, নং ৩৫৪৬, ইত্যাদি। আরও দেখুন, সহীহুল জামে‘ ৩/২৫; সহীহুত তিরমিযী, ৩/১৭৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “পৃথিবীতে আল্লাহর একদল ভ্রাম্যমাণ ফেরেশতা রয়েছে যারা উম্মতের পক্ষ থেকে প্রেরিত সালাম আমার কাছে পৌঁছিয়ে দেয়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ, ৩/৪৩, নং ১২৮২; হাকেম, ২/৪২১। আর শাইখ আলবানী একে সহীহুন নাসাঈ ১/২৭৪, সহীহ বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “যখন কোনো ব্যক্তি আমাকে সালাম দেয়, তখন আল্লাহ আমার রূহ ফিরিয়ে দেন, যাতে আমি সালামের জবাব দিতে পারি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, নং ২০৪১। আর শাইখ আলবানী সহীহ আবি দাউদে ১/৩৮৩, একে হাসান হাদীস বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর দরূদ পাঠের ফযীলত",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “আল্লাহ্‌র শপথ, নিশ্চয় আমি দৈনিক সত্তর -এর অধিকবার আল্লাহ্‌র কাছে ক্ষমা চাই এবং তাওবা করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ফাতহুল বারীসহ, ১১/১০১, নং ৬৩০৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “হে মানুষ, তোমরা আল্লাহ্‌র কাছে তাওবা কর, নিশ্চয় আমি আল্লাহ্‌র কাছে দৈনিক একশত বার তাওবা করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২০৭৬, নং ২৭০২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “যে ব্যক্তি বলবে, أَسْتَغْفِرُ اللَّهَ الْعَظيمَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيّوُمُ وَأَتُوبُ إِلَيه (আস্তাগফিরুল্লা-হাল ‘আযীমল্লাযী লা ইলা-হা ইল্লা হুয়াল হাইয়্যুল কায়্যূমু ওয়া আতূবু ইলাইহি)। ‘আমি মহামহিম আল্লাহ্‌র নিকট ক্ষমা চাই, যিনি ছাড়া আর কোনো হক্ব ইলাহ নেই, তিনি চিরস্থায়ী, সর্বসত্তার ধারক। আর আমি তাঁরই নিকট তওবা করছি।’ আল্লাহ তাকে মাফ করে দিবেন যদিও সে যুদ্ধক্ষেত্র থেকে পলায়নকারী হয়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/৮৫, নং ১৫১৭; তিরমিযী ৫/৫৬৯, নং ৩৫৭৭; আল-হাকিম এবং সহীহ বলেছেন, তার সাথে ইমাম যাহাবী ঐকমত্য পোষণ করেছেন, ১/৫১১, আর শাইখুল আলবানীও সহীহ বলেছেন। দেখুন, সহীহুত তিরমিযী ৩/১৮২, জামেউল উসূল লি আহাদীসির রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ৪/৩৮৯-৩৯০, আরনাঊত এর সম্পাদনাসহ।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “রব একজন বান্দার সবচেয়ে বেশি নিকটবর্তী হয় রাতের শেষ প্রান্তে, সুতরাং যদি তুমি যদি সে সময়ে আল্লাহ্‌র যিক্‌রকারীদের অন্তর্ভুক্ত হতে সক্ষম হও, তবে তা-ই হও।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী নং ৩৫৭৯, নাসায়ী, ১/২৭৯ নং ৫৭২; হাকেম ১/৩০৯। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮৩; জামে‘উল উসূল, আরনাউতের তাহকীকসহ ৪/১৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “একজন বান্দা তার রবের সবচেয়ে কাছে তখনই থাকে, যখন সে সিজদায় যায়, সুতরাং তোমরা তখন বেশি বেশি করে দো‘আ কর।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ১/৩৫০; নং ৪৮২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, “নিশ্চয় আমার অন্তরেও ঢাকনা এসে পড়ে, আর আমি দৈনিক আল্লাহ্‌র কাছে একশত বার ক্ষমা প্রার্থনা করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২০৭৫, নং ২৭০২। ইবনুল আসীর বলেন, «ليُغان على قلبي» এর অর্থ হচ্ছে, ঢাকা পড়ে যায়, পর্দাবৃত হয়ে যায়। উদ্দেশ্য ভুলে যাওয়া; কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বদা যিক্‌র, নৈকট্য ও সার্বিক তত্ত্বাবধানে থাকতেন। তাই যখন কোনো সময় এ ব্যাপারে সামান্যতম ব্যাঘাত ঘটত অথবা ভুলে যেতেন, তখনি তিনি এটাকে নিজের জন্য গুনাহ মনে করতেন, সাথে সাথে তিনি ইস্তেগফার বা ক্ষমাপ্রার্থনার দিকে দ্রুত ধাবিত হতেন। দেখুন, জামে‘উল উসূল ৪/৩৮৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৯. ক্ষমাপ্রার্থনা ও তাওবা করা",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেন, “যে ব্যক্তি দৈনিক ১০০ বার বলে, سُبْحَانَ اللَّهِ وَبِحَمْدِهِ (সুব্‌হানাল্লা-হি ওয়াবিহামদিহী) ‘আমি আল্লাহর সপ্রশংস পবিত্রতা ঘোষণা করছি’, তার পাপসমূহ মুছে ফেলা হয়, যদিও তা সাগরের ফেনারাশির সমান হয়ে থাকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/১৬৮, নং ৬৪০৫; মুসলিম ৪/২০৭১, নং ২৬৯১; তাছাড়া এ কিতাবের ### পৃষ্ঠায় যে ব্যক্তি সকাল ও সন্ধায় একশতবার পড়বে, তার যে ফযিলত বর্ণিত হয়েছে তা দেখুন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেন, যে ব্যক্তি নিম্নোক্ত বাণীটি ১০ বার বলবে, لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু লাহুল মুলকু ওয়া লাহুল হামদু ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর; আর তিনি সকল কিছুর উপর ক্ষমতাবান।” এটা তার জন্য এমন হবে যেন সে ইসমাঈলের সন্তানদের চারজনকে দাসত্ব থেকে মুক্ত করল।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/৬৭ নং ৬৪০৪; মুসলিম, তার শব্দে ৪/২০৭১ নং ২৬৯৩; অনুরূপভাবে একশবার বলার ফযীলত দেখুন, ৯৩ নং দো‘আর হাদীস, পৃ. নং ###।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, “দুটি বাক্য এমন রয়েছে, যা যবানে সহজ, মীযানের পাল্লায় ভারী এবং করুণাময় আল্লাহ্‌র নিকট অতি প্রিয়। আর তা হচ্ছে, سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحانَ اللَّهِ الْعَظِيمِ (সুব্‌হানাল্লা-হি ওয়া বিহামদিহী, সুব্‌হানাল্লা-হিল ‘আযীম)। ‘আল্লাহ্‌র প্রশংসাসহকারে তাঁর পবিত্রতা ও মহিমা বর্ণনা করছি। মহান আল্লাহর পবিত্রতা ও মহিমা ঘোষণা করছি’।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/১৬৮, নং ৬৪০৪; মুসলিম ৪/২০৭২, নং ২৬৯৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “সুবহানাল্লাহ, আলহামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ, আল্লাহু আকবার— সূর্য যা কিছুর উপর উদিত হয় তার চেয়ে এগুলো বলা আমার কাছে অধিক প্রিয়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২০৭২, নং ২৬৯৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “তোমাদের কেউ কি প্রতিদিন এক হাজার সওয়াব অর্জন করতে অপারগ?” তাঁর সাথীদের মধ্যে একজন প্রশ্ন করে বলল, আমাদের কেউ কী করে এক হাজার সওয়াব অর্জন করতে পারে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, “যে ব্যক্তি ১০০ বার ‘সুবহানাল্লাহ’ বলবে, তার জন্য এক হাজার সওয়াব লেখা হবে অথবা তার এক হাজার পাপ মুছে ফেলা হবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৭৩, নং ২৬৯৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যে ব্যক্তি বলবে, سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ (সুব্‌হানাল্লা-হিল ‘আযীম ওয়াবিহামদিহী)। ‘মহান আল্লাহর প্রশংসার সাথে তাঁর পবিত্রতা ও মহিমা ঘোষণা করছি’— তার জন্য জান্নাতে একটি খেজুর গাছ রোপণ করা হবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/১১, নং ৩৪৬৪; হাকেম-১/৫০১ এবং এটাকে সহীহ বলেছেন। আর ইমাম যাহাবী তার সাথে একমত হয়েছেন। দেখুন, সহীহুল জামে‘ ৫/৫৩১; সহীহুত তিরমিযী ৩/১৬০।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “ওহে আব্দুল্লাহ ইবন কায়েস! আমি কি জান্নাতের এক রত্নভাণ্ডার সম্পর্কে তোমাকে অবহিত করব না?” আমি বললাম, নিশ্চয়ই হে আল্লাহর রাসূল। তিনি বললেন, “তুমি বল, لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ (লা হাউলা ওয়ালা কূওয়াতা ইল্লা বিল্লা-হ)। “আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ফাতহুল বারীসহ ১১/২১৩, নং ৪২০৬; মুসলিম ৪/২০৭৬, নং ২৭০৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “আল্লাহ্‌র নিকট সর্বাধিক প্রিয় বাক্য চারটি, তার যে কোনটি দিয়েই শুরু করাতে তোমার কোনো ক্ষতি নেই। আর তা হলো, سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ (সুবহানাল্লা-হি ওয়ালহাম্‌দু লিল্লা-হি ওয়ালা ইলা-হা ইল্লাল্লা-হু ওয়াল্লা-হু আকবার)। “আল্লাহ পবিত্র-মহান। সকল হামদ-প্রশংসা আল্লাহর। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই। আল্লাহ সবচেয়ে বড়।”[8]",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৩/১৬৮৫, নং ২১৩৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "এক বেদুঈন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে এসে জিজ্ঞেস করল, আমাকে একটি কালেমা শিক্ষা দিন যা আমি বলব। তখন রাসূল বললেন, “বল, لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثِيراً، سُبْحَانَ اللَّهِ رَبِّ العَالَمِينَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَزِيزِ الْحَكِيمِ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, আল্লা-হু আকবার কাবীরান, ওয়ালহামদুলিল্লা-হি কাসীরান, সুবহা-নাল্লা-হি রাব্বিল আ-লামীন, লা হাউলা ওয়ালা কূওয়াতা ইল্লা বিল্লা-হিল ‘আযীযিল হাকীম।) “একমাত্র আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। আল্লাহ সবচেয়ে বড়, অতীব বড়। আল্লাহ্‌র অনেক-অজস্র প্রশংসা। সৃষ্টিকুলের রব আল্লাহ কতই না পবিত্র-মহান। প্রবল পরাক্রমশীল ও প্রজ্ঞাময় আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই।” তখন বেদুঈন বলল, এগুলো তো আমার রবের জন্য; আমার জন্য কী? তিনি বললেন: “বল, اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي (আল্লা-হুম্মাগফির লী, ওয়ারহামনী, ওয়াহদিনী, ওয়ারযুক্বনী) “হে আল্লাহ! আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন, আমাকে হেদায়াত দিন এবং আমাকে রিযিক দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৭২, নং ২৬৯৬। আর আবূ দাউদ বর্ধিত বর্ণনা করেন, ১/২২০, নং ৮৩২: এরপর যখন বেদুঈন ফিরে গেল, তখন রাসূলুল্লাহ্‌ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, “লোকটি তার হাত কল্যাণে পূর্ণ করে নিল”।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“কোনো ব্যক্তি ইসলাম গ্রহণ করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে প্রথমে সালাত শিক্ষা দিতেন। অতঃপর এসব কথা দিয়ে দো‘আ করার আদেশ দিতেন, اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي (আল্লা-হুম্মাগফির লী ওয়ারহামনী ওয়াহদিনী ওয়া ‘আ-ফিনী ওয়ারযুক্বনী)। “হে আল্লাহ! আপনি আমাকে ক্ষমা করুন, আমাকে দয়া করুন, আমাকে আপনি হেদায়াত দিন, আমাকে নিরাপদ রাখুন এবং আমাকে রিযিক দান করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৭৩; নং ৩৬৯৭। মুসলিমের অপর বর্ণনায় এসেছে, “এগুলো তোমার জন্য দুনিয়া ও আখেরাত সবকিছুর সমন্বয় ঘটাবে।”",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“সর্বশ্রেষ্ঠ দো‘আ হল, الْحَمْدُ لِلَّهِ (আলহামদু লিল্লাহ) “সকল প্রশংসা আল্লাহরই”। আর সর্বোত্তম যিক্‌র হল, لاَ إِلَهَ إِلاَّ اللهُ (লা ইলাহা ইল্লাল্লাহ) “আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই।”[11]",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৪৬২, নং ৩৩৮৩; ইবন মাজাহ্‌ ২/১২৪৯, নং ৩৮০০; আল-হাকিম, ১/৫০৩ এবং সহীহ বলেছেন, আর ইমাম যাহাবী তা সমর্থন করেছেন। আরও দেখুন, সহীহুল জামে‘ ১/৩৬২। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“‘আল-বাকিয়াতুস সালিহাত’ তথা চিরস্থায়ী নেক আমল হচ্ছে, سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ (সুবহা-নাল্লা-হি, ওয়ালহামদুলিল্লা-হি, ওয়া লা-ইলা-হা ইল্লাল্লা-হু, ওয়াল্লা-হু আকবার, ওয়ালা হাউলা ওয়ালা কূওয়াতা ইল্লা বিল্লা-হি) ““আল্লাহ পবিত্র-মহান। সকল হামদ-প্রশংসা আল্লাহর। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই। আল্লাহ সবচেয়ে বড়। আর আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসনাদে আহমাদ নং ৫১৩; আহমাদ শাকের এর তারতীব অনুসারে, আর তার সনদ বিশুদ্ধ। দেখুন, মাজমাউয যাওয়ায়িদ, ১/২৯৭; ইবন হাজার বুলুগুল মারাম গ্রন্থে এটাকে আবু সা‘ঈদ রাদিয়াল্লাহু ‘আনহু এর বর্ণনায় ইমাম নাসাঈ (আস-সুনানুল কুবরা, নং ১০৬১৭) নিয়ে এসেছেন বলে ইঙ্গিত করেছেন এবং বলেছেন যে, হাদীসটিকে ইবন হিব্বান (নং ৮৪০) ও হাকেম (১/৫৪১) সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৩০. তাসবীহ, তাহমীদ, তাহলীল ও তাকবীর -এর ফযীলত",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "আব্দুল্লাহ ইবন ‘আমর রাদিয়াল্লাহু ‘আনহুমা বলেন, “আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখেছি আঙুল ভাঁজ করে তাসবীহ গুনতে”। অপর বর্ণনায় অতিরিক্ত এসেছে, “তাঁর ডান হাতে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/৮১, নং ১৫০২; তিরমিযী ৫/৫২১, নং ৩৪৮৬। আরও দেখুন, সহীহুল জামে‘ ৪/২৭১, নং ৪৮৬৫, আর শাইখ আলবানী সহীহ সুনান আবি দাউদে (১/৪১১) এটাকে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৩১. কীভাবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাসবীহ পাঠ করতেন?",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “যখন রাত্রি অন্ধকার হবে,” অথবা (বলেছেন) “তোমরা সন্ধায় উপনীত হবে, তখন তোমরা তোমাদের শিশুদেরকে আগলে রাখবে; কারণ, তখন শয়তানরা ছড়িয়ে পড়তে থাকে। তারপর যখন রাতের একটা সময় অতিবাহিত হবে, তখন তাদের ছেড়ে দিবে। আর তোমরা দরজাগুলো বন্ধ করবে এবং আল্লাহ্‌র নাম নিবে; কেননা শয়তান কোনো বন্ধ দরজা খুলে না। আর তোমরা তোমাদের পানপাত্রসমূহ বেঁধে রাখবে এবং আল্লাহ্‌র নাম নিবে। আর তোমরা তোমাদের থালা-বাসন ঢেকে রাখবে এবং আল্লাহ্‌র নাম নিবে, যদিও সামান্য কিছু তার উপর রাখ। আর তোমরা তোমাদের ঘরের প্রদীপগুলো নিভিয়ে রাখবে।” وَصَلَّى اللَّهُ وَسَلَّمَ وَبَارَكَ عَلَى نَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ أَجْمَعِينَ আল্লাহ্ দরূদ ও সালাম এবং বরকত বর্ষণ করুন আমাদের নবী মুহাম্মাদ, তাঁর বংশধর ও তাঁর সকল সাহাবীগণের উপর।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ফাতহুল বারীসহ, ১০/৮৮; নং ৫৬২৩; মুসলিম, ৩/১৫৯৫, নং ২০১২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৩২. বিবিধ কল্যাণ ও সামষ্টিক কিছু আদব",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "দৈনন্দিন ও সামাজিক জীবনাচার",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة (আল্‌হামদু লিল্লা-হিল্লাযী কাসানী হা-যা (আসসাওবা) ওয়া রযাকানীহি মিন্ গইরি হাওলিম মিন্নী ওয়ালা কুওওয়াতিন)। “সকল হামদ-প্রশংসা আল্লাহ্‌র জন্য; যিনি আমাকে এ (কাপড়)টি পরিধান করিয়েছেন এবং আমার শক্তি-সামর্থ্য ছাড়াই তিনি আমাকে এটা দান করেছেন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত সুনান গ্রন্থকারদের সবাই সংকলন করেছেন। আবূ দাউদ, নং ৪০২৩; তিরমিযী, নং ৩৪৫৮; ইবন মাজাহ্‌, নং ৩২৮৫। আর শাইখ আলবানী একে হাসান বলেছেন। দেখুন, ইরওয়াউল গালীল, ৭/৪৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২. কাপড় পরিধানের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ (আল্লা-হুম্মা লাকাল-হামদু আনতা কাসাওতানীহি। আসআলুকা মিন খইরিহি ওয়া খইরি মা সুনি‘আ লাহু। ওয়া আ‘ঊযু বিকা মিন শাররিহি ওয়া শাররি মা সুনি‘আ লাহু)। “হে আল্লাহ্! আপনারই জন্য সকল হাম্‌দ-প্রশংসা। আপনিই এটি আমাকে পরিয়েছেন। আমি আপনার কাছে এর কল্যাণ ও এটি যে উদ্দেশ্যে তৈরি হয়েছে তার কল্যাণ প্রার্থনা করি। আর আমি এর অনিষ্ট এবং এটি যে জন্য তৈরি করা হয়েছে তার অনিষ্ট থেকে আপনার আশ্রয় চাই”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, নং ৪০২০; তিরমিযী, নং ১৭৬৭; বাগভী, ১২/৪০; দেখুন, মুখতাসারুশ শামাইল লিল আলবানী, পৃ. ৪৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩. নতুন কাপড় পরিধানের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "تُبْلِي وَيُخْلِفُ اللَّهُ تَعَالَى (তুবলী ওয়া ইয়ুখলিফুল্লা-হু তা‘আলা)। “তুমি পুরাতন করে ফেলবে, আর মহান আল্লাহ এর স্থলাভিষিক্ত করবেন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান আবি দাউদ ৪/৪১, হাদীস নং ৪০২০; দেখুন, সহীহ আবি দাউদ ২/৭৬০।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اِلْبَسْ جَدِيداً وَعِشْ حَمِيداً وَمُتْ شَهِيداً (ইলবাস জাদীদান, ওয়া ‘ইশ হামীদান, ওয়া মুত শাহীদান)। “নতুন কাপড় পরিধান কর, প্রশংসিতরূপে দিনাতিপাত কর এবং শহীদ হয়ে মারা যাও”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান ইবন মাজাহ ২/১১৭৮, নং ৩৫৫৮; বাগাওয়ী, ১২/৪১। দেখুন, সহীহ ইবন মাজাহ ২/২৭৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪. অপরকে নতুন কাপড় পরিধান করতে দেখলে তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ (বিসমিল্লাহ) “আল্লাহ্‌র নামে (খুলে রাখলাম)”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ২/৫০৫, নং ৬০৬, ও অন্যান্য। আরও দেখুন, ইরওয়াউল গালীল, নং ৫০; সহীহুল জামে‘ ৩/২০৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫. কাপড় খুলে রাখার সময় কী বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "[بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث ([বিসমিল্লাহি] আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা মিনাল খুব্‌সি ওয়াল খাবা-ইসি) “[আল্লাহ্‌র নামে।] হে আল্লাহ! আমি আপনার নিকট অপবিত্র নর জিন্ ও নারী জিন্ থেকে আশ্রয় চাই”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/৪৫, নং ১৪২; মুসলিম ১/২৮৩, নং ৩৭৫। শুরুতে অতিরিক্ত ‘বিসমিল্লাহ্‌’ উদ্ধৃত করেছেন সা‘ঈদ ইবন মানসূর। দেখুন, ফাতহুল বারী, ১/২৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬. পায়খানায় প্রবেশের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "غُفْرَانَكَ (গুফরা-নাকা) “আমি আপনার কাছে ক্ষমাপ্রার্থী।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত সকল সুনান গ্রন্থকারই উদ্ধৃত করেছেন; তবে নাসাঈ তার ‘আমালুল ইয়াওমি ওয়াললাইলাহ’ গ্রন্থে (নং ৭৯) তা উদ্ধৃত করেছেন। আবূ দাউদ, নং ৩০; তিরমিযী, নং ৭; ইবন মাজাহ্‌, নং ৩০০। আর শাইখ আলবানী সহীহ সুনান আবি দাউদে ১/১৯ একে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭. পায়খানা থেকে বের হওয়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ (বিসমিল্লাহি, তাওয়াককালতু ‘আলাল্লা-হি, ওয়ালা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ)। “আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহর উপর ভরসা করলাম। আর আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৪/৩২৫, নং ৫০৯৫; তিরমিযী ৫/৪৯০, ৩৪২৬। আরও দেখুন, সহীহুল তিরমিযী, ৩/১৫১। সুনান গ্রন্থকারগণ: আবূ দাউদ, নং ৫০৯৪; তিরমিযী, নং ৩৪২৭; নাসাঈ, নং ৫৫০১; ইবন মাজাহ, নং ৩৮৮৪। আরও দেখুন, সহীহুত তিরমিযী ৩/১৫২; সহীহ ইবন মাজাহ্‌ ২/৩৩৬।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللّٰـهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ (আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা আন আদ্বিল্লা, আও উদ্বাল্লা, আও আযিল্লা, আও উযাল্লা, আও আযলিমা, আও উযলামা, আও আজহালা, আও ইয়ুজহালা ‘আলাইয়্যা)। “হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই যেন নিজেকে বা অন্যকে পথভ্রষ্ট না করি, অথবা অন্যের দ্বারা পথভ্রষ্ট না হই; আমার নিজের বা অন্যের পদস্খলন না করি, অথবা আমায় যেন পদস্খলন করানো না হয়; আমি যেন নিজের বা অন্যের উপর যুলম না করি অথবা আমার প্রতি যুলম না করা হয়; আমি যেন নিজে মুর্খতা না করি, অথবা আমার উপর মূর্খতা করা না হয়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান গ্রন্থকারগণ: আবূ দাউদ, নং ৫০৯৪; তিরমিযী, নং ৩৪২৭; নাসাঈ, নং ৫৫০১; ইবন মাজাহ, নং ৩৮৮৪। আরও দেখুন, সহীহুত তিরমিযী ৩/১৫২; সহীহ ইবন মাজাহ্‌ ২/৩৩৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০. বাড়ি থেকে বের হওয়ার সময়ের যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "বলবে, بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا (বিসমিল্লাহি ওয়ালাজনা, ওয়াবিস্‌মিল্লাহি খারাজনা, ওয়া ‘আলাল্লাহি রাব্বিনা তাওয়াক্কালনা) “আল্লাহ্‌র নামে আমরা প্রবেশ করলাম, আল্লাহ্‌র নামেই আমরা বের হলাম এবং আমাদের রব আল্লাহ্‌র উপরই আমরা ভরসা করলাম”। অতঃপর ঘরের লোকজনকে সালাম দিবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৪/৩২৫, ৫০৯৬। আর আল্লামা ইবন বায রহ. তার তুহফাতুল আখইয়ার গ্রন্থে পৃ. ২৮ এটার সনদকে হাসান বলেছেন। তাছাড়া সহীহ হাদীসে এসেছে, “যখন তোমাদের কেউ ঘরে প্রবেশ করে, আর প্রবেশের সময় ও খাবারের সময় আল্লাহকে স্মরণ করে, তখন শয়তান (নিজ ব্যক্তিদের) বলে, তোমাদের কোনো বাসস্থান নেই, তোমাদের রাতের কোনো খাবার নেই।” মুসলিম, নং ২০১৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১. ঘরে প্রবেশের সময় যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "কেবলমাত্র আল্লাহ্‌র জন্যই সকল প্রশংসা, আর সালাত ও সালাম পেশ করছি, এমন নবীর জন্য যার পরে আর কোনো নবী নেই। অতঃপর, আয়াতুল কুরসী: أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ ﴿ اَللّٰهُ لَآ اِلٰهَ اِلَّا ھُوَ ۚ اَلْـحَيُّ الْقَيُّوْمُ ڬ لَا تَاْخُذُهٗ سِـنَةٌ وَّلَا نَوْمٌ ۭ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖ ۭ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَھُمْ ۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۗءَ ۚ وَسِعَ كُرْسِـيُّهُ السَّمٰوٰتِ وَالْاَرْضَ ۚ وَلَا يَـــــُٔـــوْدُهٗ حِفْظُهُمَا ۚ وَھُوَ الْعَلِيُّ الْعَظِيْمُ ٢٥٥؁ (আল্লা-হু লা ইলা-হা ইল্লা হুওয়াল হাইয়্যূল কাইয়্যূমু লা তা’খুযুহু সিনাতুঁও ওয়ালা নাউম। লাহূ মা-ফিসসামা-ওয়া-তি ওয়ামা ফিল আরদ্বি। মান যাল্লাযী ইয়াশফা‘উ ‘ইনদাহূ ইল্লা বিইযনিহী। ইয়া‘লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম। ওয়ালা ইয়ুহীতূনা বিশাইইম মিন্ ইলমিহী ইল্লা বিমা শাআ। ওয়াসি‘আ কুরসিয়্যুহুস সামা-ওয়া-তি ওয়াল আরদ্ব। ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল ‘আলিয়্যূল ‘আযীম)। “আল্লাহ্, তিনি ছাড়া কোনো সত্য ইলাহ্ নেই। তিনি চিরঞ্জীব, সর্বসত্তার ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না, নিদ্রাও নয়। আসমানসমূহে যা রয়েছে ও যমীনে যা রয়েছে সবই তাঁর। কে সে, যে তাঁর অনুমতি ব্যতীত তাঁর কাছে সুপারিশ করবে? তাদের সামনে ও পিছনে যা কিছু আছে তা তিনি জানেন। আর যা তিনি ইচ্ছে করেন তা ছাড়া তাঁর জ্ঞানের কোনো কিছুকেই তারা পরিবেষ্টন করতে পারে না। তাঁর ‘কুরসী’ আসমানসমূহ ও যমীনকে পরিব্যাপ্ত করে আছে; আর এ দুটোর রক্ষণাবেক্ষণ তাঁর জন্য বোঝা হয় না। আর তিনি সুউচ্চ সুমহান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সূরা আল-বাকারাহ্‌, ২৫৫। যে ব্যক্তি সকালে তা বলবে সে বিকাল হওয়া পর্যন্ত জিন শয়তান থেকে আল্লাহর আশ্রয়ে থাকবে, আর যে ব্যক্তি বিকালে তা বলবে সে সকাল হওয়া পর্যন্ত জিন শয়তান থেকে আল্লাহর আশ্রয়ে থাকবে। হাদীসটি হাকিম সংকলন করেছেন, ১/৫৬২। আর শাইখ আলবানী একে সহীহুত তারগীব ওয়াত-তারহীবে সহীহ বলেছেন ১/২৭৩। আর তিনি একে নাসাঈ, তাবারানীর দিকে সম্পর্কযুক্ত করেছেন এবং বলেছেন, তাবারানীর সনদ ‘জাইয়্যেদ’ বা ভালো। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "সূরা ইখলাস, সূরা আল-ফালাক ও সূরা আন-নাস (তিনবার করে পাঠ করবে): بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ هُوَ اللّٰهُ اَحَدٌ ۝ۚ اَللّٰهُ الصَّمَدُ ۝ۚ لَمْ يَلِدْ ڏ وَلَمْ يُوْلَدْ ۝ وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ ۝ۧ﴾ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল হুওয়াল্লা-হু আহাদ। আল্লাহুস্ সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, তিনি আল্লাহ্, এক-অদ্বিতীয়। আল্লাহ্ হচ্ছেন ‘সামাদ’ (তিনি কারো মুখাপেক্ষী নন, সকলেই তাঁর মুখাপেক্ষী)। তিনি কাউকেও জন্ম দেন নি এবং তাঁকেও জন্ম দেয়া হয় নি। আর তাঁর সমতুল্য কেউই নেই।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۝ مِنْ شَرِّ مَا خَلَقَ ۝ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۝ وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ ۝ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۝﴾ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল আ‘উযু বিরব্বিল ফালাক্ব। মিন শাররি মা খালাক্ব। ওয়া মিন শাররি গা-সিক্বিন ইযা ওয়াক্বাব। ওয়া মিন শাররিন নাফফা-সা-তি ফিল ‘উক্বাদ। ওয়া মিন শাররি হা-সিদিন ইযা হাসাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি ঊষার রবের। তিনি যা সৃষ্টি করেছেন তার অনিষ্ট হতে। ‘আর অনিষ্ট হতে রাতের অন্ধকারের, যখন তা গভীর হয়। আর অনিষ্ট হতে সমস্ত নারীদের, যারা গিরায় ফুঁক দেয়। আর অনিষ্ট হতে হিংসুকের, যখন সে হিংসা করে।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ اِلٰهِ النَّاسِ ۝ مِنْ شَرِّ الْوَسْوَاسِ ڏ الْخَنَّاسِ ۝ الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ ۝ۧ﴾ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল ‘আউযু বিরাব্বিন্না-স। মালিকিন্না-সি, ইলা-হিন্নাসি, মিন শাররিল ওয়াসওয়া-সিল খান্না-স, আল্লাযি ইউওয়াসউইসু ফী সুদূরিন না-সি, মিনাল জিন্নাতি ওয়ান্না-স।)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি মানুষের রবের, মানুষের অধিপতির, মানুষের ইলাহের কাছে, আত্মগোপনকারী কুমন্ত্রণাদাতার অনিষ্ট হতে; যে কুমন্ত্রণা দেয় মানুষের অন্তরে, জিনের মধ্য থেকে এবং মানুষের মধ্য থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসে এসেছে, রাসূল বললেন, যে ব্যক্তি সকাল ও বিকালে ‘কুল হুআল্লাহু আহাদ’ (সূরা ইখলাস), ‘সূরা ফালাক’ ও ‘সূরা নাস’ তিনবার করে বলবে, এটাই আপনার সবকিছুর জন্য যথেষ্ট হবে। আবূ দাউদ ৪/৩২২, নং ৫০৮২; তিরমিযী ৫/৫৬৭, নং ৩৫৭৫। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ (আসবাহ্‌না ওয়া আসবাহাল মুলকু লিল্লাহি[4] ওয়ালহাম্‌দু লিল্লাহি, লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়াহুয়া আলা কুল্লি শাই’ইন ক্বাদীর। রব্বি আস্আলুকা খাইরা মা ফী হা-যাল ইয়াউমি ওয়া খাইরা মা বা‘দাহু, ওয়া আ‘ঊযু বিকা মিন শাররি মা ফী হা-যাল ইয়াউমি ওয়া শাররি মা বা‘দাহু।[5] রব্বি আঊযু বিকা মিনাল কাসালি ওয়া সূইল-কিবারি। রবিব আ‘ঊযু বিকা মিন ‘আযাবিন ফিন্না-রি ওয়া আযাবিন্ ফিল ক্বাবরি)। “আমরা সকালে উপনীত হয়েছি, অনুরূপ যাবতীয় রাজত্বও সকালে উপনীত হয়েছে, আল্লাহ্‌র জন্য। সমুদয় প্রশংসা আল্লাহ্‌র জন্য। একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। রাজত্ব তাঁরই এবং প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান। হে রব্ব! এই দিনের মাঝে এবং এর পরে যা কিছু কল্যাণ আছে আমি আপনার নিকট তা প্রার্থনা করি। আর এই দিনের মাঝে এবং এর পরে যা কিছু অকল্যাণ আছে, তা থেকে আমি আপনার আশ্রয় চাই। হে রব্ব! আমি আপনার কাছে আশ্রয় চাই অলসতা ও খারাপ বার্ধক্য থেকে। হে রব্ব! আমি আপনার কাছে আশ্রয় চাই জাহান্নামে আযাব হওয়া থেকে এবং কবরে আযাব হওয়া থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বিকালে বলবে, أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ (আমসাইনা ওয়া আমসাল মুলকু লিল্লাহ) অর্থাৎ “আমরা আল্লাহর জন্য বিকালে উপনীত হয়েছি, আর সকল রাজত্বও তাঁরই অধীনে বিকালে উপনীত হয়েছে।” আর যখন বিকাল হবে, তখন বলবে, رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذِهِ اللَّيْلَةِ، وَشَرِّ مَا بَعْدَهَا. (রাব্বি আসআলুকা খাইরা মা ফী হাযিহিল্লাইলাতি ও খাইরা মা বা‘দাহা, ওয়া আ‘উযু বিকা মিন শাররি মা ফী হাযিহিল লাইলাতি, ওয়া শাররি মা বা‘দাহা) “হে রব, আমি আপনার কাছে এ রাতের মাঝে ও এর পরে যে কল্যাণ রয়েছে, তা প্রার্থনা করি। আর এ রাত ও এর পরে যে অকল্যাণ রয়েছে, তা থেকে আশ্রয় প্রার্থনা করি।” মুসলিম, ৪/২০৮৮, নং ২৭২৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ (আল্লা-হুম্মা বিকা আসবাহ্‌না ওয়াবিকা আমসাইনা ওয়াবিকা নাহ্‌ইয়া, ওয়াবিকা নামূতু ওয়া ইলাইকান নুশূর) । “হে আল্লাহ! আমরা আপনার জন্য সকালে উপনীত হয়েছি এবং আপনারই জন্য আমরা বিকালে উপনীত হয়েছি। আর আপনার দ্বারা আমরা জীবিত থাকি, আপনার দ্বারাই আমরা মারা যাব; আর আপনার দিকেই উত্থিত হব।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আর বিকাল হলে রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেন: اَللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ، وَإِلَيْكَ الْمَصِيْرُ. (আল্লা-হুম্মা বিকা আমসাইনা ওয়াবিকা আসবাহ্‌না ওয়াবিকা নাহ্‌ইয়া ওয়াবিকা নামূতু ওয়া ইলাইকাল মাসীর।) “হে আল্লাহ! আমরা আপনার জন্য বিকালে উপনীত হয়েছি এবং আপনারই জন্য আমরা সকালে উপনীত হয়েছি। আর আপনার দ্বারা আমরা জীবিত থাকি, আপনার দ্বারাই আমরা মারা যাব; আর আপনার দিকেই প্রত্যাবর্তিত হব।’’ তিরমিযী, ৫/৪৬৬, নং ৩৩৯১। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "সাইয়েদুল ইস্তেগফার- রাসূলুল্লাহ (ছাঃ) বলেন, ‘যে ব্যক্তি দৃঢ় বিশ্বাসের সাথে এই দো‘আ পাঠ করবে, দিনে পাঠ করে রাতে মারা গেলে কিংবা রাতে পাঠ করে দিনে মারা গেলে, সে জান্নাতী হবে’। اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ (আল্লা-হুম্মা আনতা রব্বী লা ইলা-হা ইল্লা আনতা খলাক্বতানী ওয়া আনা ‘আব্দুকা, ওয়া আনা ‘আলা ‘আহদিকা ওয়া ওয়া‘দিকা মাস্তাত্বা‘তু। আ‘উযু বিকা মিন শাররি মা সানা‘তু, আবূউ[9] লাকা বিনি‘মাতিকা ‘আলাইয়্যা, ওয়া আবূউ বিযাম্বী। ফাগফির লী, ফাইন্নাহূ লা ইয়াগফিরুয যুনূবা ইল্লা আনতা)। “হে আল্লাহ্‌! আপনি আমার রব্ব, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা। আর আমি আমার সাধ্য মতো আপনার (তাওহীদের) অঙ্গীকার ও (জান্নাতের) প্রতিশ্রুতির উপর রয়েছি। আমি আমার কৃতকর্মের অনিষ্ট থেকে আপনার আশ্রয় চাই। আপনি আমাকে আপনার যে নিয়ামত দিয়েছেন তা আমি স্বীকার করছি, আর আমি স্বীকার করছি আমার অপরাধ। অতএব আপনি আমাকে মাফ করুন। নিশ্চয় আপনি ছাড়া আর কেউ গুনাহসমূহ মাফ করে না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "“যে ব্যক্তি সকালবেলা অথবা সন্ধ্যাবেলা এটি (‘সায়্যিদুল ইসতিগফার’) অর্থ বুঝে দৃঢ় বিশ্বাসসহকারে পড়বে, সে ঐ দিন রাতে বা দিনে মারা গেলে অবশ্যই জান্নাতে যাবে।” বুখারী, ৭/১৫০, নং ৬৩০৬।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ (আল্লা-হুম্মা ইন্নী আসবাহ্‌তু উশহিদুকা ওয়া উশহিদু হামালাতা ‘আরশিকা ওয়া মালা-ইকাতিকা ওয়া জামী‘আ খালক্বিকা, আন্নাকা আনতাল্লা-হু লা ইলা-হা ইল্লা আনতা ওয়াহ্‌দাকা লা শারীকা লাকা, ওয়া আন্না মুহাম্মাদান আব্দুকা ওয়া রাসূলুকা) [৪ বার] “হে আল্লাহ! আমি সকালে উপনীত হয়েছি। আপনাকে আমি সাক্ষী রাখছি, আরও সাক্ষী রাখছি আপনার ‘আরশ বহনকারীদেরকে, আপনার ফেরেশতাগণকে ও আপনার সকল সৃষ্টিকে, (এর উপর) যে— নিশ্চয় আপনিই আল্লাহ, একমাত্র আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই, আপনার কোনো শরীক নেই; আর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনার বান্দা ও রাসূল।” (৪ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আর যখন বিকাল হবে, তখন বলবে, اللهم إِنّيْ أَمْسَيْتُ (আল্লা-হুম্মা ইন্নি আমসাইতু) অর্থাৎ, “হে আল্লাহ আমি বিকালে উপনীত হয়েছি”। যে ব্যক্তি সকালে অথবা বিকালে তা চারবার বলবে, আল্লাহ তাকে জাহান্নামের আগুন থেকে মুক্ত করবেন। আবূ দাউদ ৪/৩১৭, নং ৫০৭১; বুখারী, আল-আদাবুল মুফরাদ, নং ১২০১; নাসাঈ, ‘আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৯; ইবনুস সুন্নী, নং ৭০। সম্মানিত শাইখ আবদুল আযীয ইবন বায রাহেমাহুল্লাহ তাঁর তুহফাতুল আখইয়ার গ্রন্থের পৃ. ২৩ এ নাসাঈ ও আবূ দাউদের সনদকে হাসান বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. (আল্লা-হুম্মা মা আসবাহা বী মিন নি‘মাতিন আউ বিআহাদিন মিন খালক্বিকা ফামিনকা ওয়াহ্‌দাকা লা শারীকা লাকা, ফালাকাল হাম্‌দু ওয়ালাকাশ্ শুক্‌রু)। “হে আল্লাহ! যে নেয়ামত আমার সাথে সকালে উপনীত হয়েছে, অথবা আপনার সৃষ্টির অন্য কারও সাথে; এসব নেয়ামত কেবলমাত্র আপনার নিকট থেকেই; আপনার কোনো শরীক নেই। সুতরাং সকল প্রশংসা আপনারই। আর সকল কৃতজ্ঞতা আপনারই প্রাপ্য।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আর বিকাল হলে বলবে,اللَّهُمَّ مَا أَمسَى بِي (আল্লা-হুম্মা মা আমসা বী মিন নি‘মাতিন...) অর্থাৎ “হে আল্লাহ! যে নেয়ামত আমার সাথে বিকালে উপনীত হয়েছে...।” [14] যে ব্যক্তি সকালবেলা উপরোক্ত দো‘আ পাঠ করলো সে যেনো সেই দিনের শুকরিয়া আদায় করলো। আর যে ব্যক্তি বিকালবেলা এ দো‘আ পাঠ করলো সে যেনো রাতের শুকরিয়া আদায় করলো’’। হাদীসটি সংকলন করেছেন, আবূ দাউদ ৪/৩১৮, নং ৫০৭৫; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭; ইবনুস সুন্নী, নং ৪১; ইবন হিব্বান, (মাওয়ারিদ) নং ২৩৬১। আর শাইখ ইবন বায তাঁর তুহফাতুল আখইয়ার পৃ. ২৪ এ এর সনদকে হাসান বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ (৩ বার). (আল্লা-হুম্মা ‘আ-ফিনী ফী বাদানী, আল্লা-হুম্মা ‘আ-ফিনী ফী সাম্‘ঈ আল্লা-হুম্মা ‘আ-ফিনী ফী বাসারী। লা ইলা-হা ইল্লা আনতা। আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিনাল কুফরি ওয়াল-ফাক্বরি ওয়া আ‘উযু বিকা মিন ‘আযা-বিল ক্বাবরি, লা ইলাহা ইল্লা আন্‌তা)। (৩ বার) “হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শরীরে। হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শ্রবণশক্তিতে। হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার দৃষ্টিশক্তিতে। আপনি ছাড়া কোনো হক্ব ইলাহ নেই। হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই কুফরি ও দারিদ্র্য থেকে। আর আমি আপনার আশ্রয় চাই কবরের আযাব থেকে। আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই।”(৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৪/৩২৪, নং ৫০৯২; আহমাদ ৫/৪২, নং ২০৪৩০; নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলাহ, নং ২২; ইবনুস সুন্নী, নং ৬৯; বুখারী, আল-আদাবুল মুফরাদ, নং ৭০১। আর শাইখ আল্লামা ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ গ্রন্থের পৃ. ২৬ এ এর সনদকে হাসান বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ (৭ বার). (হাসবিয়াল্লা-হু লা ইলা-হা ইল্লা হুয়া, ‘আলাইহি তাওয়াক্কালতু, ওয়াহুয়া রব্বুল ‘আরশিল ‘আযীম) (৭ বার) “আল্লাহই আমার জন্য যথেষ্ট, তিনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি তাঁর উপরই ভরসা করি। আর তিনি মহান আরশের রব্ব।”(৭ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি দো‘আটি সকালবেলা সাতবার এবং বিকালবেলা সাতবার বলবে তার দুনিয়া ও আখেরাতের সকল চিন্তাভাবনার জন্য আল্লাহ্ই যথেষ্ট হবেন। ইবনুস সুন্নী, নং ৭১, মারফূ‘ সনদে; আবূ দাউদ ৪/৩২১; মাওকূফ সনদে, নং ৫০৮১। আর শাইখ শু‘আইব ও আব্দুল কাদের আরনাঊত এর সনদকে সহীহ বলেছেন। দেখুন, যাদুল মা‘আদ ২/৩৭৬।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي (আল্লা-হুম্মা ইন্নী আসআলুকাল ‘আফওয়া ওয়াল- ‘আ-ফিয়াতা ফিদ্দুনইয়া ওয়াল আ-খিরাতি। আল্লা-হুম্মা ইন্নী আসআলুকাল ‘আফওয়া ওয়াল-‘আ-ফিয়াতা ফী দ্বীনী ওয়াদুনইয়াইয়া, ওয়া আহ্‌লী ওয়া মা-লী, আল্লা-হুম্মাসতুর ‘আওরা-তী ওয়া আ-মিন রাও‘আ-তি। আল্লা-হুম্মাহফাযনী মিম্বাইনি ইয়াদাইয়্যা ওয়া মিন খালফী ওয়া ‘আন ইয়ামীনী ওয়া শিমা-লী ওয়া মিন ফাওকী। ওয়া আ‘ঊযু বি‘আযামাতিকা আন উগতা-লা মিন তাহ্‌তী)। “হে আল্লাহ! আমি আপনার নিকট দুনিয়া ও আখেরাতে ক্ষমা ও নিরাপত্তা প্রার্থনা করছি। হে আল্লাহ! আমি আপনার নিকট ক্ষমা এবং নিরাপত্তা চাচ্ছি আমার দ্বীন, দুনিয়া, পরিবার ও অর্থ-সম্পদের। হে আল্লাহ! আপনি আমার গোপন ত্রুটিসমূহ ঢেকে রাখুন, আমার উদ্বিগ্নতাকে রূপান্তরিত করুন নিরাপত্তায়। হে আল্লাহ! আপনি আমাকে হেফাযত করুন আমার সামনের দিক থেকে, আমার পিছনের দিক থেকে, আমার ডান দিক থেকে, আমার বাম দিক থেকে এবং আমার উপরের দিক থেকে। আর আপনার মহত্ত্বের অসিলায় আশ্রয় চাই আমার নীচ থেকে হঠাৎ আক্রান্ত হওয়া থেকে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, নং ৫০৭৪; ইবন মাজাহ্‌, নং ৩৮৭১। আরও দেখুন, সহীহ ইবন মাজাহ্‌ ২/৩৩২। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ (আল্লা-হুম্মা আ-লিমাল গাইবি ওয়াশ্‌শাহা-দাতি ফা-ত্বিরাস সামা-ওয়া-তি ওয়াল আরদ্বি, রব্বা কুল্লি শাই’ইন ওয়া মালীকাহু, আশহাদু আল-লা ইলা-হা ইল্লা আনতা। আ‘উযু বিকা মিন শাররি নাফ্‌সী ওয়া মিন শাররিশ শাইত্বা-নি ওয়াশিরকিহী/ওয়াশারাকিহী ওয়া আন আক্বতারিফা ‘আলা নাফ্‌সী সূওআন আউ আজুররাহূ ইলা মুসলিম)। “হে আল্লাহ! হে গায়েব ও উপস্থিতের জ্ঞানী, হে আসমানসমূহ ও যমীনের স্রষ্টা, হে সব কিছুর রব্ব ও মালিক! আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি আপনার কাছে আশ্রয় চাই আমার আত্মার অনিষ্ট থেকে, শয়তানের অনিষ্টতা থেকে ও তার শির্ক বা তার ফাঁদ থেকে, আমার নিজের উপর কোনো অনিষ্ট করা, অথবা কোনো মুসলিমের দিকে তা টেনে নেওয়া থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৩৩৯২; আবূ দাউদ, নং ৫০৬৭। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪২। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ (৩ বার) (বিস্‌মিল্লা-হিল্লাযী লা ইয়াদ্বুররু মা‘আ ইস্‌মিহী শাইউন ফিল্ আরদ্বি ওয়ালা ফিস্ সামা-ই, ওয়াহুয়াস্ সামী‘উল ‘আলীম)। (৩ বার) “আল্লাহ্‌র নামে; যাঁর নামের সাথে আসমান ও যমীনে কোনো কিছুই ক্ষতি করতে পারে না। আর তিনি সর্বশ্রোতা, মহাজ্ঞানী।”(৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি সকালে তিনবার এবং বিকালে তিনবার এটি বলবে, কোনো কিছু তার ক্ষতি করতে পারবে না। আবূ দাউদ, ৪/৩২৩, নং ৫০৮৮; তিরমিযী, ৫/৪৬৫, নং ৩৩৮৮; ইবন মাজাহ, নং ৩৮৬৯; আহমাদ, নং ৪৪৬। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৩৩২। আর আল্লামা ইবন বায রাহিমাহুল্লাহ তাঁর ‘তুহফাতুল আখইয়ার’ গ্রন্থের ৩৯ পৃষ্ঠায় এটার সনদকে হাসান বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ ﷺ نَبِيّاً (৩ বার) (রদ্বীতু বিল্লা-হি রব্বান, ওয়াবিল ইসলা-মি দ্বীনান, ওয়াবি মুহাম্মাদিন সাল্লাল্লা-হু ‘আলাইহি ওয়াসাল্লামা নাবিয়্যান)। (৩ বার) “আল্লাহকে রব, ইসলামকে দ্বীন ও মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবীরূপে গ্রহণ করে আমি সন্তুষ্ট।”(৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি এ দো‘আ সকাল ও বিকাল তিনবার করে বলবে, আল্লাহর কাছে তার অধিকার হয়ে যায় তাকে কিয়ামাতের দিন সন্তুষ্ট করা। আহমাদ ৪/৩৩৭; নং ১৮৯৬৭; নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ৪; ইবনুস সুন্নী, নং ৬৮; আবু দাউদ, ৪/৩১৮, নং ১৫৩১; তিরমিযী ৫/৪৬৫, নং ৩৩৮৯। আর ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ এর ৩৯ পৃষ্ঠায় একে হাসান বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ (ইয়া হাইয়্যু ইয়া ক্বাইয়্যূমু বিরহ্‌মাতিকা আস্তাগীসু, আসলিহ্‌ লী শা’নী কুল্লাহু, ওয়ালা তাকিলনী ইলা নাফসী ত্বারফাতা ‘আইন)। “হে চিরঞ্জীব, হে চিরস্থায়ী! আমি আপনার রহমতের অসীলায় আপনার কাছে উদ্ধার কামনা করি, আপনি আমার সার্বিক অবস্থা সংশোধন করে দিন, আর আমাকে আমার নিজের কাছে নিমেষের জন্যও সোপর্দ করবেন না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাকেম ১/৫৪৫, তিনি হাদীসটিকে সহীহ বলেছেন, আর যাহাবী তা সমর্থন করেছেন। আরও দেখুন, সহীহ আত-তারগীব ওয়াত-তারহীব ১/২৭৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُـمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ:فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ (আসবাহ্‌না ওয়া আসবাহাল-মূলকু লিল্লা-হি রব্বিল ‘আলামীন। আল্লা-হুম্মা ইন্নী আস্আলুকা খাইরা হাযাল ইয়াওমি[ ফাতহাহু ওয়া নাসরাহু ওয়া নুরাহু ওয়া বারাকাতাহু ওয়া হুদা-হু। ওয়া আ‘ঊযু বিকা মিন শাররি মা ফীহি ওয়া শাররি মা বা‘দাহু)। “আমরা সকালে উপনীত হয়েছি, অনুরূপ যাবতীয় রাজত্বও সকালে উপনীত হয়েছে সৃষ্টিকুলের রব্ব আল্লাহ্‌র জন্য। হে আল্লাহ! আমি আপনার কাছে কামনা করি এই দিনের কল্যাণ: বিজয়, সাহায্য, নূর, রবকত ও হেদায়াত। আর আমি আপনার কাছে আশ্রয় চাই এ দিনের এবং এ দিনের পরের অকল্যাণ থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আর যখন বিকাল হবে, তখন বলবে, أمسينا وأمسى الملك للَّه ربّ العالمين (আমসাইনা ওয়া আমসাল মুলকু লিল্লাহি রাব্বিল ‘আলামীন) “আমরা বিকালে উপনীত হয়েছি, অনুরূপ যাবতীয় রাজত্বও বিকালে উপনীত হয়েছে সৃষ্টিকুলের রব্ব আল্লাহ্‌র জন্য।” আর যখন বিকাল হবে, তখন বলবে, اللَّهم إني أسألك خير هذه الليلة: فتحها، ونصرها، ونورها، وبركتها، وهداها، وأعوذ بك من شر ما فيها، وشر ما بعدها. (আল্লা-হুম্মা ইন্নি আসআলুকা খাইরা হাযিহিল লাইলাতি: ফাতহাহা ওয়া নাসরাহা, ওয়া নূরাহা, ওয়া বারাকাতাহা, ওয়া হুদাহা, ওয়া আ‘উযু বিকা মিন শাররি মা ফী-হা, ওয়া শাররি মা বা‘দাহা) “হে আল্লাহ, আমি আপনার কাছে কামনা করি এই রাতের কল্যাণ: বিজয়, সাহায্য, নূর, রবকত ও হেদায়াত। আর আমি আপনার কাছে আশ্রয় চাই এ রাতের এবং এ রাতের পরের অকল্যাণ থেকে।” আবূ দাউদ ৪/৩২২, নং ৫০৮৪; আর শু‘আইব ও আবদুল কাদের আরনাঊত যাদুল মা‘আদের সম্পাদনায় ২/৩৭৩ এর সনদকে হাসান বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ (আসবাহনা ‘আলা ফিতরাতিল ইসলামি[25] ওয়া আলা কালিমাতিল ইখলাসি ওয়া আলা দ্বীনি নাবিয়্যিনা মুহাম্মাদিন সাল্লাল্লা-হু আলাইহি ওয়াসাল্লাম ওয়া আলা মিল্লাতি আবীনা ইবরা-হীমা হানীফাম মুসলিমাও ওয়ামা কা-না মিনাল মুশরিকীন)। “আমরা সকালে উপনীত হয়েছি ইসলামের ফিতরাতের উপর, নিষ্ঠাপূর্ণ বাণী (তাওহীদ) এর উপর, আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দ্বীনের উপর, আর আমাদের পিতা ইব্রাহীম আলাইহিস সালাম-এর মিল্লাতের উপর—যিনি ছিলেন একনিষ্ঠ মুসলিম এবং যিনি মুশরিকদের অন্তর্ভুক্ত ছিলেন না”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যখন বিকাল হবে, তখন বলবে, أمسينا على فطرة الإسلام..... (আমসাইনা ‘আলা ফিতরাতিল ইসলাম...) “আমরা বিকালে উপনীত হয়েছি ইসলামের ফিত্বরাতের উপর”। আহমাদ ৩/৪০৬, ৪০৭, নং ১৫৩৬০ ও নং ১৫৫৬৩; ইবনুস সুন্নী, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ৩৪। আরও দেখুন, সহীহুল জামে‘উ ৪/২০৯। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ (১০০ বার) (সুবহা-নাল্লা-হি ওয়া বিহামদিহী)। (১০০ বার) “আমি আল্লাহর প্রশংসাসহ পবিত্রতা ও মহিমা ঘোষণা করছি।” (১০০ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি তা সকালে একশত বার ও বিকালে একশত বার বলবে, কিয়ামতের দিন তার চেয়ে বেশি উৎকৃষ্ট কিছু কেউ নিয়ে আসতে পারবে না, তবে সে ব্যক্তি যে তার মত বলবে, বা তার চেয়ে বেশি আমল করবে। মুসলিম ৪/২০৭১, নং ২৬৯২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (১০ বার) অথবা (অলসতা লাগলে ১ বার) (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু, লাহুল মুলকু, ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। (১০ বার) অথবা (অলসতা লাগলে ১ বার) “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান।” (১০ বার)অথবা (অলসতা লাগলে ১ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ২৪। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭২; ইবন বায, তুহফাতুল আখইয়ার পৃ. ৪৪। এর ফযীলতের ব্যাপারে আরও দেখন, পৃ. হাদীস নং ২৫৫। আবূ দাউদ, নং ৫০৭৭; ইবন মাজাহ, নং ৩৭৯৮; আহমাদ নং ৮৭১৯। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭০; সহীহ আবি দাউদ ৩/৯৫৭; সহীহ ইবন মাজাহ ২/৩৩১ ও যাদুল মা‘আদ ২/৩৭৭। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু, লাহুল মুলকু, ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান।” (সকালবেলা ১০০ বার বলবে)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি দিনে একশত বার বলবে, সেটা তার জন্য দশটি দাসমুক্তির অনুরূপ হবে, তার জন্য একশত সাওয়াব লিখা হবে, সে দিন বিকাল পর্যন্ত সেটা তার জন্য শয়তান থেকে বাঁচার উপায় হিসেবে বিবেচিত হবে; আর কেউ তার মত কিছু নিয়ে আসতে পারবে না, হাঁ, সে ব্যক্তি ব্যতীত যে তার চেয়েও বেশি আমল করবে। বুখারী, ৪/৯৫, নং ৩২৯৩; মুসলিম, ৪/২০৭১, নং ২৬৯১। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ (সুব্‌হা-নাল্লা-হি ওয়া বিহামদিহী ‘আদাদা খালক্বিহী, ওয়া রিদা নাফসিহী, ওয়া যিনাতা ‘আরশিহী, ওয়া মিদা-দা কালিমা-তিহী)। (৩ বার) “আমি আল্লাহর প্রশংসাসহ পবিত্রতা ও মহিমা ঘোষণা করছি— তাঁর সৃষ্ট বস্তুসমূহের সংখ্যার সমান, তাঁর নিজের সন্তোষের সমান, তাঁর আরশের ওজনের সমান ও তাঁর বাণীসমূহ লেখার কালি পরিমাণ (অগণিত অসংখ্য)”।(৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৯০, নং ২৭২৬। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (সকালবেলা বলবে) (আল্লা-হুম্মা ইন্নি আসআলুকা ইলমান নাফে‘আন ওয়া রিয্‌কান তাইয়্যেবান ওয়া ‘আমালান মুতাক্বাব্বালান) (সকালবেলা বলবে) “হে আল্লাহ! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।” (সকালবেলা বলবে)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, ইবনুস সুন্নী, নং ৫৪; ইবন মাজাহ, নং ৯২৫। আর আব্দুল কাদের ও শু‘আইব আল-আরনাঊত যাদুল মা‘আদের সম্পাদনায় ২/৩৭৫; এর সনদকে হাসান বলেছেন। আর পূর্ব ৭৩ নং এ ও তা গত হয়েছে। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ (আস্তাগফিরুল্লাহ ওয়া আতূবু ইলাইহি)। “আমি আল্লাহ্‌র কাছে ক্ষমা প্রার্থনা করছি এবং তাঁর নিকটই তাওবা করছি”। (প্রতি দিন ১০০ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী (ফাতহুল বারীসহ) ১১/১০১, নং ৬৩০৭; মুসলিম ৪/২০৭৫, নং ২৭০২। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ (বিকালে ৩ বার) (আ‘ঊযু বিকালিমা-তিল্লা-হিত তা-ম্মাতি মিন শাররি মা খালাক্বা)। (বিকালে ৩ বার) “আল্লাহ্‌র পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।”(বিকালে ৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে কেউ বিকাল বেলা এ দো‘আটি তিনবার বলবে, সে রাতে কোনো বিষধর প্রাণী তার ক্ষতি করতে পারবে না। আহমাদ ২/২৯০, নং ৭৮৯৮; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৫৯০; ইবনুস সুন্নী, নং ৬৮; আরও দেখুন, সহীহুত তিরমিযী ৩/১৮৭; সহীহ ইবন মাজাহ ২/২৬৬; তুহফাতুল আখইয়ার লি ইবন বায, পৃ. ৪৫। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ [সকাল-বিকাল ১০ বার করে] (আল্লা-হুম্মা সাল্লি ওয়াসাল্লিম ‘আলা নাবিয়্যিনা মুহাম্মাদ) [সকাল-বিকাল ১০ বার করে] হে আল্লাহ! আপনি সালাত ও সালাম পেশ করুন আমাদের নবী মুহাম্মাদের উপর।” [সকাল-বিকাল ১০ বার করে]",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে কেউ সকাল বেলা আমার উপর দশবার দরুদ পাঠ করবে এবং বিকাল বেলা দশবার দরুদ পাঠ করবে, কিয়ামতের দিন আমার সুপারিশ দ্বারা সৌভাগ্যবান হবে।’ তাবরানী হাদীসটি দু’ সনদে সংকলন করেন, যার একটি উত্তম। দেখুন, মাজমা‘উয যাওয়ায়েদ ১০/১২০; সহীহুত তারগীব ওয়াত তারহীব ১/২৭৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৭. সকাল ও সন্ধ্যার যিক্‌রসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْــــــأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا (আল্লা-হুম্মা ইন্নী আসআলুকা খাইরাহা ওা আ‘ঊযু বিকা মিন শাররিহা)। “হে আল্লাহ! আমি আপনার নিকট এর কল্যাণ চাই। আর আমি আপনার নিকট এর অনিষ্ট থেকে আশ্রয় চাই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৪/৩২৬, নং ৫০৯৯; ইবন মাজাহ্‌ ২/১২২৮, নং ৩৭২৭। আরও দেখুন, সহীহ ইবন মাজাহ্‌ ২/৩০৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ (আল্লা-হুম্মা ইন্নী আস’আলুকা খাইরাহা ওয়া খাইরা মা-ফীহা ওয়া খাইরা মা উরসিলাত বিহী। ওয়া আ‘ঊযু বিকা মিন শাররিহা, ওয়া শাররি মা-ফীহা, ওয়া শাররি মা উরসিলাত বিহী)। “হে আল্লাহ! আমি আপনার নিকট প্রার্থনা করি এর কল্যাণ, এর মধ্যকার কল্যাণ এবং যা এর সাথে প্রেরিত হয়েছে তার কল্যাণ। আর আমি আপনার আশ্রয় চাই এর অনিষ্ট থেকে, এর ভেতরে নিহিত অনিষ্ট থেকে এবং যা এর সাথে প্রেরিত হয়েছে তার অনিষ্ট থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, আর শব্দ তাঁরই, ২/৬১৬, নং ৮৯৯; বুখারী, ৪/৭৬, নং ৩২০৬ ও ৪৮২৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬১. বায়ূ প্রবাহিত হলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ (সুবহা-নাল্লাযী ইউসাব্বিহুর –রা‘দু বিহামদিহি ওয়াল-মালা-ইকাতু মিন খীফাতিহি)। “পবিত্র-মহান সেই সত্তা, রা‘দ ফেরেশ্তা যাঁর মহিমা ও পবিত্রতা ঘোষণা করে প্রশংসার সাথে, আর ফেরেশ্তাগণও তা-ই করে যাঁর ভয়ে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "‘‘আবদুল্লাহ ইবনু যুবাইর রাদিয়াল্লাহু আনহুমা মেঘের গর্জন শুনলে কথা বলা বন্ধ করে দিতেন এবং এই দো‘আ পড়তেন...। মুওয়াত্তা ইমাম মালেক ২/৯৯২। আর আলবানী তাঁর সহীহুল কালেমিত তাইয়্যেব গ্রন্থে পৃ. ১৫৭, বলেন, “এর সনদটি মওকূফ সহীহ”।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬২. মেঘের গর্জন শুনলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ (আল্লা-হুম্মা আসক্বিনা গাইসান মুগীসান মারী’য়ান মারী‘আন না-ফি‘আন গাইরা দ্বাররিন ‘আ-জিলান গাইরা আ-জিলিন)। “হে আল্লাহ! আমাদেরকে এমন বৃষ্টির পানি দান করুন যা সাহায্যকারী, সুপেয়, উর্বরকারী; কল্যাণকর, ক্ষতিকর নয়; শীঘ্রই, বিলম্বে নয়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, ১/৩০৩, নং ১১৭১। আর শাইখ আলবানী সহীহ আবি দাউদে একে সহীহ বলেছেন, ১/২১৬। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا (আল্লা-হুম্মা আগিসনা, আল্লা-হুম্মা আগিসনা, আল্লা-হুম্মা আগিসনা)। “হে আল্লাহ! আমাদেরকে বৃষ্টি দিন। হে আল্লাহ! আমাদেরকে বৃষ্টি দিন। হে আল্লাহ! আমাদেরকে বৃষ্টি দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২২৪, নং ১০১৪; মুসলিম ২/৬১৩, নং ৮৯৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِي بَلَدَكَ الْمَيِّتَ (আল্লা-হুম্মাসক্বি ইবা-দাকা ওয়া বাহা-ইমাকা ওয়ানশুর রহমাতাকা ওয়া আহয়ি বালাদাকাল মায়্যিতা)। “হে আল্লাহ! আপনি আপনার বান্দাগণকে ও জীব- জন্তুগুলোকে পানি পান করান, আর আপনার রহমত বিস্তৃত করুন এবং আপনার মৃত শহরকে সজীব করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ১/৩০৫, নং ১১৭৮। আর শাইখ আলবানী তাঁর সহীহ আবি দাউদে একে হাসান বলেছেন, ১/২১৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৩. বৃষ্টি চাওয়ার কিছু দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ صَيِّباً نَافِعاً. (আল্লা-হুম্মা সায়্যিবান নাফি‘আন)। “হে আল্লাহ! মুষলধারায় উপকারী বৃষ্টি বর্ষণ করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ২/৫১৮, নং ১০৩২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৪. বৃষ্টি দেখলে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ. (মুতিরনা বিফাদলিল্লা-হি ওয়া রহমাতি-হি)। “আল্লাহ্‌র অনুগ্রহ ও দয়ায় আমাদের উপর বৃষ্টি বর্ষিত হয়েছে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২০৫, নং ৮৪৬; মুসলিম ১/৮৩, নং ৭১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৫. বৃষ্টি বর্ষণের পর যিকর",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الْأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ. (আল্লা-হুম্মা হাওয়ালাইনা ওয়ালা ‘আলাইনা। আল্লা-হুম্মা আলাল-আ-কা-মি ওয়ায্যিরা-বি ওয়াবুতূনিল আওদিয়াতি ওয়ামানা-বিতিশ শাজারি) “হে আল্লাহ! আমাদের পার্শ্ববর্তী এলাকায় (বর্ষণ করুন), আমাদের উপর নয়। হে আল্লাহ! উঁচু ভূমিতে, পাহাড়ে, উপত্যকার কোলে ও বনাঞ্চলে (বর্ষণ করুন)।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২২৪, নং ৯৩৩; মুসলিম ২/৬১৪, নং ৮৯৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৬. অতিবৃষ্টি বন্ধের জন্য কিছু দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যখন তোমাদের কেউ আহার শুরু করে তখন সে যেনো বলে, «بِسْمِ اللَّهِ» (বিসমিল্লাহ) “আল্লাহর নামে।” আর শুরুতে বলতে ভুলে গেলে যেন বলে, «بسمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ» (বিস্‌মিল্লাহি ফী আওওয়ালিহী ওয়া আখিরিহী)। “এর শুরু ও শেষ আল্লাহ্‌র নামে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন আবূ দাঊদ ৩/৩৪৭, নং ৩৭৬৭; তিরমিযী, ৪/২৮৮, নং ১৮৫৮। আরও দেখুন, সহীহুত তিরমিযী, ২/১৬৭। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যাকে আল্লাহ কোনো খাবার খাওয়ায় সে যেন বলে, اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ (আল্লা-হুম্মা বারিক লানা ফীহি ওয়া আত‘ইমনা খাইরাম-মিনহু)। “হে আল্লাহ! আপনি আমাদেরকে এই খাদ্যে বরকত দিন এবং এর চেয়েও উত্তম খাদ্য আহার করান।” আর আল্লাহ্‌ কাউকে দুধ পান করালে সে যেন বলে: «اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ (আল্লা-হুম্মা বারিক লানা ফীহি ওয়াযিদনা মিনহু)। “হে আল্লাহ! আপনি আমাদেরকে এই খাদ্যে বরকত দিন এবং আমাদেরকে তা থেকে আরও বেশি দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৫০৬, নং ৩৪৫৫। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৯. খাওয়ার পূর্বে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ (আলহামদু লিল্লা-হিল্লাযী আত‘আমানী হা-যা ওয়া রাযাকানীহি মিন গাইরি হাউলিম মিন্নী ওয়ালা কুওয়াতিন)। “সকল প্রশংসা আল্লাহ্‌র জন্য, যিনি আমাকে এ আহার করালেন এবং এ রিযিক দিলেন যাতে ছিল না আমার পক্ষ থেকে কোনো উপায়, ছিল না কোনো শক্তি-সামর্থ্য।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত সকল সুনান গ্রন্থকারগণ সংকলন করেছেন। আবূ দাউদ, নং ৪০২৫; তিরমিযী, নং ৩৪৫৮; ইবন মাজাহ, নং ৩২৮৫। আরও দেখুন, সহীহুত তিরমিযী ৩/১৫৯।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، غَيْرَ [مَكْفِيٍّ وَلاَ ] مُوَدَّعٍ، وَلاَ مُسْتَغْنَىً عَنْهُ رَبَّنَا (আলহামদু লিল্লা-হি হামদান কাসীরান তায়্যিবান মুবা-রাকান ফীহি, গাইরা মাকফিয়্যিন ওয়ালা মুয়াদ্দা‘ইন, ওয়ালা মুসতাগনান ‘আনহু রব্বানা)। “আল্লাহর জন্যই সকল প্রশংসা; এমন প্রশংসা যা অঢেল, পবিত্র ও যাতে রয়েছে বরকত; [যা যথেষ্ট করা হয় নি], যা বিদায় দিতে পারব না, আর যা থেকে বিমুখ হতে পারব না, হে আমাদের রব্ব!”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৬/২১৪, হাদীস নং ৫৪৫৮; তিরমিযী, আর শব্দটি তাঁরই, ৫/৫০৭, নং ৩৪৫৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭০. আহার শেষ করার পর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُم، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ (আল্লা-হুম্মা বা-রিক লাহুম ফীমা রাযাক্তাহুম ওয়াগফির লাহুম ওয়ারহামহুম)। “হে আল্লাহ! আপনি তাদেরকে যে রিযিক দান করেছেন তাতে তাদের জন্য বরকত দিন এবং তাদের গুনাহ মাফ করুন, আর তাদের প্রতি দয়া করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৩/১৬১৫, নং ২০৪২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭১. আহারের আয়োজনকারীর জন্য মেহমানের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي (আল্লা-হুম্মা আত্ব‘ইম মান আত্ব‘আমানী ওয়াসক্বি মান সাক্বা-নী)। “হে আল্লাহ! যে আমাকে আহার করাবে আপনি তাদেরকে আহার করান এবং যে আমাকে পান করাবে আপনি তাদেরকে পান করান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৩/১৬২৬, নং ২০৫৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭২. দো‘আর মাধ্যমে খাবার বা পানীয় চাওয়ার ইঙ্গিত করা",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ (আফত্বারা ইন্দাকুমুস সা-ইমূন, ওয়া আকালা ত্বা‘আ-মাকুমুল আবরা-রু, ওয়াসাল্লাত আলাইকুমুল মালা-ইকাহ) “আপনাদের কাছে রোযাদাররা ইফতার করুন, আপনাদের খাবার যেন সৎলোকেরা খায়, আর আপনাদের জন্য ফিরিশতারা ক্ষমা প্রার্থনা করুন।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান আবি দাউদ ৩/৩৬৭, নং ৩৮৫৬; ইবন মাজাহ ১/৫৫৬, নং ১৭৪৭; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ২৯৬-২৯৮। আর সেখানে স্পষ্টভাবে বর্ণিত আছে যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তার পরিবারের কাছে ইফতার করতেন তখন তা বলতেন। আর শাইখ আলবানী তাঁর সহীহ আবি দাউদে একে সহীহ বলেছেন, ২/৭৩০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৩. কোনো পরিবারের কাছে ইফতার করলে তাদের জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا (আল্লা-হুম্মা বা-রিক লানা ফী সামারিনা, ওয়াবা-রিক লানা ফী মাদ্বীনাতিনা, ওয়াবা-রিক লানা ফী সা‘ইনা, ওয়াবা-রিক লানা ফী মুদ্দিনা) “হে আল্লাহ, আপনি আমাদের ফল-ফলাদিতে বরকত দিন, আমাদের শহরে বরকত দিন, আমাদের সা‘ তথা বড় পরিমাপক যন্ত্রে বরকত দিন, আমাদের মুদ্দ তথা ছোট পরিমাপক যন্ত্রে বরকত দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ২/১০০০, নং ১৩৭৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৬. ফলের কলি দেখলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "তোমাদের কেউ হাঁচি দিলে বলবে, الْحَمْدُ لِلَّهِ (আলহামদু লিল্লা-হি) “সকল প্রশংসা আল্লাহ্‌র” এবং তার মুসলিম ভাই বা সাথী যেন অবশ্যই বলে, يَرْحَمُكَ اللَّهُ (ইয়ারহামুকাল্লা-হ) “আল্লাহ আপনাকে রহমত করুন”। যখন তাকে ইয়ারহামুকাল্লাহ বলা হয়, তখন হাঁচিদাতা যেন তার উত্তরে বলে, « يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ». (ইয়াহ্‌দীকুমুল্লা-হু ওয়া ইউসলিহু বা-লাকুম) “আল্লাহ আপনাদেরকে সৎপথ প্রদর্শন করুন এবং আপনাদের অবস্থা উন্নত করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/১২৫, নং ৫৮৭০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৭. হাঁচির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ (ইয়াহদীকুমুল্লাহু ওয়া ইউসলিহু বা-লাকুম)। “আল্লাহ আপনাদেরকে সৎপথ প্রদর্শন করুন এবং আপনাদের অবস্থা উন্নত করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৮২, নং ২৭৪১; আহমাদ ৪/৪০০, নং ১৯৫৮৬; আবু দাউদ, ৪/৩০৮, নং ৫০৪০। আরও দেখুন, সহীহুত তিরমিযী, ২/৩৫৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৮. কাফের ব্যক্তি হাঁচি দিয়ে আলহামদুলিল্লাহ বললে তার জবাবে যা বলা হবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً (আলহামদু লিল্লা-হিল্লাযী ‘আ-ফানী মিম্মাবতালা-কা বিহী, ওয়া ফাদ্দালানী ‘আলা কাসীরিম মিম্মান খালাক্বা তাফদ্বীলা)। “সকল প্রশংসা আল্লাহ্‌র জন্য, যিনি আপনাকে যে পরীক্ষায় ফেলেছেন তা থেকে আমাকে নিরাপদ রেখেছেন এবং তার সৃষ্টির অনেকের উপরে আমাকে অধিক সম্মানিত করেছেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৪৯৪, ৫/৪৯৩, নং ৩৪৩২। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৩. বিপন্ন লোক দেখলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“ইবন উমার রাদিয়াল্লাহু ‘আনহুমা বলেন, গণনা করে দেখা যেত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বৈঠক থেকে উঠে যাবার পূর্বে শতবার এই দো‘আ পড়তেনঃ رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ (রব্বিগফির লী ওয়াতুব ‘আলাইয়্যা, ইন্নাকা আনতাত্ তাউওয়া-বুল গাফূর)। “হে আমার রব্ব! আপনি আমাকে মাফ করুন এবং তাওবাহ কবুল করুন; নিশ্চয় আপনিই তওবা কবুলকারী ক্ষমাশীল।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৩৪৩৪; ইবন মাজাহ, নং ৩৮১৪। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৩; সহীহু ইবনি মাজাহ, ২/৩২১। আর শব্দটি তিরমিযীর।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৪. মজলিসে যা বলতে হয়",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ (সুব্‌হা-নাকাল্লা-হুম্মা ওয়া বিহামদিকা আশহাদু আল্লা ইলাহা ইল্লা আনতা আস্তাগফিরুকা ওয়া আতূবু ইলাইকা)। “হে আল্লাহ! আমি আপনার প্রশংসা সহকারে আপনার পবিত্রতা ঘোষণা করি। আমি সাক্ষ্য দেই যে, আপনি ছাড়া হক্ব কোনো ইলাহ নেই। আমি আপনার নিকট ক্ষমা প্রার্থনা করি এবং আপনার নিকট তওবা করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সুনান গ্রন্থকারগণ সবাই সংকলন করেছেন। আবু দাঊদ, নং ৪৮৫৮; তিরমিযী, নং ৩৪৩৩; নাসাঈ, নং ১৩৪৪। আরও দেখুন, সহীহুত তিরমিযী ৩/১৫৩। তাছাড়া এটাও প্রমাণিত হয়েছে যে, আয়েশা রাদিয়াল্লাহু আনহা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যখনই কোনো মজলিসে বসেছেন, অথবা কুরআন তেলাওয়াত করেছেন, অথবা সালাত আদায় করেছেন, তখনই একে কিছু বাক্যের মাধ্যমে সম্পন্ন করেছেন। ...। হাদীসটি নাসাঈ তাঁর আমালুল ইয়াওমি ওয়াল-লাইলাহ গ্রন্থে নং ৩০৮ এ বর্ণনা করেছেন। অনুরূপভাবে আহমাদ, ৬/৭৭, নং ২৪৪৮৬। আর ড. ফারূক হাম্মাদাহ, ইমাম নাসাঈ এর আমালুল ইয়াওমি ওয়াল-লাইলাহ গ্রন্থের তাহকীকের সময় এ হাদীসটিকে সহীহ বলেছেন। পৃ. ২৭৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৫. বৈঠকের কাফ্‌ফারা (ক্ষতিপূরণ)",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ (আহাব্বাকাল্লাযী আহ্বাবতানী লাহু)। “যাঁর জন্য আপনি আমাকে ভালোবেসেছেন, তিনি আপনাকে ভালোবাসুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, আবু দাঊদ ৪/৩৩৩, নং ৫১২৫। আর শাইখ আলবানী একে সহীহ আবি দাউদে হাসান বলেছেন, ৩/৯৬৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮৯. যে ব্যক্তি বলবে, ‘আমি আপনাকে আল্লাহ্‌র জন্য ভালোবাসি’— তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ (বা-রাকাল্লা-হু লাকা ফী আহলিকা ওয়া মা-লিকা)। “আল্লাহ আপনার পরিবারে ও সম্পদে বরকত দান করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৪/২৮৮, হাদীস নং ২০৪৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯০. আপনাকে কেউ তার সম্পদ দান করার জন্য পেশ করলে তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "وَفِيكَ بَارَكَ اللَّهُ (ওয়াফীকা বা-রাকাল্লা-হ) “আর আপনার মধ্যেও আল্লাহ বরকত দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি ইবনুস সুন্নী সংকলন করেছেন, পৃ. ১৩৮, নং ২৭৮। আরও দেখুন, ইবনুল কাইয়্যেমের আল-ওয়াবিলুস সাইয়্যেব, পৃ. ৩০৪। তাহকীক, বশীর মুহাম্মাদ উয়ূন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৩. কেউ যদি বলে, ‘আল্লাহ আপনার উপর বরকত দিন’, তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "‘আবদুল্লাহ ইবন ‘আমর রাদিয়াল্লাহু ‘আনহুমা থেকে বর্ণিত, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলো, ইসলামের কোন কাজটি শ্রেষ্ঠ? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, “তুমি খাবার খাওয়াবে এবং তোমার পরিচিত-অপরিচিত সকলকে সালাম দিবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১/৫৫, নং ১২; মুসলিম ১/৬৫, নং ৩৯।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “তোমরা ঈমানদার না হওয়া পর্যন্ত জান্নাতে প্রবেশ করতে পারবে না। আর তোমরা পরস্পরকে না ভালোবাসা পর্যন্ত মুমিন হতে পারবে না। আমি কি তোমাদের এমন কিছু শিখিয়ে দিবো না যা করলে তোমরা পরস্পরকে ভালবাসবে? (তা হলো) তোমরা নিজেদের মধ্যে সালামের ব্যাপক প্রসার ঘটাও।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৭৪, নং ৫৪; আহমাদ, নং ১৪৩০; আর শব্দ তাঁরই। মুসলিমের শব্দ হচ্ছে, “লা তাদখুলূনা...” ‘তোমরা প্রবেশ করবে না...’।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“তিনটি জিনিস যে ব্যক্তি একত্রিত করতে পারবে সে ঈমান একত্রিত করল, (১) নিজের ব্যাপারেও ইনসাফ করা, (২) জগতের সকলকে সালাম দেওয়া, আর (৩) অল্প সম্পদ থাকা সত্ত্বেও তা থেকে ব্যয় করা।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১/৮২, নং ২৮; আম্মার রাদিয়াল্লাহু আনহু থেকে মাওকূফ ও মু‘আল্লাক হিসেবে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৮. সালামের প্রসার",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“আহলে কিতাব তথা ইয়াহূদী ও নাসারারা যখন তোমাদেরকে সালাম দিবে, তখন তোমরা বলবে, «وَعَلَيْكُمْ (ওয়া ‘আলাইকুম।) “আর তোমাদেরও উপর।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১১/৪২, নং ৬২৫৮; মুসলিম ৪/১৭০৫, নং ২১৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৯. কাফের সালাম দিলে কীভাবে জবাব দিবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ (আল্লা-হুম্মা ফাআইয়্যূমা মু’মিনিন্ সাবাবতুহু ফাজ্‘আল যা-লিকা লাহু কুরবাতান ইলাইকা ইয়াউমাল ক্বিয়া-মাতি)। “হে আল্লাহ! যে মুমিনকেই আমি গালি দিয়েছি, তা তার জন্য কিয়ামতের দিন আপনার নৈকট্যের মাধ্যম করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী (ফাতহুল বারীসহ) ১১/১৭১, নং ৬৩৬১; মুসলিম ৪/২০০৭, নং ৩৯৬, আর তার শব্দ হচ্ছে, “ফাজ‘আলহা লাহূ যাকাতান ও রাহমাতান”। অর্থাৎ ‘সেটা তার জন্য পবিত্রতা ও রহমত বানিয়ে দিন’।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১২. যাকে আপনি গালি দিয়েছেন তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “যখন তোমাদের মধ্যে কেউ কারো প্রশংসা করতেই হয়, তখন যেন সে বলে, أَحْسِبُ فُلاَناً وَاللَّهُ حَسِيبُهُ، وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَداً، أَحْسِبُهُ – إِنْ كَانَ يَعْلَمُ ذَاكَ – كَذَا وَكَذَا “অমুক প্রসঙ্গে আমি এ ধারণা রাখি, আর আল্লাহই তার ব্যাপারে সঠিক হিসাবকারী, আল্লাহ্‌র উপর (তাঁর জ্ঞানের উপরে উঠে) কারও প্রশংসা করছি না। আমি মনে করি, সে এ ধরনের, ও ধরনের -যদি তার সম্পর্কে তা জানা থাকে-।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২২৯৬, নং ৩০০০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৩. কোনো মুসলিম অপর মুসলিমকে প্রশংসা করলে যা বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لاَ تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْ لِي مَا لاَ يَعْلَمُونَ، [وَاجْعَلْنِي خَيْراً مِمَّا يَظُّنُّونَ (আল্লা-হুম্মা লা-তু’আ-খিযনী বিমা ইয়াক্বূলূনা, ওয়াগফিরলী মা-লা ইয়া‘লামূনা, [ওয়াজ‘আলনী খাইরাম মিম্মা ইয়াযুন্নূনা]) “হে আল্লাহ, তারা যা বলছে তার জন্য আমাকে পাকড়াও করবেন না, তারা (আমার ব্যাপারে) যা জানে না সে ব্যাপারে আমাকে ক্ষমা করুন, [আর তারা যা ধারণা করে তার চাইতেও আমাকে উত্তম বানান]।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, আল-আদাবুল মুফরাদ, নং ৭৬১। আর শাইখ আলবানী তাঁর সহীহুল আদাবিল মুফরাদ গ্রন্থে নং ৫৮৫, সেটার সনদকে সহীহ বলেছেন। আর দু’ ব্রাকেটের মাঝখানের অংশ বাইহাকীর শু‘আবুল ঈমান গ্রন্থ থেকে নেওয়া হয়েছে, ৪/২২৮, যা অন্য পদ্ধতিতে এসেছে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৪. কোনো মুসলিমের প্রশংসা করা হলে সে যা বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ اللَّهِ! (সুবহা-নাল্লা-হ) “আল্লাহ পবিত্র-মহান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১/২১০, ৩৯০, ৪১৪, নং ১১৫, ৩৫৯৯, ৬২১৮; মুসলিম ৪/১৮৫৭, নং ১৬৭৪। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ أَكْبَرُ!. (আল্লা-হু আকবার) “আল্লাহ সবচেয়ে বড়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৮/৪৪১, নং ৪৭৪১; তিরমিযী নং ২১৮০; আন- নাসাঈ ফিল কুবরা, নং ১১১৮৫। আরও দেখুন, সহীহুত তিরমিযী ২/১০৩, ২/২৩৫, আহমাদ-৫/২১৮, নং ২১৯০০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২২. আশ্চর্যজনক ও আনন্দজনক বিষয়ের পর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট কোনো আনন্দদায়ক সংবাদ এলে মহান ও বরকতময় আল্লাহ তা‘আলার শুকরিয়া আদায়স্বরূপ সিজদায় পড়ে যেতেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত অপরাপর সুনান গ্রন্থকারগণ উদ্ধৃত করেছেন। আবূ দাউদ নং ২৭৭৪; তিরমিযী নং ১৫৭৮; ইবন মাজাহ্‌ ১৩৯৪। আরও দেখুন, সহীহ ইবন মাজাহ ১/২৩৩; ইরওয়াউল গালীল, ২/২২৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৩. আনন্দদায়ক কোনো সংবাদ আসলে যা করবে",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "ঘুম ও বিবিধ",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُوْرُ (আলহামদু লিল্লা-হিল্লাযী আহ্ইয়া-না- বা‘দা মা- আমা-তানা- ওয়া ইলাইহিন্ নুশূর) “হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি (নিদ্রারূপ) মৃত্যুর পর আমাদেরকে জীবিত করলেন, আর তাঁরই নিকট সকলের পুনরুত্থান”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ফাতহুল বারী ১১/১১৩, নং ৬৩১৪; মুসলিম ৪/২০৮৩, নং ২৭১১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ» «رَبِّ اغْفرْ لِي (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহূ লা- শারীকালাহূ, লাহুল মুলকু, ওয়ালাহুল হামদু, ওয়াহুয়া ‘আলা কুল্লি শায়ইন ক্বাদীর। সুবহা-নাল্লাহি, ওয়ালহামদু লিল্লাহি, ওয়া লা ইলা-হা ইল্লাল্লা-হু, ওয়াল্লা-হু আকবার, ওয়া লা- হাওলা ওয়ালা- কুওয়াতা ইল্লা- বিল্লা-হিল ‘আলিয়্যিল ‘আযীম, রাব্বিগফির লী)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, প্রশংসাও তাঁরই; আর তিনি সকল কিছুর ওপর ক্ষমতাবান। আল্লাহ পবিত্র-মহান। সকল হামদ-প্রশংসা আল্লাহ্‌র। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই। আল্লাহ সবচেয়ে বড়। সুউচ্চ সুমহান আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই। হে রব্ব ! আমাকে ক্ষমা করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "যে ব্যক্তি তা বলবে তাকে ক্ষমা করে দেওয়া হবে। যদি সে দো‘আ করে, তবে তার দো‘আ কবুল হবে। যদি সে উঠে ওযু করে নামায পড়ে, তবে তার নামায কবুল করা হবে। বুখারী: ফাতহুল বারী, ৩/৩৯, নং ১১৫৪। হাদীসের ভাষ্য ইবন মাজাহ এর অনুরূপ। দেখুন, সহীহ ইবন মাজাহ্‌: ২/৩৩৫। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ (আল্‌হামদু লিল্লা-হিল্লাযী ‘আ-ফা-নী ফী জাসাদী, ওয়ারদ্দা ‘আলাইয়্যা রূহী ওয়া আযিনা লী বিযিকরিহী) “সকল হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি আমার দেহকে নিরাপদ করেছেন, আমার রূহকে আমার নিকট ফেরত দিয়েছেন এবং আমাকে তাঁর যিক্‌র করার অনুমতি (সুযোগ) দিয়েছেন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৪৭৩, নং ৩৪০১। দেখুন, সহীহুত তিরমিযী, ৩/১৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّيْلِ وَالنَّھَارِ لَاٰيٰتٍ لِّاُولِي الْاَلْبَابِ ١٩٠؁ڌالَّذِيْنَ يَذْكُرُوْنَ اللّٰهَ قِيٰمًا وَّقُعُوْدًا وَّعَلٰي جُنُوْبِھِمْ وَيَتَفَكَّرُوْنَ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ ۚ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًا ۚ سُبْحٰنَكَ فَقِنَا عَذَابَ النَّارِ ١٩١؁رَبَّنَآ اِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ اَخْزَيْتَهٗ ۭ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ ١٩٢؁رَبَّنَآ اِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِيْ لِلْاِيْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّاڰ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِ ١٩٣؁ۚرَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰي رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۭاِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ ١٩٤؁فَاسْتَجَابَ لَھُمْ رَبُّھُمْ اَنِّىْ لَآ اُضِيْعُ عَمَلَ عَامِلٍ مِّنْكُمْ مِّنْ ذَكَرٍ اَوْ اُنْثٰى ۚ بَعْضُكُمْ مِّنْۢ بَعْضٍ ۚ فَالَّذِيْنَ ھَاجَرُوْا وَاُخْرِجُوْا مِنْ دِيَارِھِمْ وَاُوْذُوْا فِيْ سَبِيْلِيْ وَقٰتَلُوْا وَقُتِلُوْا لَاُكَفِّرَنَّ عَنْھُمْ سَيِّاٰتِھِمْ وَلَاُدْخِلَنَّھُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِھَا الْاَنْھٰرُ ۚ ثَوَابًا مِّنْ عِنْدِ اللّٰهِ ۭوَاللّٰهُ عِنْدَهٗ حُسْنُ الثَّوَابِ ١٩٥؁لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا فِي الْبِلَادِ ١٩٦؁ۭ مَتَاعٌ قَلِيْلٌ ۣ ثُمَّ مَاْوٰىھُمْ جَهَنَّمُ ۭوَبِئْسَ الْمِھَادُ ١٩٧؁لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّھُمْ لَھُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِھَا الْاَنْھٰرُ خٰلِدِيْنَ فِيْھَا نُزُلًا مِّنْ عِنْدِ اللّٰهِ ۭ وَمَا عِنْدَ اللّٰهِ خَيْرٌ لِّلْاَبْرَارِ ١٩٨؁وَاِنَّ مِنْ اَھْلِ الْكِتٰبِ لَمَنْ يُّؤْمِنُ بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْكُمْ وَمَآ اُنْزِلَ اِلَيْھِمْ خٰشِعِيْنَ لِلّٰهِ ۙ لَا يَشْتَرُوْنَ بِاٰيٰتِ اللّٰهِ ثَـمَنًا قَلِيْلًا ۭ اُولٰۗىِٕكَ لَھُمْ اَجْرُھُمْ عِنْدَ رَبِّھِمْ ۭ اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ ١٩٩؁يٰٓاَيُّھَا الَّذِيْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرُوْا وَرَابِطُوْا ۣوَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ ٢٠٠؁ۧ (ইন্না ফী খলকিস্ সামাওয়াতি ওয়াল আরদি ওয়াখতিলা-ফিল লাইলি ওয়ান্নাহা-রি লাআয়া-তিল্ লিউলিল্ আলবা-ব। আল্লাযীনা ইয়াযকুরূনাল্লাহা কিয়া-মাও ওয়াকু‘উদাঁও ওয়া‘আলা জুনূবিহিম ওয়াইয়াতাফাক্কারূনা ফী খলকিস্ সামাওয়াতি ওয়াল আরদি, রববানা মা খালাকতা হাযা বা-তিলান, সুবহানাকা ফাকিনা ‘আযা-বান্ নার। রববানা ইন্নাকা মান তুদখিলিন্ না-রা ফাকাদ আখযাইতাহু, ওয়ামা লিয্যালিমীনা মিন আনসা-র। রববানা ইন্নানা সামি‘না মুনাদিইয়াইয়্যুনা-দী লিলঈমানি আন্ আ-মিনু বিরব্বিকুম ফাআ--মান্না। রব্বানা ফাগফির লানা যুনূবানা ওয়াকাফফির ‘আন্না সায়্যিআ-তিনা ওয়া তাওয়াফ্‌ফানা মা‘আল আবরা-র। রববানা ওয়া আতিনা মা ওয়া‘আদতানা ‘আলা রুসুলিকা ওয়ালা তুখযিনা ইয়াওমাল কিয়া-মাতি, ইন্নাকা লা তুখলিফুল মী‘আদ। ফাস্তাজাবা লাহুম রববুহুম আন্নী লা উদী‘উ আমালা ‘আমিলিম মিনকুম মিন যাকারিন ওয়া উনসা বা‘দুকুম মিন বা‘দ, ফাল্লাযীনা হা-জারূ ওয়া উখরিজূ মিন দিয়ারিহিম ওয়া ঊ-যূ ফী সাবীলী ওয়া কা-তালু ওয়া কু-তিলু লাউকাফফিরান্না ‘আনহুম সায়্যিআ-তিহিম ওয়ালাউদখিলান্নাহুম জান্না-তিন তাজরী মিন তাহ-তিহাল আনহারু, ছাওয়া-বাম্ মিন ‘ইনদিল্লাহি, ওয়াল্লা-হু ইনদাহু হুসনুছ ছাওয়া-ব। লা ইয়াগুররান্নাকা তাকল্লুবুল্লাযীনা কাফারূ ফিল্ বিলা-দ। মাতা‘উন কালীলুন ছুম্মা মা’ওয়াহুম জাহান্নামু ওয়া বি’সাল মিহা-দ। লা-কিনিল্লাযীনাত্তাকাও রববাহুম লাহুম জান্না-তুন তাজরী মিন তাহতিহাল আনহারু খা-লিদ্বীনা ফীহা নুযুলাম্ মিন ইনদিল্লাহি ওয়ামা ইনদাল্লাহি খাইরুল লিল্ আবরার। ওয়াইন্না মিন আহলিল কিতাবি লামইয়ূ’মিনু বিল্লাহি ওয়ামা উনযিলা ইলাইকুম ওয়ামা উনযিলা ইলাইহিম খা-শিঈনা লিল্লা-হি লা ইয়াশতারূনা বিআ-য়া-তিল্লাহি ছামানান্ কালীলা। উলা-ইকা লাহুম আজরুহুম ‘ইনদা রববিহিম। ইন্নাল্লাহা সারী‘উল হিসাব। ইয়া আয়্যুহাল্লাযীনা আমানুসবিরূ ওয়াসা-বিরূ ওয়া রা-বিতু ওয়াত্তাকুল্লাহা লা‘আল্লাকুম তুফলিহুন)। নিশ্চয় আসমানসমূহ ও যমীনের সৃষ্টিতে, রাত ও দিনের পরিবর্তনে নিদর্শনাবলী রয়েছে বোধশক্তি সম্পন্ন লোকদের জন্য। যারা দাঁড়িয়ে, বসে ও শুয়ে আল্লাহ্‌র স্মরণ করে এবং আসমানসমূহ ও যমীনের সৃষ্টি সম্বন্ধে চিন্তা করে, আর বলে, ‘হে আমাদের রব! আপনি এগুলো অনর্থক সৃষ্টি করেননি, আপনি অত্যন্ত পবিত্র, অতএব আপনি আমাদেরকে আগুনের শাস্তি হতে রক্ষা করুন।’ ‘হে আমাদের রব! আপনি কাউকেও আগুনে নিক্ষেপ করলে তাকে তো আপনি নিশ্চয়ই হেয় করলেন এবং যালেমদের কোন সাহায্যকারী নেই।’ ‘হে আমাদের রব, আমরা এক আহ্বায়ককে ঈমানের দিকে আহ্বান করতে শুনেছি, ‘তোমরা তোমাদের রবের উপর ঈমান আন।’ কাজেই আমরা ঈমান এনেছি। হে আমাদের রব! আপনি আমাদের পাপরাশি ক্ষমা করুন, আমাদের মন্দ কাজগুলো দূরীভূত করুন এবং আমাদেরকে সৎকর্মপরায়ণদের সহগামী করে মৃত্যু দিন। ‘হে আমাদের রব! আপনার রাসূলগণের মাধ্যমে আমাদেরকে যা দিতে প্রতিশ্রুতি দিয়েছেন তা আমাদেরকে দান করুন এবং কেয়ামতের দিন আমাদেরকে হেয় করবেন না। নিশ্চয় আপনি প্রতিশ্রুতির ব্যতিক্রম করেন না।’ তারপর তাদের রব তাদের ডাকে সাড়া দিয়ে বলেন, ‘নিশ্চয় আমি তোমাদের মধ্যে আমলকারী কোনো নর বা নারীর আমল বিফল করি না; তোমরা একে অপরের অংশ। কাজেই যারা হিজরত করেছে, নিজ ঘর থেকে উৎখাত হয়েছে, আমার পথে নির্যাতিত হয়েছে এবং যুদ্ধ করেছে ও নিহত হয়েছে আমি তাদের পাপ কাজগুলো অবশ্যই দূর করব এবং অবশ্যই তাদেরকে প্রবেশ করাব জান্নাতে, যার পাদদেশে নদী প্রবাহিত। এটা আল্লাহ্‌র কাছ থেকে পুরস্কার; আর উত্তম পুরস্কার আল্লাহ্‌রই কাছে রয়েছে। যারা কুফরী করেছে, দেশে দেশে তাদের অবাধ বিচরণ যেন কিছুতেই আপনাকে বিভ্রান্ত না করে। এ তো স্বল্পকালীন ভোগ মাত্র; তারপর জাহান্নাম তাদের আবাস; আর ওটা কত নিকৃষ্ট বিশ্রামস্থল! কিন্তু যারা তাদের রবকে ভয় করে তাদের জন্য রয়েছে জান্নাত, যার পাদদেশে নদী প্রবাহিত, সেখানে তারা স্থায়ী হবে। এ হচ্ছে আল্লাহ্‌র পক্ষ থেকে আতিথেয়তা; আর আল্লাহ্‌র কাছে যা আছে তা সৎকর্মপরায়ণদের জন্য উত্তম। আর নিশ্চয় কিতাবীদের মধ্যে এমন লোকও আছে যারা আল্লাহ্‌র প্রতি বিনয়াবনত হয়ে তাঁর প্রতি এবং তিনি যা তোমাদের ও তাদের প্রতি নাযিল করেছেন তাতে ঈমান আনে। তারা আল্লাহ্‌র আয়াত তুচ্ছ মূল্যে বিক্রি করে না। তারাই, যাদের জন্য আল্লাহ্‌র কাছে পুরস্কার রয়েছে। নিশ্চয়ই আল্লাহ্ দ্রুত হিসাব গ্রহণকারী। হে ঈমানদারগণ! তোমরা ধৈর্য ধারণ কর, ধৈর্যে প্রতিযোগিতা কর এবং সবসময় যুদ্ধের জন্য প্রস্তুত থাক, আর আল্লাহ্‌র তাকওয়া অবলম্বন কর; যাতে তোমরা সফলকাম হতে পার”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সূরা আলে ইমরান ১৯০-২০০; বুখারী, ফাতহুল বারীসহ ৮/৩৩৭, নং ৪৫৬৯; মুসলিম ১/৫৩০, নং ২৫৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১. ঘুম থেকে জেগে উঠার সময়ের যিক্‌রসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "1-(1) «الْحَمْدُ لِلَّهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُوْرُ». (আলহামদু লিল্লা-হিল্লাযী আহ্ইয়া-না- বা‘দা মা- আমা-তানা- ওয়া ইলাইহিন্ নুশূর) ১-(১) “হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি (নিদ্রারূপ) মৃত্যুর পর আমাদেরকে জীবিত করলেন, আর তাঁরই নিকট সকলের পুনরুত্থান”[1]।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "[1] বুখারী ফাতহুল বারী ১১/১১৩, নং ৬৩১৪; মুসলিম ৪/২০৮৩, নং ২৭১১। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "3- (3) «الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ». (আল্‌হামদু লিল্লা-হিল্লাযী ‘আ-ফা-নী ফী জাসাদী, ওয়ারদ্দা ‘আলাইয়্যা রূহী ওয়া আযিনা লী বিযিকরিহী) ৩-(৩) “সকল হামদ-প্রশংসা আল্লাহ্‌র জন্য, যিনি আমার দেহকে নিরাপদ করেছেন, আমার রূহকে আমার নিকট ফেরত দিয়েছেন এবং আমাকে তাঁর যিক্‌র করার অনুমতি (সুযোগ) দিয়েছেন”[3]।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "[3] তিরমিযী ৫/৪৭৩, নং ৩৪০১। দেখুন, সহীহুত তিরমিযী, ৩/১৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "2-(2) «لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ» «رَبِّ اغْفرْ لِي». (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহূ লা- শারীকালাহূ, লাহুল মুলকু, ওয়ালাহুল হামদু, ওয়াহুয়া ‘আলা কুল্লি শায়ইন ক্বাদীর। সুবহা-নাল্লাহি, ওয়ালহামদু লিল্লাহি, ওয়া লা ইলা-হা ইল্লাল্লা-হু, ওয়াল্লা-হু আকবার, ওয়া লা- হাওলা ওয়ালা- কুওয়াতা ইল্লা- বিল্লা-হিল ‘আলিয়্যিল ‘আযীম, রাব্বিগফির লী)। ২-(২) “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, প্রশংসাও তাঁরই; আর তিনি সকল কিছুর ওপর ক্ষমতাবান। আল্লাহ পবিত্র-মহান। সকল হামদ-প্রশংসা আল্লাহ্‌র। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই। আল্লাহ সবচেয়ে বড়। সুউচ্চ সুমহান আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই। হে রব্ব ! আমাকে ক্ষমা করুন”।[2]",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "[2] যে ব্যক্তি তা বলবে তাকে ক্ষমা করে দেওয়া হবে। যদি সে দো‘আ করে, তবে তার দো‘আ কবুল হবে। যদি সে উঠে ওযু করে নামায পড়ে, তবে তার নামায কবুল করা হবে। বুখারী: ফাতহুল বারী, ৩/৩৯, নং ১১৫৪। হাদীসের ভাষ্য ইবন মাজাহ এর অনুরূপ। দেখুন, সহীহ ইবন মাজাহ্‌: ২/৩৩৫। ",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৫. সালাম ফিরানোর পর যিকরসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "দুই হাতের তালু একত্রে মিলিয়ে নিম্নোক্ত সূরাগুলো পড়ে তাতে ফুঁ দিবে: بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ هُوَ اللّٰهُ اَحَدٌ ۝ۚ اَللّٰهُ الصَّمَدُ ۝ۚ لَمْ يَلِدْ ڏ وَلَمْ يُوْلَدْ ۝ وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ ۝ۧ﴾، বিসমিল্লাহির রাহমানির রাহীম (ক্বুল হুওয়াল্লা-হু আহাদ। আল্লাহুস্ সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, তিনি আল্লাহ্, এক-অদ্বিতীয়। আল্লাহ্ হচ্ছেন ‘সামাদ’ (তিনি কারো মুখাপেক্ষী নন, সকলেই তাঁর মুখাপেক্ষী)। তিনি কাউকেও জন্ম দেন নি এবং তাঁকেও জন্ম দেয়া হয় নি। আর তাঁর সমতুল্য কেউই নেই।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۝ مِنْ شَرِّ مَا خَلَقَ ۝ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۝ وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ ۝ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۝﴾، বিসমিল্লাহির রাহমানির রাহীম (ক্বুল আ‘উযু বিরব্বিল ফালাক্ব। মিন শাররি মা খালাক্ব। ওয়া মিন শাররি গা-সিক্বিন ইযা ওয়াক্বাব। ওয়া মিন শাররিন নাফফা-সা-তি ফিল ‘উক্বাদ। ওয়া মিন শাররি হা-সিদিন ইযা হাসাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি ঊষার রবের। তিনি যা সৃষ্টি করেছেন তার অনিষ্ট হতে। ‘আর অনিষ্ট হতে রাতের অন্ধকারের, যখন তা গভীর হয়। আর অনিষ্ট হতে সমস্ত নারীদের, যারা গিরায় ফুঁক দেয়। আর অনিষ্ট হতে হিংসুকের, যখন সে হিংসা করে।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ اِلٰهِ النَّاسِ ۝ مِنْ شَرِّ الْوَسْوَاسِ ڏ الْخَنَّاسِ ۝ الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ ۝ۧ﴾ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল ‘আউযু বিরাব্বিন্না-স। মালিকিন্না-সি, ইলা-হিন্নাসি, মিন শাররিল ওয়াসওয়া-সিল খান্না-স, আল্লাযি ইউওয়াসউইসু ফী সুদূরিন না-সি, মিনাল জিন্নাতি ওয়ান্না-স।)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি মানুষের রবের, মানুষের অধিপতির, মানুষের ইলাহের কাছে, আত্মগোপনকারী কুমন্ত্রণাদাতার অনিষ্ট হতে; যে কুমন্ত্রণা দেয় মানুষের অন্তরে, জিনের মধ্য থেকে এবং মানুষের মধ্য থেকে।” তারপর দুই হাতের তালু দ্বারা দেহের যতোটা অংশ সম্ভব মাসেহ করবে। মাসেহ আরম্ভ করবে তার মাথা, মুখমণ্ডল ও দেহের সামনের দিক থেকে। (এভাবে ৩ বার করবে।)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৯/৬২, নং ৫০১৭; মুসলিম ৪/১৭২৩, নং ২১৯২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اَللّٰهُ لَآ اِلٰهَ اِلَّا ھُوَ ۚ اَلْـحَيُّ الْقَيُّوْمُ ڬ لَا تَاْخُذُهٗ سِـنَةٌ وَّلَا نَوْمٌ ۭ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖ ۭ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَھُمْ ۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۗءَ ۚ وَسِعَ كُرْسِـيُّهُ السَّمٰوٰتِ وَالْاَرْضَ ۚ وَلَا يَـــــُٔـــوْدُهٗ حِفْظُهُمَا ۚ وَھُوَ الْعَلِيُّ الْعَظِيْمُ ٢٥٥؁ (আল্লা-হু লা ইলা-হা ইল্লা হুওয়াল হাইয়্যূল কাইয়্যূমু লা তা’খুযুহু সিনাতুঁও ওয়ালা নাউম। লাহূ মা-ফিসসামা-ওয়া-তি ওয়ামা ফিল আরদ্বি। মান যাল্লাযী ইয়াশফা‘উ ‘ইনদাহূ ইল্লা বিইযনিহী। ইয়া‘লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম। ওয়ালা ইয়ুহীতূনা বিশাইইম মিন্ ইলমিহী ইল্লা বিমা শাআ। ওয়াসি‘আ কুরসিয়্যুহুস সামা-ওয়া-তি ওয়াল আরদ্ব। ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল ‘আলিয়্যূল ‘আযীম)। “আল্লাহ্, তিনি ছাড়া কোনো সত্য ইলাহ্ নেই। তিনি চিরঞ্জীব, সর্বসত্তার ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না, নিদ্রাও নয়। আসমানসমূহে যা রয়েছে ও যমীনে যা রয়েছে সবই তাঁর। কে সে, যে তাঁর অনুমতি ব্যতীত তাঁর কাছে সুপারিশ করবে? তাদের সামনে ও পিছনে যা কিছু আছে তা তিনি জানেন। আর যা তিনি ইচ্ছে করেন তা ছাড়া তাঁর জ্ঞানের কোনো কিছুকেই তারা পরিবেষ্টন করতে পারে না। তাঁর ‘কুরসী’ আসমানসমূহ ও যমীনকে পরিব্যাপ্ত করে আছে; আর এ দুটোর রক্ষণাবেক্ষণ তাঁর জন্য বোঝা হয় না। আর তিনি সুউচ্চ সুমহান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সূরা আল-বাকারাহ্‌-২৫৫। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন: ‘যে কেউ যখন রাতে আপন বিছানায় যাবে এবং ‘আয়াতুল কুরসী’ পড়বে, তখন সে রাতের পুরো সময় আল্লাহর পক্ষ থেকে তার জন্য হেফাযতকারী থাকবে; আর সকাল হওয়া পর্যন্ত শয়তান তার নিকটেও আসতে পারবে না’। বুখারী, (ফাতহুল বারীসহ), ৪/৪৮৭, নং ২৩১১। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اٰمَنَ الرَّسُوْلُ بِمَآ اُنْزِلَ اِلَيْهِ مِنْ رَّبِّهٖ وَالْمُؤْمِنُوْنَ ۭ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰۗىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ ۣلَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْ رُّسُلِهٖ ۣ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا ڭ غُفْرَانَكَ رَبَّنَا وَاِلَيْكَ الْمَصِيْرُ ٢٨٥؁لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا ۭ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۭرَبَّنَا لَا تُؤَاخِذْنَآ اِنْ نَّسِيْنَآ اَوْ اَخْطَاْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ اِصْرًا كَمَا حَمَلْتَهٗ عَلَي الَّذِيْنَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ ۚ وَاعْفُ عَنَّا ۪ وَاغْفِرْ لَنَا ۪ وَارْحَمْنَا ۪ اَنْتَ مَوْلٰىنَا فَانْــصُرْنَا عَلَي الْقَوْمِ الْكٰفِرِيْنَ ٢٨٦؀ۧ (আ-মানার রাসূলু বিমা উনযিলা ইলাইহি মির রব্বিহী ওয়াল মু’মিনূন। কুল্লুন আ-মানা বিল্লা-হি ওয়া মালা-ইকাতিহী ওয়াকুতুবিহী ওয়া রুসুলিহ, লা নুফাররিক্বু বাইনা আহাদিম মির রুসুলিহ, ওয়া ক্বালু সামি‘না ওয়া আতা‘না গুফ্‌রা-নাকা রব্বানা ওয়া ইলাইকাল মাসীর। লা ইয়ুকাল্লিফুল্লাহু নাফ্‌সান ইল্লা উস‘আহা লাহা মা কাসাবাত ওয়া আলাইহা মাক্তাসাবাত রব্বানা লা তুআখিয্‌না ইন নাসীনা আও আখ্‌ত্বা’না। রব্বনা ওয়ালা তাহ্‌মিল ‘আলাইনা ইসরান কামা হামালতাহু ‘আলাল্লাযীনা মিন ক্বাবলিনা। রব্বনা ওয়ালা তুহাম্মিলনা মা-লা ত্বা-ক্বাতা লানা বিহী। ওয়া‘ফু আন্না ওয়াগফির লানা ওয়ারহামনা আনতা মাওলা-না ফানসুরনা ‘আলাল ক্বাউমিল কাফিরীন)। “রাসূল তার প্রভুর পক্ষ থেকে যা তার কাছে নাযিল করা হয়েছে তার উপর ঈমান এনেছেন এবং মুমিনগণও। প্রত্যেকেই ঈমান এনেছে আল্লাহর উপর, তাঁর ফেরেশ্তাগণ, তাঁর কিতাবসমূহ এবং তাঁর রাসূলগণের উপর। আমরা তাঁর রাসূলগণের কারও মধ্যে তারতম্য করি না। আর তারা বলে, আমরা শুনেছি ও মেনে নিয়েছি। হে আমাদের রব! আপনার ক্ষমা প্রার্থনা করি এবং আপনার দিকেই প্রত্যাবর্তনস্থল। আল্লাহ্ কারো উপর এমন কোন দায়িত্ব চাপিয়ে দেন না যা তার সাধ্যাতীত। সে ভাল যা উপার্জন করে তার প্রতিফল তারই, আর মন্দ যা কামাই করে তার প্রতিফল তার উপরই বর্তায়। ‘হে আমাদের রব! যদি আমরা বিস্মৃত হই অথবা ভুল করি তবে আপনি আমাদেরকে পাকড়াও করবেন না। হে আমাদের রব! আমাদের পূর্ববর্তীগণের উপর যেমন বোঝা চাপিয়ে দিয়েছিলেন আমাদের উপর তেমন বোঝা চাপিয়ে দিবেন না। হে আমাদের রব! আপনি আমাদেরকে এমন কিছু বহন করাবেন না যার সামর্থ আমাদের নেই। আর আপনি আমাদের পাপ মোচন করুন, আমাদেরকে ক্ষমা করুন, আমাদের প্রতি দয়া করুন, আপনিই আমাদের অভিভাবক। অতএব কাফির সম্প্রদায়ের বিরুদ্ধে আমাদেরকে সাহায্য করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সূরা আল-বাকারা ২৮৫-২৮৬। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন: যে ব্যক্তি রাতের বেলা সূরা বাকারার শেষ দুটি আয়াত পড়বে, তা তার জন্য যথেষ্ট হবে। বুখারী, ফাতহুল বারীসহ, ৯/৯৪, ৪০০৮; মুসলিম ১/৫৫৪, নং ৮০৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ». (বিইসমিকা রব্বী ওয়াদা‘তু জাম্বী, ওয়া বিকা আরফা‘উহু। ফাইন্ আম্‌সাক্তা নাফ্‌সী ফারহামহা, ওয়াইন আরসালতাহা ফাহ্‌ফায্‌হা বিমা তাহ্‌ফাযু বিহী ‘ইবা-দাকাস সা-লিহীন)। “আমার রব! আপনার নামে আমি আমার পার্শ্বদেশ রেখেছি (শুয়েছি) এবং আপনারই নাম নিয়ে আমি তা উঠাবো। যদি আপনি (ঘুমন্ত অবস্থায়) আমার প্রাণ আটকে রাখেন, তবে আপনি তাকে দয়া করুন। আর যদি আপনি তা ফেরত পাঠিয়ে দেন, তাহলে আপনি তার হেফাযত করুন যেভাবে আপনি আপনার সৎকর্মশীল বান্দাগণকে হেফাযত করে থাকেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন: ‘তোমাদের কোনো ব্যক্তি তার বিছানা ত্যাগ করলো, আবার ঘুমাতে ফিরে এলো সে যেনো তার চাদর বা লুঙ্গির আঁচল দিয়ে তিনবার বিছানাটি ঝেড়ে নেয়। আর যেন সে বিসমিল্লাহ পড়ে, (আল্লাহর নাম নেয়); কেননা সে জানে না যে, তার চলে যাবার পর এতে কী পতিত হয়েছে। তারপর সে যখন শোয়, তখন যেনো এ দো‘আটি বলে। (হাদীসে বর্ণিত صنفة إزاره শব্দের অর্থ হচ্ছে, চাদরের পার্শ্বদিকস্থ অংশ। এর জন্য দেখুন, নিহায়া ফী গারিবিল হাদীস ওয়াল আসার’ ‘صنف’।) বুখারী, ফাতহুল বারীসহ ১১/১২৬, নং ৬৩২০; মুসলিম ৪/২০৮৪, নং ২৭১৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ (আল্লা-হুম্মা ইন্নাকা খালাক্তা নাফসী ওয়া আন্তা তাওয়াফ্‌ফাহা। লাকা মামা-তুহা ওয়া মাহ্‌ইয়া-হা। ইন্ আহ্ইয়াইতাহা ফাহ্‌ফায্‌হা ওয়াইন আমাত্তাহা ফাগফির লাহা। আল্লা-হুম্মা ইন্নী আস্আলুকাল ‘আ-ফিয়াতা)। “হে আল্লাহ! নিশ্চয় আপনি আমার আত্মাকে সৃষ্টি করেছেন এবং আপনি তার মৃত্যু ঘটাবেন। তার মৃত্যু ও তার জীবন আপনার মালিকানায়। যদি তাকে বাঁচিয়ে রাখেন তাহলে আপনি তার হেফাযত করুন, আর যদি তার মৃত্যু ঘটান তবে তাকে মাফ করে দিন। হে আল্লাহ! আমি আপনার কাছে নিরাপত্তা চাই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৮৩, নং ২৭১২; আহমাদ, তাঁর শব্দে ২/৭৯, নং ৫৫০২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ (আল্লা-হুম্মা ক্বিনী ‘আযা-বাকা ইয়াওমা তাব‘আছু ‘ইবা-দাকা)। “হে আল্লাহ! আমাকে আপনার আযাব থেকে রক্ষা করুন, যেদিন আপনি আপনার বান্দাদেরকে পুনর্জীবিত করবেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, শব্দ তাঁরই, ৪/৩১১, নং ৫০৪৫; তিরমিযী, নং ৩৩৯৮; আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪৩; সহীহ আবী দাঊদ, ৩/২৪০।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا (বিস্‌মিকাল্লা-হুম্মা আমূতু ওয়া আহ্ইয়া)। “হে আল্লাহ ! আপনার নাম নিয়েই আমি মরছি (ঘুমাচ্ছি) এবং আপনার নাম নিয়েই জীবিত (জাগ্রত) হবো।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১১/১১৩, নং ৬৩২৪; মুসলিম ৪/২০৮৩, নং ২৭১১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (সুবহা-নাল্লাহ, (৩৩ বার) আলহামদুলিল্লা-হ (৩৩ বার) আল্লা-হু আকবার (৩৪ বার)-) আল্লাহ অতি-পবিত্র (৩৩ বার), সকল প্রশংসা আল্লাহর জন্য (৩৩ বার), আল্লাহ অতি-মহান (৩৪ বার)।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী এবং ফতেমাকে বলেন: আমি কি তোমাদেরকে এমন কিছু বলে দিবো না যা তোমাদের জন্য খাদেম অপেক্ষাও উত্তম হবে? যখন তোমরা তোমাদের বিছানায় যাবে, তখন তোমরা দু’জনে ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদু লিল্লাহ, এবং ৩৪ বার বলবে, যা তা খাদেম অপেক্ষাও তোমাদের জন্য উত্তম হবে’’। বুখারী, (ফাতহুল বারীসহ) ৭/৭১, নং ৩৭০৫; মুসলিম ৪/২০৯১, নং ২৭২৬। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ (আল্লা-হুম্মা রব্বাস্ সামা-ওয়া-তিস্ সাব‘ই ওয়া রব্বাল ‘আরশিল ‘আযীম, রব্বনা ওয়া রব্বা কুল্লি শাই’ইন্, ফা-লিক্বাল হাব্বি ওয়ান-নাওয়া, ওয়া মুনযিলাত্-তাওরা-তি ওয়াল ইনজীলি ওয়াল ফুরক্বা-ন, আ‘ঊযু বিকা মিন শাররি কুল্লি শাই’ইন্ আনতা আ-খিযুম-বিনা-সিয়াতিহি। আল্লা-হুম্মা আনতাল আউওয়ালু ফালাইসা ক্বাবলাকা শাইউন। ওয়া আনতাল আ-খিরু ফালাইসা বা‘দাকা শাইউন। ওয়া আনতায যা-হিরু ফালাইসা ফাওক্বাকা শাইউন। ওয়া আনতাল বা-ত্বিনু ফালাইসা দূনাকা শাইউন। ইক্বদ্বি ‘আন্নাদ্-দাইনা ওয়া আগনিনা মিনাল ফাক্বরি)। হে আল্লাহ! হে সপ্ত আকাশের রব্ব, যমিনের রব্ব, মহান ‘আরশের রব্ব, আমাদের রব্ব ও প্রত্যেক বস্তুর রব্ব, হে শস্য-বীজ ও আঁটি বিদীর্ণকারী, হে তাওরাত, ইনজীল ও কুরআন নাযিলকারী, আমি প্রত্যেক এমন বস্তুর অনিষ্ট থেকে আপনার নিকট আশ্রয় প্রার্থনা করি, যার (মাথার) অগ্রভাগ আপনি ধরে রেখেছেন (নিয়ন্ত্রণ করছেন)। হে আল্লাহ! আপনিই প্রথম, আপনার পূর্বে কিছুই ছিল না; আপনি সর্বশেষ, আপনার পরে কোনো কিছু থাকবে না; আপনি সব কিছুর উপরে, আপনার উপরে কিছুই নেই; আপনি সর্বনিকটে, আপনার চেয়ে নিকটবর্তী কিছু নেই, আপনি আমাদের সমস্ত ঋণ পরিশোধ করে দিন এবং আমাদেরকে অভাবগ্রস্ততা থেকে অভাবমুক্ত করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৮৪, নং ২৭১৩। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ (আলহামদু লিল্লা-হিল্লাযী আত‘আমানা, ওয়া সাক্বা-না, ওয়া কাফা-না, ওয়া আ-ওয়ানা, ফাকাম্ মিম্মান লা কা-ফিয়া লাহু, ওয়ালা মু’উইয়া)। “সকল প্রশংসা আল্লাহ্‌র জন্য, যিনি আমাদেরকে আহার করিয়েছেন, পান করিয়েছেন, আমাদের প্রয়োজন পূর্ণ করেছেন এবং আমাদেরকে আশ্রয় দিয়েছেন। কেননা, এমন বহু লোক আছে যাদের প্রয়োজনপূর্ণকারী কেউ নেই এবং যাদের আশ্রয়দানকারীও কেউ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২০৮৫, নং ২৭১৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ (আল্লা-হুম্মা ‘আ-লিমাল গাইবি ওয়াশ শাহা-দাতি, ফা-ত্বিরাস সামা-ওয়া-তি ওয়াল আরদ্বি, রাব্বা কুল্লি শাই’ইন ওয়া মালীকাহু, আশহাদু আল্লা ইলা-হা ইল্লা আনতা, আ‘উযু বিকা মিন শাররি নাফসী, ওয়ামিন শাররিশ শাইত্বা-নী ওয়াশিরকিহী/ওয়াশারাকিহী, ওয়া আন আক্বতারিফা ‘আলা নাফসী সূ’আন আউ আজুররাহু ইলা মুসলিম) “হে আল্লাহ! হে গায়েব ও উপস্থিতের জ্ঞানী, হে আসমানসমূহ ও যমীনের স্রষ্টা, হে সব কিছুর রব্ব ও মালিক! আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি আপনার কাছে আশ্রয় চাই আমার আত্মার অনিষ্ট থেকে, শয়তানের অনিষ্টতা থেকে ও তার শির্ক বা তার ফাঁদ থেকে, আমার নিজের উপর কোনো অনিষ্ট করা, অথবা কোনো মুসলিমের দিকে তা টেনে নেওয়া থেকে।” আলিফ লাম মীম তানযীলায সাজদাহ ও তাবারাকাল্লাযী বিয়াদিহিল মুলক’ সূরাদ্বয় পড়বে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, ৪/৩১৭, নং ৫০৬৭; তিরমিযী, নং ৩৬২৯; আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪২। রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূরা সাজদা এবং সূরা মুলক না পড়ে ঘুমাতেন না। তিরমিযী, নং ৩৪০৪; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭০৭। আরও দেখুন, সহীহুল জামে‘ ৪/২৫৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ (আল্লা-হুম্মা আস্‌লামতু নাফ্‌সী ইলাইকা, ওয়া ফাউওয়াদ্বতু আমরী ইলাইকা, ওয়া ওয়াজ্জাহ্‌তু ওয়াজহিয়া ইলাইকা, ওয়াআলজা’তু যাহ্‌রী ইলাইকা, রাগবাতান ওয়া রাহবাতান ইলাইকা। লা মালজা’আ ওয়ালা মান্‌জা মিনকা ইল্লা ইলাইকা। আ-মানতু বিকিতা-বিকাল্লাযী আনযালতা ওয়াবিনাবিয়্যিকাল্লাযী আরসালতা)। “হে আল্লাহ![ আমি নিজেকে আপনার কাছে সঁপে দিলাম। আমার যাবতীয় বিষয় আপনার কাছেই সোপর্দ করলাম, আমার চেহারা আপনার দিকেই ফিরালাম, আর আমার পৃষ্ঠদেশকে আপনার দিকেই ন্যস্ত করলাম; আপনার প্রতি অনুরাগী হয়ে এবং আপনার ভয়ে ভীত হয়ে। একমাত্র আপনার নিকট ছাড়া আপনার (পাকড়াও) থেকে বাঁচার কোনো আশ্রয়স্থল নেই এবং কোনো মুক্তির উপায় নেই। আমি ঈমান এনেছি আপনার নাযিলকৃত কিতাবের উপর এবং আপনার প্রেরিত নবীর উপর।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, “যখন তুমি বিছানা গ্রহণ করবে, তখন নামাযের মত ওযু করবে, তারপর তোমার ডান পার্শ্বদেশে শুয়ে পড়বে। তারপর বল, ..... আল-হাদীস। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাকে এ দো‘আটি শিক্ষা দিলেন, তাকে বলেন: যদি তুমি ঐ রাতে মারা যাও তবে ‘ফিতরাত’ তথা দীন ইসলামের উপর মারা গেলে। বুখারী, (ফাতহুল বারীসহ) ১১/১১৩, নং ৬৩১৩; মুসলিম ৪/২০৮১, নং ২৭১০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৮. ঘুমানোর যিক্‌রসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "-لاَ إِلَهَ إِلاَّ اللَّهُ الْوَاحِدُ الْقَهّارُ، رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزيزُ الْغَفَّارُ (লা ইলা-হা ইল্লাল্লা-হুল ওয়াহিদুল কাহ্‌হারু রব্বুস্ সামা-ওয়া-তি ওয়াল-আরদ্বি ওয়ামা বাইনাহুমাল-‘আযীযুল গাফ্‌ফার)। “মহাপ্রতাপশালী এক আল্লাহ ছাড়া আর কোনো হক্ব ইলাহ নেই। (তিনি) আসমানসমূহ, যমীন এবং এ দু’য়ের মধ্যস্থিত সবকিছুর রব্ব, প্রবলপরাক্রমশালী, পরম ক্ষমাশীল।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আয়েশা রাদিয়াল্লাহু আনহা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতে যখন বিছানায় পার্শ্ব পরিবর্তন করতেন তখন তা বলতেন। হাদীসটি সংকলন করেছেন, হাকেম এবং তিনি তা সহীহ বলেছেন, আর ইমাম যাহাবী তাকে সমর্থন করেছেন, ১/৫৪০; নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলা, নং ২০২; ইবনুস সুন্নী, নং ৭৫৭। আরও দেখুন, সহীহুল জামে‘ ৪/২১৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৯. রাতে যখন পার্শ্ব পরিবর্তন করে তখন পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّياطِينِ وَأَنْ يَحْضُرُونِ (আ‘ঊযু বিকালিমা-তিল্লাহিত্তা-ম্মাতি মিন্ গাদ্বাবিহি ওয়া ইক্বা-বিহি ওয়া শাররি ‘ইবা-দিহি ওয়ামিন হামাযা-তিশ্‌শায়া-ত্বীনি ওয়া আন ইয়াহ্‌দুরূন)। “আমি আশ্রয় চাই আল্লাহ্‌র পরিপূর্ণ কালামসমূহের অসীলায় তাঁর ক্রোধ থেকে, তাঁর শাস্তি থেকে, তাঁর বান্দাদের অনিষ্ট থেকে, শয়তানদের কুমন্ত্রণা থেকে এবং তাদের উপস্থিতি থেকে।”[",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাঊদ ৪/১২, নং ৩৮৯৩; তিরমিযী, নং ৩৫২৮। আরও দেখুন, সহীহুত তিরমিযী ৩/১৭১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩০. ঘুমন্ত অবস্থায় ভয় এবং একাকিত্বের অস্বস্তিতে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“তার বাম দিকে হাল্কা থুথু ফেলবে।” (৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/১৭৭২, নং ২২৬১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“শয়তান থেকে এবং যা দেখেছে তার অনিষ্ট থেকে আল্লাহর কাছে আশ্রয় চাইবে প্রার্থনা করবে।” (৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/১৭৭২, ১৭৭৩, নং ২২৬১, ২২৬২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“কাউকে এ ব্যাপারে কিছু বলবে না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/১৭৭২, নং ২২৬১ ও নং ২২৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“অতঃপর যে পার্শ্বে সে ঘুমিয়েছিল তা পরিবর্তন করবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/১৭৭৩, নং ২২৬১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যদি ইচ্ছা করে তবে উঠে সালাত আদায় করবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/১৭৭৩, নং ২২৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩১. খারাপ স্বপ্ন বা দুঃস্বপ্ন দেখে যা করবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যখন তোমরা রাত্রিবেলা কুকুরের ডাক ও গাধার স্বর শুনবে, তখন তোমরা সেগুলো থেকে আল্লাহ্‌র কাছে আশ্রয় চাও; কেননা সেগুলো তা দেখে তোমরা যা দেখতে পাও না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাঊদ ৪/৩২৭, নং ৫১০৫; আহমাদ ৩/৩০৬, নং ১৪২৮৩। আর শাইখ আলবানী একে সহীহ আবি দাউদে ৩/৯৬১, সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১১. রাতের বেলায় কুকুরের ডাক শুনলে দো‘আ",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "পবিত্রতা ও সালাত [নামাজ]",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ (বিস্‌মিল্লাহ্) ‘আল্লাহ্‌র নামে",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, নং ১০১; ইবন মাজাহ্‌, নং ৩৯৭; আহমাদ নং ৯৪১৮। আরও দেখুন, ইরওয়াউল গালীল ১/১২২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮. ওযুর পূর্বে যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ (আশ্‌হাদু আল্লা-ইলাহা ইল্লাল্লাহু ওয়াহ্‌দাহু লা- শারীকা লাহূ ওয়া আশহাদু আন্না মুহাম্মাদান ‘আব্দুহূ ওয়া রাসূলুহূ) “আমি সাক্ষ্য দিচ্ছি যে, একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ তাঁর বান্দা ও রাসূল”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/২০৯, নং ২৩৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ (আল্লা-হুম্মাজ‘আলনী মিনাত্ তাওয়াবীনা ওয়াজ‘আলনী মিনাল মুতাতাহ্‌হিরীন) “হে আল্লাহ! আপনি আমাকে তাওবাকারীদের অন্তর্ভুক্ত করুন এবং পবিত্রতা অর্জনকারীদেরও অন্তর্ভুক্ত করুন।”]",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরিমিযী-১/৭৮, নং ৫৫। আরও দেখুন, সহীহুত তিরমিযী, ১/১৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ (সুবহানাকা আল্লা-হুম্মা ওয়া বিহামদিকা আশহাদু আল লা-ইলাহা ইল্লা আন্তা আস্তাগফিরুকা ওয়াআতূবু ইলাইকা)। “হে আল্লাহ! আপনার প্রশংসাসহ পবিত্রতা ও মহিমা ঘোষণা করছি। আমি সাক্ষ্য দেই যে, আপনি ছাড়া কোনো হক্ব ইলাহ নেই, আমি আপনার কাছে ক্ষমা প্রার্থনা করছি এবং আপনার নিকট তওবা করছি”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, পৃ. ১৭৩। আরও দেখুন, ইরওয়াউল গালীল, ১/১৩৫, ৩/৯৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯. ওযু শেষ করার পর যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً». [اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي] [وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً»] [وَهَبْ لِي نُوراً عَلَى نُورٍ (আল্লা-হুম্মাজ‘আল ফী ক্বালবী নূরান, ওয়া ফী লিসানী নূরান, ওয়া ফী সাম্‘য়ী নূরান, ওয়া ফী বাসারী নূরান, ওয়া মিন ফাওকী নূরান, ওয়া মিন তাহ্‌তী নূরান, ওয়া ‘আন ইয়ামীনী নূরান, ওয়া ‘আন শিমালী নূরান, ওয়া মিন আমামী নূরান, ওয়া মিন খলফী নূরান, ওয়াজ‘আল ফী নাফ্‌সী নূরান, ওয়া আ‘যিম লী নূরান, ওয়া ‘আয্‌যিম লী নূরান, ওয়াজ‘আল্ লী নূরান, ওয়াজ‘আলনী নূরান; আল্লা-হুম্মা আ‘তিনী নূরান, ওয়াজ‘আল ফী ‘আসাবী নূরান, ওয়া ফী লাহ্‌মী নূরান, ওয়া ফী দামী নূরান, ওয়া ফী শা‘রী নূরান, ওয়া ফী বাশারী নূরান। [আল্লা-হুম্মাজ‘আল লী নূরান ফী কাবরী, ওয়া নূরান ফী ‘ইযামী] [ওয়া যিদ্‌নী নূরান, ওয়া যিদনী নূরান, ওয়া যিদনী নূরান] [ওয়া হাবলী নূরান ‘আলা নুর] “হে আল্লাহ! আপনি আমার অন্তরে নূর (বা আলো) দান করুন, আমার যবানে নূর দান করুন, আমার শ্রবণশক্তিতে নূর দান করুন, আমার দর্শনশক্তিতে নূর দান করুন, আমার উপরে নূর দান করুন, আমার নীচে নূর দান করুন, আমার ডানে নূর দান করুন, আমার বামে নূর দান করুন, আমার সামনে নূর দান করুন, আমার পেছনে নূর দান করুন, আমার আত্মায় নূর দান করুন, আমার জন্য নূরকে বড় করে দিন, আমার জন্য নূর বাড়িয়ে দিন, আমার জন্য নূর নির্ধারণ করুন, আমাকে আলোকময় করুন। হে আল্লাহ! আমাকে নূর দান করুন, আমার পেশীতে নূর প্রদান করুন, আমার গোশ্‌তে নূর দান করুন, আমার রক্তে নূর দান করুন, আমার চুলে নূর দান করুন ও আমার চামড়ায় নূর দান করুন।” “হে আল্লাহ! আমার জন্য আমার কবরে নূর দিন, আমার হাড়সমূহেও নূর দিন”,“আমাকে নূরে বৃদ্ধি করে দিন, আমাকে নূরে বৃদ্ধি করে দিন, আমাকে নূরে বৃদ্ধি করে দিন”3“আমাকে নূরের উপর নূর দান করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "এ শব্দগুলোর জন্য দেখুন, বুখারী, (ফাতহুল বারীসহ) ১১/১১৬, নং ৬৩১৬; মুসলিম ১/৫২৬, ৫২৯, ৫৩০, নং ৭৬৩। তিরমিযী ৫/৪৮৩, নং ৩৪১৯। ইমাম বুখারী, আল-আদাবুল মুফরাদ, নং ৬৯৫; পৃ. ২৫৮; আর আলবানী সেটার সনদকে সহীহ আদাবিল মুফরাদে সহীহ বলেছেন, নং ৫৩৬। হাফেয ইবন হাজার এটাকে তার ফতহুল বারীতে উল্লেখ করেছেন এবং ইবন আবী আসেমের ‘কিতাবুদ দো‘আ’ এর দিকে সম্পর্কিত করেছেন। দেখুন ফাতহুল বারী, ১১/১১৮। আরও বলেছেন, বিভিন্ন বর্ণনা থেকে মোট ২৫ (পঁচিশটি) বিষয় পাওয়া গেল।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২. মসজিদে যাওয়ার সময়ে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "ডান পা দিয়ে ঢুকবে এবং বলবে, أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ» [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ] «اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ. (আ‘ঊযু বিল্লা-হিল ‘আযীম, ওয়া বিওয়াজহিহিল কারীম, ওয়াসুলতা-নিহিল ক্বদীম, মিনাশ শাইত্বা-নির রাজীম। [বিসমিল্লা-হি ওয়াসসালাতু] [ওয়াসসালা-মু ‘আলা রাসূলিল্লা-হি], আল্লা-হুম্মাফ্‌তাহ লী আবওয়া-বা রাহ্‌মাতিক)। “আমি মহান আল্লাহ্‌র কাছে তাঁর সম্মানিত চেহারা ও প্রাচীন ক্ষমতার ওসীলায় বিতাড়িত শয়তান থেকে আশ্রয় প্রার্থনা করছি।” [আল্লাহ্‌র নামে (প্রবেশ করছি), সালাত] [ও সালাম আল্লাহ্‌র রাসূলের উপর।“হে আল্লাহ! আপনি আমার জন্য আপনার রহমতের দরজাসমূহ খুলে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "কারণ, আনাস ইবন মালিক রাদিয়াল্লাহু আনহু বলেন, “সুন্নাত হচ্ছে, যখন তুমি মসজিদে প্রবেশ করবে, তখন তোমার ডান পা দিয়ে ঢুকবে, আর যখন বের হবে, তখন বাম পা দিয়ে বের হবে”। হাদীসটি উদ্ধৃত করেছেন, হাকিম ১/২১৮; এবং একে মুসলিমের শর্ত অনুযায়ী সহীহ বলেছেন, আর ইমাম যাহাবী সেটার সমর্থন করেছেন। আরও উদ্ধৃত করেছেন বাইহাকী, ২/৪৪২; আর শাইখ আলবানী তার সিলসিলাতুল আহাদীসিস সহীহা গ্রন্থে এটাকে হাসান বলেছেন, ৫/৬২৪; নং ২৪৭৮। আবূ দাউদ, নং ৪৬৬; আরও দেখুন, সহীহুল জামে‘ ৪৫৯১। ইবনুসসুন্নি কর্তৃক উদ্ধৃত, নং ৮। আর শাইখ আলবানী তার আস-সামারুল মুস্তাতাব গ্রন্থে একে হাসান বলেছেন, পৃ. ৬০৭। আবূ দাউদ ১/১২৬; নং ৪৬৫; আরও দেখুন, সহীহুল জামে‘ ১/৫২৮। মুসলিম ১/৪৯৪, নং ৭১৩; আর সুনান ইবন মাজায় ফাতিমা রাদিয়াল্লাহু আনহার হাদীসে এসেছে, «اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك» “হে আল্লাহ, আমার গুনাহ ক্ষমা করে দিন এবং আমার জন্য আপনার রহমতের দ্বারসমূহ অবারিত করে দিন”। আর শাইখ আলবানী অন্যান্য শাহেদ বা সম অর্থের বর্ণনার কারণে একে সহীহ বলেছেন। দেখুন, সহীহ ইবন মাজাহ্ ১/১২৮-১২৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৩. মসজিদে প্রবেশের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "বাম পা দিয়ে শুরু করবেএবং বলবে, «بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ». (বিস্‌মিল্লা-হি ওয়াস্‌সালা-তু ওয়াস্‌সালা-মু ‘আলা রাসূলিল্লাহ, আল্লা-হুম্মা ইন্নী আসআলুকা মিন ফাদ্বলিকা, আল্লা-হুম্মা আ‘সিমনি মিনাশ শাইত্বানির রাজীম।) “আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহ্‌র রাসুলের উপর শান্তি বর্ষিত হোক। হে আল্লাহ! আপনি আমার গুনাসমূহ মাফ করে দিন এবং আমার জন্য আপনার দয়ার দরজাগুলো খুলে দিন। হে আল্লাহ, আমাকে বিতাড়িত শয়তান থেকে হেফাযত করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আল-হাকিম, ১/২১৮; বাইহাকী, ২/৪৪২, আর শাইখ আলবানী তার সিলসিলাতুস সহীহায় একে হাসান হাদীস বলেছেন, ৫/৬২৪, নং ২৪৭৮। আর সেটার তাখরীজ পূর্বে গত হয়েছে। মসজিদে প্রবেশের দো‘আয় পূর্বে বর্ণিত হাদীসের রেওয়ায়েতসমূহের তাখরীজ দেখুন, (২০ নং) আর “হে আল্লাহ, আমাকে বিতাড়িত শয়তান থেকে হেফাযত করুন” এ বাড়তি অংশের তাখরীজ দেখুন, ইবন মাজাহ্‌ ১/১২৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৪. মসজিদ থেকে বের হওয়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "মুয়াযযিন যা বলে শ্রোতাও তা বলবে, তবে ‘হাইয়্যা ‘আলাস্‌সালাহ’ এবং ‘হাইয়্যা ‘আলাল ফালাহ’ এর সময় বলবে, «لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ» (লা-হাওলা ওয়ালা ক্বুওয়াতা ইল্লা বিল্লা-হ) “আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ১/১৫২, নং ৬১১, ৬১৩; মুসলিম, ১/২৮৮, নং ৩৮৩। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": " وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبَّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالْإِسْلاَمِ دِينَاً (ওয়া আনা আশ্‌হাদু আল্লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু ওয়া আন্না মুহাম্মাদান ‘আবদুহূ ওয়া রাসূলুহু, রাদীতু বিল্লা-হি রব্‌বান, ওয়া বিমুহাম্মাদিন রাসূলান, ওয়া বিলইসলা-মি দ্বীনান)। “আমি সাক্ষ্য দিচ্ছি যে, একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। আমি আরো সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বান্দাহ ও রাসূল। আমি আল্লাহকে রব্ব, মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কে রাসূল এবং ইসলামকে দ্বীন হিসেবে গ্রহণ করে সন্তুষ্ট।” মুয়াযযিন তাশাহহুদ (তথা আশহাদু আন্না মুহাম্মাদার...) উচ্চারণ করার পরই শ্রোতারা এ যিক্‌রটি বলবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/২৯০, নং ৩৮৬। ইবন খুযাইমা, ১/২২০। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "মুয়াযযিনের কথার জবাব দেওয়া শেষ করার পর রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপর দরূদ পড়বে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/২৮৮, নং ৩৮৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "তারপর বলবে, اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامَاً مَحمُوداً الَّذِي وَعَدْتَهُ، [إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ] (আল্লা-হুম্মা রববা হা-যিহিদ্ দা‘ওয়াতিত্ তা-ম্মাতি ওয়াস সালা-তিল ক্বা-’ইমাতি আ-তি মুহাম্মাদানিল ওয়াসীলাতা ওয়াল ফাদীলাতা ওয়াব্‘আছহু মাক্বা-মাম মাহমূদানিল্লাযী ওয়া‘আদতাহ, ইন্নাকা লা তুখলিফুল মী‘আদ)। “হে আল্লাহ! এই পরিপূর্ণ আহ্বান এবং প্রতিষ্ঠিত সালাতের রব্ব! মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কে ওসীলা তথা জান্নাতের একটি স্তর এবং ফযীলত তথা সকল সৃষ্টির উপর অতিরিক্ত মর্যাদা দান করুন। আর তাঁকে মাকামে মাহমূদে (প্রশংসিত স্থানে) পৌঁছে দিন, যার প্রতিশ্রুতি আপনি তাঁকে দিয়েছেন। নিশ্চয় আপনি প্রতিশ্রুতি ভঙ্গ করেন না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২৫২, নং ৬১৪; আর দুই ব্রাকেটের মাঝখানের অংশ উদ্ধৃত করেছেন, বায়হাকী ১/৪১০। আর আল্লামা আবদুল আযীয ইবন বায রাহেমাহুল্লাহ তার ‘তুহফাতুল আখইয়ার’ গ্রন্থে এটার সনদকে হাসান বলেছেন, পৃ. ৩৮। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "“আযান ও ইকামতের মধ্যবর্তী সময়ে নিজের জন্য দো‘আ করবে। কেননা ঐ সময়ের দো‘আ প্রত্যাখ্যান করা হয় না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৩৫৯৪; আবূ দাউদ, নং ৫২৫; আহমাদ, নং ১২২০০; আরও দেখুন, ইরওয়াউল গালীল, ১/২৬২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৫. আযানের যিক্‌রসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْني مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْماءِ وَالْبَرَدِ (আল্লা-হুম্মা বা-‘ইদ বাইনী ওয়া বাইনা খাত্বা-ইয়া-ইয়া কামা বা-‘আদতা বাইনাল মাশরিক্বি ওয়াল মাগরিব। আল্লা-হুম্মা নাক্বক্বিনী মিন খাত্বা-ইয়া-ইয়া কামা ইয়ুনাক্কাস্ ছাওবুল আবইয়াদু মিনাদ দানাসি। আল্লা-হুম্মাগসিলনী মিন খাত্বা-ইয়া-ইয়া বিস্‌সালজি ওয়াল মা-’ই ওয়াল বারাদ)। “হে আল্লাহ! আপনি আমার এবং আমার গুনাহসমূহের মধ্যে এমন দূরত্ব সৃষ্টি করুন যেরূপ দূরত্ব সৃষ্টি করেছেন পূর্ব ও পশ্চিমের মধ্যে। হে আল্লাহ! আপনি আমাকে আমার গুনাহসমূহ থেকে এমন পরিষ্কার করে দিন, যেমন সাদা কাপড় ময়লা থেকে পরিষ্কার করা হয়। হে আল্লাহ! আপনি আমাকে আমার পাপসমূহ থেকে বরফ, পানি ও মেঘের শিলাখণ্ড দ্বারা ধৌত করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/১৮১, নং ৭৪৪; মুসলিম ১/৪১৯, নং ৫৯৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ (সুবহা-নাকাল্লা-হুম্মা ওয়া বিহামদিকা ওয়া তাবা-রাকাসমুকা ওয়া তা‘আ-লা জাদ্দুকা ওয়া লা- ইলা-হা গাইরুকা)। “হে আল্লাহ! আপনার প্রশংসাসহ আপনার পবিত্রতা ও মহিমা ঘোষণা করছি, আপনার নাম বড়ই বরকতময়, আপনার প্রতিপত্তি অতি উচ্চ। আর আপনি ব্যতীত অন্য কোনো হক্ব ইলাহ্‌ নেই।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, নং ৩৯৯; আর সুনান গ্রন্থকার চারজন। আবু দাউদ, নং ৭৭৫; তিরমিযী, নং ২৪৩; ইবন মাজাহ্‌, নং ৮০৬; নাসাঈ, নং ৮৯৯। আরও দেখুন, সহীহুত তিরমিযী, ১/৭৭; সহীহ ইবন মাজাহ্ ১/১৩৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفَاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاَتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ المَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبي جَمِيعَاً إِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ. وَاهْدِنِي لِأَحْسَنِ الأَخْلاقِ لاَ يَهْدِي لِأَحْسَنِها إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالخَيْرُ كُلُّهُ بِيَـــــــدَيْكَ، وَالشَّـــــرُّ لَيْسَ إِلَيْــــــكَ، أَنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ». (ওয়াজ্জাহ্‌তু ওয়াজহিয়া লিল্লাযী ফাত্বারাস্ সামা-ওয়াতি ওয়াল আরদ্বা হানীফাও ওয়ামা আনা মিনাল মুশরিকীন। ইন্না সালা-তী, ওয়া নুসুকী ওয়া মাহইয়া-ইয়া ওয়া মামা-তী লিল্লা-হি রাব্বিল ‘আ-লামীন। লা শারীকা লাহু ওয়াবিযা-লিকা উমিরতু ওয়া আনা মিনাল মুসলিমীন।) আল্লা-হুম্মা আনতাল মালিকু লা ইলা-হা ইল্লা আনতা, আনতা রব্বী ওয়া আনা ‘আবদুকা। যালামতু নাফসী ওয়া‘তারাফতু বিযাম্বী। ফাগফির লী যুনূবী জামী‘আন ইন্নাহু লা- ইয়াগফিরুয্ যুনূবা ইল্লা আনতা। ওয়াহদিনী লিআহসানিল আখলা-ক্বি, লা ইয়াহ্‌দী লিআহ্‌সানিহা ইল্লা আনতা। ওয়াসরিফ ‘আন্নী সায়্যিআহা লা ইয়াসরিফু সায়্যিআহা ইল্লা আনতা। লাববাইকা ওয়া সা‘দাইকা ওয়াল-খাইরু কুল্লুহু বিয়াদাইকা, ওয়াশশাররু লাইসা ইলাইকা। আনা বিকা ওয়া ইলাইকা, তাবা-রাক্তা ওয়া তা‘আ-লাইতা। আসতাগফিরুকা ওয়া আতূবু ইলাইকা)। “যিনি আসমানসমূহ ও যমীন সৃষ্টি করেছেন আমি একনিষ্টভাবে আমার মুখমণ্ডল তাঁর দিকেই ফিরালাম, আর আমি মুশরিকদের অন্তর্ভুক্ত নই। নিশ্চয় আমার সালাত, আমার কুরবানী বা যাবতীয় ইবাদাত, আমার জীবন ও আমার মরণ সৃষ্টিকুলের রব্ব আল্লাহ্‌র জন্য। তাঁর কোনো শরীক নেই। আর আমি এরই আদেশ প্রাপ্ত হয়েছি এবং আমি মুসলিমদের অন্তর্ভুক্ত। “হে আল্লাহ! আপনিই অধিপতি, আপনি ব্যতীত আর কোনো হক্ব ইলাহ নেই। আপনি আমার রব্ব, আমি আপনার বান্দা। আমি আমার নিজের প্রতি অন্যায় করেছি এবং আমি আমার পাপসমূহ স্বীকার করছি। সুতরাং আপনি আমার সমুদয় গুনাহ মাফ করে দিন। নিশ্চয় আপনি ছাড়া আর কেউ গুনাহসমূহ মাফ করতে পারে না। আর আপনি আমাকে সর্বোত্তম চরিত্রের পথে পরিচালিত করুন, আপনি ছাড়া আর কেউ উত্তম চরিত্রের পথে পরিচালিত করতে পারে না। আর আপনি আমার থেকে আমার খারাপ চরিত্রগুলো দূরীভূত করুন, আপনি ব্যতীত আর কেউ সে খারাপ চরিত্রগুলো অপসারিত করতে পারে না। আমি আপনার হুকুম মানার জন্য সদা-সর্বদা হাজির, সকল কল্যাণই আপনার দু’ হাতে নিহিত। অকল্যাণ আপনার দিকে নয় (অর্থাৎ মন্দকে আপনার দিকে সম্পৃক্ত করা উচিৎ নয়, অথবা মন্দ দ্বারা আপনার নিকটবর্তী হওয়া যায় না, বা মন্দ আপনার দিকে উঠে না)। আমি আপনার দ্বারাই (প্রতিষ্ঠিত আছি, সহযোগিতা পেয়ে থাকি) এবং আপনার দিকেই (আমার সকল প্রবণতা, বা আমার প্রত্যাবর্তন)। আপনি বরকতময় এবং আপনি সুঊচ্চ। আমি আপনার নিকট ক্ষমা চাই এবং আপনার কাছে তাওবাহ্‌ করছি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৩৪, নং ৭৭১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ. اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقيمٍ (আল্লা-হুম্মা রববা জিব্রাঈলা ওয়া মীকাঈলা ওয়া ইস্রা-ফীলা ফা-তিরাস্ সামা-ওয়া-তি ওয়াল আরদি ‘আ-লিমাল গাইবি ওয়াশশাহা-দাতি। আনতা তাহকুমু বাইনা ইবা-দিকা ফীমা কা-নূ ফীহি ইয়াখতালিফূন। ইহদিনী লিমাখতুলিফা ফীহি মিনাল হাককি বিইযনিকা ইন্নাকা তাহ্‌দী তাশা-উ ইলা- সিরা-তিম মুস্তাকীম)। “হে আল্লাহ! জিবরাঈল, মীকাঈল ও ইসরাফীলের রব্ব, আসমান ও যমীনের স্রষ্টা, গায়েব ও প্রকাশ্য সব কিছুর জ্ঞানী, আপনার বান্দাগণ যেসব বিষয়ে মতভেদে লিপ্ত আপনিই তার মীমাংসা করে দিবেন। যেসব বিষয়ে মতভেদ হয়েছে তন্মধ্যে আপনি আপনার অনুমতিক্রমে আমাকে যা সত্য সেদিকে পরিচালিত করুন। নিশ্চয় আপনি যাকে ইচ্ছা সরল পথ প্রদর্শন করেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৩৪, নং ৭৭০। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ أَكْبَرُ كَبِيرَاً، اللَّهُ أَكْبَرُ كَبِيراً، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً (তিনবার) «أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ (আল্লা-হু আকবার কাবীরান, আল্লা-হু আকবার কাবীরান, আল্লা-হু আকবার কাবীরান, ওয়ালহামদু লিল্লা-হি কাসীরান, ওয়ালহামদু লিল্লা-হি কাসীরান। ওয়ালহামদু লিল্লা-হি কাসী-রান ওয়াসুবহা-নাল্লাহি বুকরাতাঁও ওয়া আসীলা [তিনবার]। আউযু বিল্লা-হি মিনাশ শায়তানি, মিন নাফখিহী ওয়ানাফসিহী ওয়াহামযিহী) “আল্লাহ সবচেয়ে বড় অতীব বড়, আল্লাহ সবচেয়ে বড় অতীব বড়, আল্লাহ সবচেয়ে বড় অতীব বড়। আর আল্লাহ্‌র জন্যই অনেক ও অজস্র প্রশংসা, আল্লাহ্‌র জন্যই অনেক ও অজস্র প্রশংসা, আল্লাহ্‌র জন্যই অনেক ও অজস্র প্রশংসা। সকালে ও বিকালে আল্লাহ্‌র পবিত্রতা ও মহিমা ঘোষণা করছি” (তিনবার) “আমি শয়তান থেকে আল্লাহ্‌র নিকট আশ্রয় চাই। আশ্রয় চাই তার ফুঁ তথা দম্ভ-অহংকার থেকে, তার থুতু তথা কবিতা থেকে ও তার চাপ তথা পাগলামি থেকে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ১/২০৩, নং ৭৬৪; ইবন মাজাহ্‌ ১/২৬৫, ৮০৭; আহমাদ, আহমাদ ৪/৮৫, নং ১৬৭৩৯। শাইখ শু‘আইব আল-আরনাউত তার মুসনাদের তাহকীকে এ হাদীসের সনদকে হাসান লি-গাইরিহি বলেছেন। আর আব্দুল কাদের আরনাউত ইবন তাইমিয়্যার ‘আল-কালেমুত তাইয়্যেব’ গ্রন্থের নং ৭৮, এর তাহকীক বলেন, এটি তার শাওয়াহেদ বা সমার্থবোধক হাদীসের দ্বারা সহীহ লি-গাইরিহী প্রমাণিত হয়। আর আলবানী তার সহীহুল কালেমিত তাইয়্যেব এর ৬২ নং এ হাদিসটি উল্লেখ করেছেন। তাছাড়া ইমাম মুসলিম ইবন উমর থেকে অনুরূপ হাদীস উদ্ধৃত করেছেন, তবে সেখানে একটি ঘটনা বর্ণিত হয়েছে। ১/৪২০, নং ৬০১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لَكَ الْحَمْدُ، أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، [وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَواتِ وَالأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ] [وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالأَرْضِ] [وَلَكَ الْحَمْدُ] [أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمحَمَّدٌ حَقٌّ، وَالسّاعَةُ حَقٌّ] [اللَّهُمَّ لَكَ أَسْلَمتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خاصَمْتُ، وَإِلَيْكَ حاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ] [أَنْتَ المُقَدِّمُ، وَأَنْتَ المُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ] [أَنْتَ إِلَهِي لاَ إِلَهَ إِلاَّ أَنْتَ] (আল্লা-হুম্মা লাকাল হামদু আনতা নুরুস সামা-ওয়া-তি ওয়াল আরদি ওয়ামান ফীহিন্না ওয়া লাকাল হাম্‌দু। আনতা ক্বায়্যিমুস্ সামা-ওয়া-তি ওয়াল আরদি ওয়ামান ফীহিন্না, [ওয়া লাকাল হামদু আনতা রববুস সামা-ওয়া-তি ওয়াল আরদি ওয়ামান ফীহিন্না], [ওয়া লাকাল হাম্‌দু, লাকা মূলকুস সামা-ওয়া-তি ওয়াল আরদি ওয়ামান ফীহিন্না], [ওয়ালাকাল হাম্‌দু, আনতা মালিকুস সামা-ওয়া-তি ওয়াল আরদি], [ওয়া লাকাল হামদু] [আনতাল হাক্কু, ওয়া ওয়া‘দুকাল হাক্কু, ওয়া ক্বাওলুকাল হাক্কু, ওয়া লিক্বা-উকাল হাক্কু, ওয়াল জান্নাতু হাক্কুন, ওয়ান না-রু হাক্কুন, ওয়ান নাবিয়্যূনা হাক্কুন, ওয়া মুহাম্মাদুন হাক্কুন, ওয়াস্‌সা‘আতু হাক্কুন]। [আল্লা-হুম্মা লাকা আসলামতু, ওয়া আলাইকা তাওয়াক্কালতু ওয়াবিকা আ--মানতু, ওয়া ইলাইকা আনাবতু, ওয়া বিকা খা-সাম্‌তু, ওয়া ইলাইকা হা-কামতু, ফাগফির লী মা কাদ্দামতু, ওয়ামা আখখারতু, ওয়ামা আসরারতু, ওয়ামা আ‘লানতু], [আনতাল মুকাদ্দিমু ওয়া আন্তাল্ মুআখখিরু, লা ইলা-হা ইল্লা আনতা] [আনতা ইলা-হী, লা ইলা-হা ইল্লা আন্তা])। “হে আল্লাহ! আপনার জন্যই সকল হামদ-প্রশংসা[6]; আসমানসমূহ, যমীন ও এ-দুটির মাঝে যা কিছু আছে আপনিই এগুলোর নূর (আলো)। আর আপনার জন্যই সব প্রশংসা; আসমানসমূহ, যমীন ও এ-দুটির মাঝে যা আছে আপনিই এসবের রক্ষণাবেক্ষণকারী-পরিচালক। আর আপনার জন্যই সকল প্রশংসা; আসমানসমূহ, যমীন ও এ-দুটির মাঝে যা কিছু আছে আপনিই এসবের রব্ব। আর আপনার জন্যই সব প্রশংসা; আসমানসমূহ, যমীন ও এ দু’টির মাঝে যা আছে তার সার্বভৌমত্ব আপনারই। আর আপনার জন্যই সকল প্রশংসা; আসমানসমূহ ও যমীনের রাজা আপনিই। আর আপনার জন্যই সকল প্রশংসা; আপনিই হক্ব, আপনার ওয়াদা হক্ব (বাস্তব ও সঠিক), আপনার বাণী হক্ব, আপনার সাক্ষাৎ লাভ হক্ব, জান্নাত হক্ব, জাহান্নাম হক্ব, নবীগণ হক্ব, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হক্ব এবং কিয়ামত হক্ব। হে আল্লাহ! আপনার কাছেই আত্মসমর্পণ করি, আপনার উপরই ভরসা করি, আপনার উপরই ঈমান আনি, আপনার দিকেই প্রত্যাবর্তন করি, আপনার সাহায্যেই বা আপনার জন্যই শত্রুর সাথে বিবাদে লিপ্ত হই, আর আপনার কাছেই বিচার পেশ করি; অতএব ক্ষমা করে দিন আমার গুনাহসমূহ— যা পূর্বে করেছি, যা পরে করেছি, যা আমি গোপন করেছি আর যা প্রকাশ্যে করেছি। আপনিই (কাউকে) করেন অগ্রগামী, আর আপনিই (কাউকে) করেন পশ্চাদগামী, আপনি ব্যতীত আর কোনো হক্ব ইলাহ নেই। আপনিই আমার ইলাহ। আপনি ব্যতীত আর কোনো হক্ব ইলাহ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দো‘আটি রাতে উঠে তাহাজ্জুদের সালাত পড়ার সময় বলতেন। বুখারী, (ফাতহুল বারীসহ) ৩/৩, ১১/১১৬, ১৩/৩৭১, ৪২৩, ৪৬৫, নং ১১২০, ৬৩১৭, ৭৩৮৫, ৭৪৪২, ৭৪৯৯; ও মুসলিম সংক্ষিপ্তাকারে ১/৫৩২, নং ৭৬৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৬. সালাতের শুরুতে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحانَ رَبِّيَ الْعَظِيمِ (সুবহা-না রব্বিয়াল ‘আযীম)। “আমার মহান রব্বের পবিত্রতা ও মহিমা ঘোষণা করছি” (তিনবার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনানের গ্রন্থাকারগণ ও আহমাদ হাদীসটি উদ্ধৃত করেছেন। আবূ দাউদ, নং ৮৭০; তিরমিযী, নং ২৬২; নাসাঈ, নং ১০০৭; ইবন মাজাহ্‌, নং ৮৯৭; আহমাদ, নং ৩৫১৪। আরও দেখুন, সহীহুত তিরমিযী, ১/৮৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي (সুবহা-নাকাল্লা-হুম্মা রব্বানা ওয়াবিহামদিকা, আল্লা-হুম্মাগফির লী)। “হে আল্লাহ! আমাদের রব্ব! আপনার পবিত্রতা ও মহিমা ঘোষণা করছি আপনার প্রশংসাসহ। হে আল্লাহ! আপনি আমাকে মাফ করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/৯৯, নং ৭৯৪; মুসলিম ১/৩৫০, নং ৪৮৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلاَئِكَةِ وَالرُّوحِ (“সুব্বূহুন কুদ্দূসুন রব্বুল মালা-’ইকাতি ওয়াররূহ)। “(তিনি/আপনি) সম্পূর্ণরূপে দোষ-ত্রুটিমুক্ত, অত্যন্ত পবিত্র ও মহিমান্বিত; ফেরেশতাগণ ও রূহ এর রব্ব।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৩৫৩, নং ৪৭৪; আবূ দাউদ ১/২৩০, নং ৮৭২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي، وَمُخِّي، وَعَــــظْمِي، وَعَصَبِي، [وَمَا استَقَلَّتْ بِهِ قَدَمِي] (আল্লা-হুম্মা লাকা রাকা‘তু, ওয়াবিকা আ-মানতু ওয়া লাকা আস্‌লামতু। খাশা‘আ লাকা সাম‘ঈ ওয়া বাসারী ওয়া মুখ্‌খী ওয়া ‘আযমী ওয়া ‘আসাবী [ওয়ামাস্তাক্বাল্লাত বিহি কাদামী])। “হে আল্লাহ! আমি আপনার জন্যেই রুকু করেছি, আপনার উপরই ঈমান এনেছি এবং আপনার কাছেই আত্মসমর্পণ করেছি। আমার কান, আমার চোখ, আমার মস্তিষ্ক, আমার হাড়, আমার পেশী, সবই আপনার জন্য বিনয়াবনত। [আর যা আমার পা বহন করে দাঁড়িয়ে আছে (আমার সমগ্র সত্তা) তাও (আপনার জন্য বিনয়াবনত)]”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৩৪, নং ৭৭১; তাছাড়া চার সুনান গ্রন্থকারগণের মধ্যে ইবন মাজাহ ব্যতীত সবাই তা উদ্ধৃত করেছেন। আবূ দাউদ, নং ৭৬০, ৭৬১; তিরমিযী, নং ৩৪২১; নাসাঈ, নং ১০৪৯; তবে দুই ব্রাকেটের অংশ ইবন খুযাইমার শব্দ, নং ৬০৭; ইবন হিব্বান, নং ১৯০১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ (সুবহা-নাযিল জাবারূতি ওয়াল মালাকূতি ওয়াল কিবরিয়া’ই ওয়াল ‘আযামাতি)। “পবিত্রতা ও মহিমা ঘোষণা করছি সেই সত্তার, যিনি প্রবল প্রতাপ, বিশাল সাম্রাজ্য, বিরাট গৌরব-গরিমা এবং অতুলনীয় মহত্ত্বের অধিকারী”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ১/২৩০, নং ৮৭৩; নাসাঈ, নং ১১৩১; আহমাদ, নং ১৩৯৮০। আর তার সনদ হাসান।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৭. রুকূ‘র দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ (সামি‘আল্লা-হু লিমান হামিদাহ)। “যে আল্লাহর হামদ-প্রশংসা করে, আল্লাহ তার প্রশংসা শুনুন (কবুল করুন)।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ২/২৮২, নং ৭৯৬।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْداً كَثيراً طَيِّباً مُبارَكاً فِيهِ (রব্বানা ওয়া লাকাল হামদু, হামদান কাছীরান ত্বায়্যিবান মুবা-রাকান ফীহি) “হে আমাদের রব্ব! আর আপনার জন্যই সমস্ত প্রশংসা; অঢেল, পবিত্র ও বরকত-রয়েছে-এমন প্রশংসা।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ২/২৮৪, নং ৭৯৬। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيءٍ بَعْدُ. أَهلَ الثَّناءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ». (মিল’আস সামা-ওয়া-তি ওয়া মিল’আল আরদি ওয়ামা বাইনাহুমা, ও মিল’আ মা শি’তা মিন শাইয়িন বা‘দু, আহলাস সানা-য়ি ওয়াল মাজদি, আহাক্কু মা ক্বালাল ‘আবদু, ওয়া কুল্লুনা লাকা ‘আবদুন, আল্লা-হুম্মা লা মানি‘আ লিমা আ‘ত্বাইতা, ওয়ালা মু‘তিয়া লিমা মানা‘তা, ওয়ালা ইয়ানফা‘য়ু যাল-জাদ্দি মিনকাল জাদ্দু)। “(আপনার প্রশংসা করছি) আসমানসমূহ পূর্ণ করে, যমীন পূর্ণ করে ও যা এ দু’টির মাঝে রয়েছে (তাও পূর্ণ করে), আর এর পরে যা পূর্ণ করা আপনার ইচ্ছা তা পূর্ণ করে। হে প্রশংসা ও সম্মান-মর্যাদার যোগ্য সত্ত্বা! বান্দা সবচেয়ে যে সঠিক কথাটি বলেছে তা হচ্ছে—আর আমরা সবাই আপনার বান্দা— হে আল্লাহ, আপনি যা প্রদান করেছেন তা বন্ধ করার কেউ নেই, আর আপনি যা রুদ্ধ করেছেন তা প্রদান করার কেউ নেই। আর কোনো ক্ষমতা-প্রতিপত্তির অধিকারীর ক্ষমতা ও প্রতিপত্তি আপনার কাছে কোনো কাজে লাগবে না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ১/৩৪৬; নং ৪৭৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৮. রুকু থেকে উঠার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ رَبِّيَ الأَعْلَى (সুবহা-না রব্বিয়াল আ‘লা) “আমার রব্বের পবিত্রতা ও মহিমা বর্ণনা করছি, যিনি সবার উপরে।” (তিনবার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সুনানগ্রন্থকারগণ ও ইমাম আহমাদ সংকলন করেছেন। আবূ দাউদ, হাদীস নং ৮৭০; তিরমিযী, হাদীস নং ২৬২; নাসাঈ, হাদীস নং ১০০৭; ইবন মাজাহ, হাদীস নং ৮৯৭; আহমাদ, হাদীস নং ৩৫১৪। আরও দেখুন, সহীহুত তিরমিযী, ১/৮৩। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي. (সুবহা-নাকাল্লা-হুম্মা রব্বানা ওয়া বিহামদিকা আল্লা-হুম্মাগফির লী)। “হে আল্লাহ! আমাদের রব্ব! আপনার প্রশংসাসহ আপনার পবিত্রতা ও মহিমা ঘোষণা করছি। হে আল্লাহ! আপনি আমাকে মাফ করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, নং ৭৯৪; মুসলিম, নং ৪৮৪; পূর্বে ৩৪ নং তা গত হয়েছে।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبوحٌ، قُدُّوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ (সুব্বূহুন কুদ্দূসুন রব্বুল মালা-ইকাতি ওয়াররূহ)। “(তিনি/আপনি) সম্পূর্ণরূপে দোষ-ত্রুটিমুক্ত, অত্যন্ত পবিত্র ও মহিমান্বিত; ফেরেশতাগণ ও রূহ এর রব্ব।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৩৫৩, নং ৪৮৭; আবূ দাউদ, নং ৮৭২। পূর্বে ৩৫ নং এ গত হয়েছে। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسنُ الْخَالِقينَ (আল্লা-হুম্মা লাকা সাজাদতু ওয়াবিকা আ-মানতু ওয়া লাকা আসলামতু। সাজাদা ওয়াজহিয়া লিল্লাযী খালাক্বাহু ওয়া সাওয়্যারাহু ওয়া শাক্কা সাম‘আহু ওয়া বাসারাহু, তাবারাকাল্লাহু আহ্‌সানুল খালিক্বীন)। “হে আল্লাহ! আমি আপনার জন্যই সিজদা করেছি, আপনার উপরই ঈমান এনেছি, আপনার কাছেই নিজেকে সঁপে দিয়েছি। আমার মুখমণ্ডল সিজদায় অবনত সেই মহান সত্তার জন্য; যিনি একে সৃষ্টি করেছেন এবং আকৃতি দিয়েছেন, আর তার কান ও চোখ বিদীর্ণ করেছেন। সর্বোত্তম স্রষ্টা আল্লাহ্‌ অত্যন্ত বরকতময়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৩৪, নং ৭৭১ ও অন্যান্যগণ।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ (সুবহা-নাযিল জাবারূতি, ওয়াল মালাকুতি, ওয়াল কিবরিয়া-ই ওয়াল ‘আযামাতি)। “পবিত্রতা ও মহিমা ঘোষণা করছি সেই সত্তার, যিনি প্রবল প্রতাপ, বিশাল সাম্রাজ্য, বিরাট গৌরব-গরিমা এবং অতুলনীয় মহত্ত্বের অধিকারী।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবু দাঊদ ১/২৩০, নং ৮৭৩; নাসাঈ, নং ১১৩১; আহমাদ, নং ২৩৯৮০। আর শাইখ আলবানী একে সহীহ আবু দাউদে ১/১৬৬ সহীহ বলেছেন। যার তাখরীজ ৩৭ নং এ চলে গেছে।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ: دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَّتَهُ وَسِرَّهُ (আল্লা-হুম্মাগফির লী যাম্বী কুল্লাহু; দিক্কাহু ওয়া জিল্লাহু, ওয়া আউয়ালাহু ওয়া ‘আখিরাহু, ওয়া ‘আলানিয়্যাতাহু ওয়া সিররাহু)। “হে আল্লাহ! আমার সমস্ত গুনাহ মাফ করে দিন— তার ক্ষুদ্র অংশ, তার বড় অংশ, আগের গুনাহ, পরের গুনাহ, প্রকাশ্য ও গোপন গুনাহ।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/২৩০, নং ৪৮৩। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ (আল্লা-হুম্মা ইন্নী আঊযুবিরিদ্বা-কা মিন সাখাত্বিকা, ওয়া বিমু‘আ-ফা-তিকা মিন ‘উক্বুবাতিকা, ওয়া আঊযু বিকা মিনকা, লা উহ্‌সী সানা-আন আলাইকা, আনতা কামা আসনাইতা ‘আলা নাফসিকা)। “হে আল্লাহ! আমি আপনার সন্তুষ্টির মাধ্যমে অসন্তুষ্টি থেকে, আর আপনার নিরাপত্তার মাধ্যমে আপনার শাস্তি থেকে আশ্রয় চাই। আর আমি আপনার নিকটে আপনার (পাকড়াও) থেকে আশ্রয় চাই। আমি আপনার প্রশংসা গুনতে সক্ষম নই; আপনি সেরূপই, যেরূপ প্রশংসা আপনি নিজের জন্য করেছেন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৩৫২, নং ৪৮৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১৯. সিজদার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي (রব্বিগফির লী, রব্বিগফির লী) হে আমার রব্ব! আপনি আমাকে ক্ষমা করুন। হে আমার রব্ব! আপনি আমাকে ক্ষমা করুন।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ১/২৩১, নং ৮৭৪; ইবন মাজাহ্‌ নং ৮৯৭। আরও দেখুন, সহীহ ইবন মাজাহ, ১/১৪৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي (আল্লা-হুম্মাগফির লী, ওয়ারহামনী, ওয়াহদিনী, ওয়াজবুরনী, ওয়া‘আফিনি, ওয়ারযুক্বনী, ওয়ারফা‘নী) “হে আল্লাহ! আপনি আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথে পরিচালিত করুন, আমার সমস্ত ক্ষয়ক্ষতি পূরণ করে দিন, আমাকে নিরাপত্তা দান করুন, আমাকে রিযিক দান করুন এবং আমার মর্যাদা বৃদ্ধি করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত সুনান গ্রন্থগারগণ সবাই সংকলন করেছেন। আবূ দাউদ, ১/২৩১, নং ৮৫০; তিরমিযী, নং ২৮৪, ২৮৫; ইবন মাজাহ, নং ৮৯৮। আরও দেখুন, সহীহুত তিরমিযী, ১/৯০; সহীহ ইবন মাজাহ ১/১৪৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২০. দুই সিজদার মধ্যবর্তী বৈঠকের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ، ﴿فَتَبارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ (সাজাদা ওয়াজহিয়া লিল্লাযী খালাক্বাহু, ওয়া শাক্কা সাম্‘আহু ওয়া বাসারাহু, বিহাওলিহি ওয়া কুওয়াতিহি, ফাতবারাকাল্লা-হু আহ্‌সানুল খা-লিক্বীন)। “আমার মুখমণ্ডল সিজদা করেছে সে সত্তার জন্য, যিনি একে সৃষ্টি করেছেন, আর নিজ শক্তি ও ক্ষমতাবলে এর কান ও চোখ বিদীর্ণ করেছেন। সুতরাং সর্বোত্তম স্রষ্টা আল্লাহ্‌ অত্যন্ত বরকতময়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, ২/৪৭৪, নং ৩৪২৫; আহমাদ ৬/৩০; নং ২৪০২২; হাকিম ও সহীহ বলেছেন এবং যাহাবী সেটা সমর্থন করেছেন, ১/২২০; আর বাড়তি অংশটুকু তাঁরই। আয়াতটুকু সূরা আল-মুমিনূন এর ১৪ নং আয়াত।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ (আল্লা-হুম্মাক্তুব লী বিহা ‘ইনদাকা আজরান, ওয়াদা‘ ‘আন্নী বিহা উইযরান, ওয়াজ ‘আলহা লী ‘ইনদাকা যুখরান, ওয়া তাক্বাব্বালহা মিন্নী কামা তাক্বাব্বালতাহা মিন আবদিকা দাঊদ)। “হে আল্লাহ! এই সিজদার বদৌলতে আপনার নিকট আমার জন্য প্রতিদান লিখে রাখুন, এর দ্বারা আমার পাপসমূহ ফেলে দিন, এটাকে আপনার কাছে আমার জন্য সঞ্চয় হিসেবে জমা রাখুন, আর একে আমার থেকে কবুল করুন যেমন কবুল করেছেন আপনার বান্দা দাউদ (আলাইহিস সালাম) এর থেকে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ২/৪৭৩, নং ৫৭৯; হাকেম ও সহীহ বলেছেন, আর ইমাম যাহাবী সমর্থন করেছেন, ১/২১৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২১. সিজদার আয়াত তেলাওয়াতের পর সিজদায় দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَواتُ، وَالطَّيِّباتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ. أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسولُهُ (আত্তাহিয়্যা-তু লিল্লা-হি ওয়াস্‌সালাওয়া-তু ওয়াত্তায়্যিবা-তু আস্‌সালা-মু ‘আলাইকা আইয়্যূহান নাবিয়্যূ ওয়া রাহমাতুল্লা-হি ওয়া বারাকা-তুহু। আস্‌সালা-মু ‘আলাইনা ওয়া ‘আলা ‘ইবাদিল্লা-হিস সা-লেহীন। আশহাদু আল্লা-ইলা-হা ইল্লাল্লা-হু ওয়া আশহাদু আন্না মুহাম্মাদান ‘আব্দুহু ওয়া রাসূলুহু)। “যাবতীয় অভিবাদন আল্লাহ্‌র জন্য, অনুরূপভাবে সকল সালাত ও পবিত্র কাজও। হে নবী! আপনার উপর বর্ষিত হোক সালাম, আল্লাহর রহমত ও বরকতসমূহ। আমাদের উপর এবং আল্লাহ্‌র সৎ বান্দাদের উপরও বর্ষিত হোক সালাম। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই এবং আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আল্লাহ্‌র বান্দা ও রাসূল”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ১১/১৩, নং ৮৩১; মুসলিম ১/৩০১, নং ৪০২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২২. তাশাহ্‌হুদ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ (আল্লা-হুম্মা সাল্লি ‘আলা মুহাম্মাদিউওয়া ‘আলা আ-লি মুহাম্মাদিন কামা সাল্লাইতা ‘আলা ইবরাহীমা ওয়া ‘আলা আ-লি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ। আল্লা-হুম্মা বারিক ‘আলা মুহাম্মাদিউওয়া ‘আলা আলি মুহাম্মাদিন, কামা বা-রাকতা ‘আলা ইব্রাহীমা ওয়া ‘আলা আ-লি ইব্রাহীমা ইন্নাকা হামীদুম্ মাজীদ)। “হে আল্লাহ! আপনি (আপনার নিকটস্থ উচ্চসভায়) মুহাম্মাদকে সম্মানের সাথে স্মরণ করুন এবং তাঁর পরিবার-পরিজনকে, যেমন আপনি সম্মানের সাথে স্মরণ করেছেন ইবরাহীমকে ও তাঁর পরিবার-পরিজনদেরকে। নিশ্চয় আপনি অত্যন্ত প্রশংসিত ও মহামহিমান্বিত। হে আল্লাহ! আপনি মুহাম্মাদ ও তাঁর পরিবার পরিজনের উপর বরকত নাযিল করুন যেমন আপনি বরকত নাযিল করেছিলেন ইবরাহীম ও তাঁর পরিবার-পরিজনের উপর। নিশ্চয় আপনি অত্যন্ত প্রশংসিত ও মহামহিমান্বিত”।[",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/৪০৮, নং ৩৩৭০; মুসলিম, নং ৪০৬।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْواجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ. إِنَّكَ حَمِيدٌ مَجِيدٌ (আল্লা-হুম্মা সাল্লি ‘আলা মুহাম্মাদিউওয়া ‘আলা আযওয়াজিহি ওয়া যুররিয়্যাতিহি কামা সাল্লাইতা ‘আলা আলি ইবরাহীমা, ওয়া বারিক ‘আলা মুহাম্মাদিউওয়া ‘আলা আযওয়াজিহি ওয়া যুররিয়্যাতিহি কামা বা-রাক্তা ‘আলা আ-লি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ)। “হে আল্লাহ! আপনি (আপনার নিকটস্থ উচ্চসভায়) মুহাম্মাদকে সম্মানের সাথে স্মরণ করুন এবং তাঁর স্ত্রীগণ ও তাঁর বংশধরকেও, যেমন আপনি সম্মানের সাথে স্মরণ করেছেন ইবরাহীমের পরিবার-পরিজনকে। আর আপনি মুহাম্মাদ এবং তাঁর স্ত্রীগণ ও তাঁর বংশধরের উপর বরকত নাযিল করুন যেমন আপনি বরকত নাযিল করেছিলেন ইবরাহীমের পরিবার- পরিজনের উপর। নিশ্চয় আপনি অত্যন্ত প্রশংসিত ও মহামহিমান্বিত”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/৪০৭, নং ৩৩৬৯; মুসলিম ১/৩০৬, নং ৪০৭। আর শব্দটি মুসলিমের।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৩. তাশাহ্‌হুদের পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপর সালাত (দরুদ) পাঠ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُــمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ (আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা মিন ‘আযা-বিল ক্বাবরি ওয়া মিন ‘আযা-বি জাহান্নামা, ওয়া মিন ফিতনাতিল মাহ্ইয়া ওয়াল মামা-তি, ওয়া মিন শাররি ফিতনাতিল মাসীহিদ দাজ্জা-ল)। “হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাচ্ছি কবরের আযাব থেকে, জাহান্নামের আযাব থেকে, জীবন-মৃত্যুর ফিতনা থেকে এবং মাসীহ দাজ্জালের ফিতনার অনিষ্টতা থেকে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ২/১০২, নং ১৩৭৭; মুসলিম ১/৪১২, নং ৫৮৮। আর শব্দ মুসলিমের। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ (আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিন আযা-বিল ক্বাবরি, ওয়া আ‘উযু বিকা মিন ফিতনাতিল মাসীহিদ্ দাজ্জা-লি, ওয়া আ‘উযু বিকা মিন ফিতনাতিল মাহইয়া ওয়াল মামা-ত। আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিনাল মা’ছামি ওয়াল মাগরামি)। “হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই কবরের আযাব থেকে, আশ্রয় চাই মাসীহ দাজ্জালের ফিতনা থেকে এবং আশ্রয় চাই জীবন-মৃত্যুর ফিতনা থেকে। হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই পাপাচার ও ঋণের বোঝা থেকে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২০২, নং ৮৩২; মুসলিম ১/৪১২, নং ৫৮৭।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفورُ الرَّحيمُ (আল্লা-হুম্মা ইন্নী যলামতু নাফসী যুলমান কাসীরা। ওয়ালা ইয়াগফিরুয্ যুনূবা ইল্লা আনতা। ফাগফির লী মাগফিরাতাম মিন ‘ইনদিকা ওয়ারহামনী ইন্নাকা আনতাল গাফূরুর রাহীম)। “হে আল্লাহ! আমি আমার নিজের উপর অনেক যুলুম করেছি। আর আপনি ছাড়া গুনাহসমূহ কেউই ক্ষমা করতে পারে না। অতএব আমাকে আপনার পক্ষ থেকে বিশেষ ক্ষমা দ্বারা মাফ করে দিন, আর আমার প্রতি দয়া করুন; আপনিই তো ক্ষমাকারী, পরম দয়ালু”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৮/১৬৮, নং ৮৩৪; মুসলিম ৪/২০৭৮, নং ২৭০৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ». (আল্লা-হুম্মাগফিরলী মা ক্বাদ্দামতু ওয়া মা আখ্‌খারতু ওয়া মা আসরারতু ওয়া মা আ’লান্তু ওয়া মা আসরাফ্‌তু ওয়া মা আনতা আল’লামু বিহী মিন্নী। আনতাল মুকাদ্দিমু ওয়া আনতাল মুআখখিরু লা ইলাহা ইল্লা আনতা)। “হে আল্লাহ! ক্ষমা করে দিন আমার গুনাহসমূহ— যা পূর্বে করেছি, যা পরে করেছি, যা আমি গোপন করেছি, যা প্রকাশ্যে করেছি, যা সীমালঙ্ঘন করে করেছি, আর যা আপনি আমার চেয়ে বেশি জানেন। আপনিই (কাউকে) করেন অগ্রগামী, আর আপনিই (কাউকে) করেন পশ্চাদগামী, আপনি ব্যতীত আর কোনো হক্ব ইলাহ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৫৩৪, নং ৭৭১। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبادَتِكَ. (আল্লা-হুম্মা আ‘ইন্নী ‘আলা যিকরিকা ও শুকরিকা ওয়াহুসনি ইবা-দাতিকা)। “হে আল্লাহ! আপনার যিক্‌র করতে, আপনার শুকরিয়া জ্ঞাপন করতে এবং সুন্দরভাবে আপনার ইবাদত করতে আমাকে সাহায্য করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/৮৬, নং ১৫২২; নাসাঈ ৩/৫৩, নং ২৩০২। আর শাইখ আলবানী সহীহ আবি দাঊদ ১/২৮৪ এটাকে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ (আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিনাল বুখলি, ওয়া ‘আউযু বিকা মিনাল জুবনি, ওয়া আ‘উযু বিকা মিন আন উরাদ্দা ইলা আরযালিল্ ‘উমুরি, ওয়া আ‘ঊযু বিকা মিন্ ফিতনাতিদ দুনইয়া ও আযা-বিল ক্বাবরি)। হে আল্লাহ ! আমি আপনার আশ্রয় চাই কৃপণতা থেকে, আপনার আশ্রয় চাই কাপুরুষতা থেকে, আপনার আশ্রয় চাই চরম বার্ধক্যে উপনীত হওয়া থেকে, আর আপনার আশ্রয় চাই দুনিয়ার ফিতনা ও কবরের আযাব থেকে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারি, (ফাতহুল বারীসহ) ৬/৩৫, নং ২৮২২ ও নং ৬৩৯০। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ (আল্লা-হুম্মা ইন্নী আসআলুকাল জান্নাতা ওয়া আ‘উযু বিকা মিনান্নার)। “হে আল্লাহ! আমি আপনার কাছে জান্নাত চাই এবং জাহান্নাম থেকে আপনার কাছে আশ্রয় চাই”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, নং ৭৯২; ইবন মাজাহ্‌ নং ৯১০। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৩২৮। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْــــأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِي غَيرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ (আল্লা-হুম্মা বি‘ইলমিকাল গাইবি ওয়া কুদরাতিকা ‘আলাল খালক্বি আহয়িনী মা আলিম্‌তাল হায়া-তা খাইরাল্ লী ওয়া তাওয়াফ্‌ফানী ইযা আলিম্‌তাল ওয়াফা-তা খাইরাল লী। আল্লা-হুম্মা ইন্নী আসআলুকা খাশইয়াতাকা ফিল গাইবি ওয়াশ-শাহাদাতি ওয়া আসআলুকা কালিমাতাল হাক্বক্বি ফির-রিদা ওয়াল-গাদাবি। ওয়া আসআলুকাল কাসদা ফিল গিনা ওয়াল ফাক্বরি, ওয়া আসআলুকা না‘ঈমান লা ইয়ানফাদু, ওয়া আসআলুকা ক্বুররতা আইনিন লা তানকাতি‘উ, ওয়া আস্আলুকার-রিদা বা‘দাল কাদায়ে, ওয়া আসআলুকা বারদাল ‘আইশি বা‘দাল মাওতি, ওয়া আসআলুকা লাযযাতান-নাযারি ইলা ওয়াজহিকা, ওয়াশ-শাওক্বা ইলা লিক্বাইকা, ফী গাইরি দাররাআ মুদিররাতিন ওয়ালা ফিতনাতিম মুদিল্লাহ। আল্লা-হুম্মা যাইইন্না বিযীনাতিল ঈমানি ওয়াজ‘আলনা হুদাতাম মুহতাদ্বীন)। “হে আল্লাহ! আপনার গায়েবী জ্ঞান এবং সকল সৃষ্টির উপর আপনার সার্বভৌম ক্ষমতার অসিলায় (চাই), আমাকে আপনি জীবিত রাখুন সে-সময় পর্যন্ত, যে সময় পর্যন্ত জীবিত থাকা আপনার জ্ঞানে আমার জন্য কল্যাণকর; আর আমাকে মৃত্যু দিন যখন আপনি জানেন যে, মৃত্যু আমার জন্য কল্যাণকর। হে আল্লাহ! আমি আপনার নিকট চাই গোপনে ও প্রকাশ্যে আপনাকে ভয় করা; আপনার নিকট চাই সন্তুষ্টি ও ক্রোধ উভয় অবস্থায় সত্য কথা বলা; আপনার নিকট চাই দারিদ্র্যে ও প্রাচুর্যে ভারসাম্যপূর্ণ (মধ্যম) পন্থা। আপনার নিকট চাই এমন নে‘আমত, যা কখনো শেষ হবে না; আপনার নিকট চাই এমন নয়নাভিরাম বস্তু, যা কখনো বিচ্ছিন্ন হবে না। আর আমি আপনার নিকট চাই (তাকদীরের) ফয়সালার পর সন্তোষ; আমি আপনার নিকট চাই মৃত্যুর পর প্রশান্ত জীবন। আমি আপনার নিকট চাই আপনার চেহারার প্রতি দৃষ্টিপাতের স্বাদ, আপনার নিকট চাই আপনার সাথে সাক্ষাৎ লাভের ব্যাকুলতা; এমন যে, তাতে থাকবে না কোনো ক্ষতিকর কষ্ট কিংবা ভ্রষ্টকারী ফেতনা। হে আল্লাহ! আপনি আমাদেরকে ঈমানের সৌন্দর্যে সৌন্দর্যমণ্ডিত করুন এবং আমাদেরকে হেদায়াত-প্রাপ্ত পথপ্রদর্শক বানান”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ ৩/৫৪, ৫৫, নং ১৩০৪; আহমাদ ৪/৩৬৪, নং ২১৬৬৬। আর শাইখ আলবানী সহীহুন নাসাঈ ১/২৮১ তে একে সহীহ বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يولَدْ، وَلَمْ يَكنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِّيمُ (আল্লা-হুম্মা ইন্নী আসআলুকা ইয়া আল্লা-হু বিআন্নাকাল ওয়া-হিদুল আহাদুস্ সমাদুল্লাযী লাম ইয়ালিদ ওয়ালাম ইয়ূলাদ ওয়ালাম ইয়াকুল্লাহু কুফূওয়ান আহাদ, আন্ তাগফিরালী যুনূবী, ইন্নাকা আনতাল গাফূরুর রহীম)। “হে আল্লাহ! আপনিই একক, অদ্বিতীয়, অমুখাপেক্ষী; যিনি জন্ম দেন নি, জন্ম নেনও নি; আর যার সমকক্ষ কেউ নেই। তাই হে আল্লাহ! আমি আপনার কাছে চাই, যেন আপনি আমার সকল গুনাহ্‌ ক্ষমা করে দেন; নিশ্চয় আপনি অতীব ক্ষমাশীল, পরম দয়ালু”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ ৩/৫২, নং ১৩০০; শব্দ তাঁরই, আহমাদ ৪/৩৩৮, নং ১৮৯৭। আর আলবানী সহীহুন নাসাঈ ১/২৮০ তে একে সহীহ বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلاَلِ وَالْإِكرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ (আল্লা-হুম্মা ইন্নী আসআলুকা বিআন্না লাকাল হামদু লা ইলা-হা ইল্লা আনতা ওয়াহদাকা লা শারীকা লাকাল মান্না-নু, ইয়া বাদী‘আস্ সামা-ওয়া-তি ওয়াল-আরদী, ইয়া যালজালা-লি ওয়াল-ইকরা-ম। ইয়া হাইয়্যু ইয়া কাইয়্যূমু, ইন্নী আসআলুকাল্ জান্নাতা ওয়া আ‘ঊযু বিকা মিনান্না-র)। ) “হে আল্লাহ! আমি আপনার কাছে চাই; কারণ, সকল প্রশংসা আপনার, কেবলমাত্র আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই, আপনার কোনো শরীক নেই, সীমাহীন অনুগ্রহকারী; হে আসমানসমূহ ও যমীনের অভিনব স্রষ্টা! হে মহিমাময় ও মহানুভব! হে চিরঞ্জীব, হে চিরস্থায়ী-সর্বসত্তার ধারক! আমি আপনার কাছে জান্নাত চাই এবং জাহান্নাম থেকে আশ্রয় চাই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সুনানগ্রন্থকারগণ সকলে সংকলন করেছেন। আবূ দাউদ, নং ১৪৯৫; তিরমিযী, নং ৩৫৪৪; ইবন মাজাহ, নং ৩৮৫৮; নাসাঈ, নং ১২৯৯। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৩২৯।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ (আল্লা-হুম্মা ইন্নী আসআলুকা বিআন্নী আশ্‌হাদু আন্নাকা আনতাল্লা-হু লা ইলা-হা ইল্লা আনতাল আহাদুস সামাদুল্লাযী লাম ইয়ালিদ ওয়া লাম ইয়ূলাদ ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ)। “হে আল্লাহ! আমি আপনার কাছে চাই। কেননা, আমি সাক্ষ্য দেই যে, নিশ্চয় আপনিই আল্লাহ, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই; আপনি একক সত্তা, অমুখাপেক্ষী—সকল কিছু আপনার মুখাপেক্ষী, যিনি কাউকে জন্ম দেন নি এবং জন্ম নেনও নি। আর যাঁর সমকক্ষ কেউ নেই”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/৬২, নং ১৪৯৩; তিরমিযী ৫/৫১৫, নং ৩৪৭৫; ইবন মাজাহ, ২/১২৬৭, নং ৩৮৫৭; নাসাঈ, নং ১৩০০, আর শব্দ তাঁরই; আহমাদ নং ১৮৯৭৪। আর শাইখ আলবানী সহীহ নাসাঈ ১/২৮০ তে একে সহীহ বলেছেন। তাছাড়া আরও দেখুন, সহীহ ইবন মাজাহ ২/৩২৯; সহীহ আত-তিরমিযী, ৩/১৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৪. সালামের আগে শেষ তাশাহহুদের পরের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَسْتَغْفِرُ اللَّهَ (তিনবার) (আস্তাগফিরুল্লা-হ) (তিনবার) “আমি আল্লাহ্‌র নিকট ক্ষমা প্রার্থনা করছি।” اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ (আল্লা-হুম্মা আনতাস্ সালা-মু ওয়া মিনকাস্ সালা-মু তাবা-রক্তা ইয়া যালজালা-লি ওয়াল-ইকরা-ম)। “হে আল্লাহ! আপনি শান্তিময়। আপনার নিকট থেকেই শান্তি বর্ষিত হয়। আপনি বরকতময়, হে মহিমাময় ও সম্মানের অধিকারী!”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৪১৪, নং ৫৯১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ [তিনবার]، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ». (লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, লাহুল মূলকু ওয়া লাহুল হামদু, ওয়া হুয়া আলা কুল্লি শাই’ইন ক্বাদীর। [তিন বার] আল্লা-হুম্মা লা মানি‘আ লিমা আ‘তাইতা, ওয়ালা মু‘তিয়া লিমা মানা‘তা, ওয়ালা ইয়ানফা‘উ যালজাদ্দি মিনকাল জাদ্দু)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান।” (তিনবার) হে আল্লাহ, আপনি যা প্রদান করেছেন তা বন্ধ করার কেউ নেই, আর আপনি যা রুদ্ধ করেছেন তা প্রদান করার কেউ নেই। আর কোনো ক্ষমতা-প্রতিপত্তির অধিকারীর ক্ষমতা ও প্রতিপত্তি আপনার কাছে কোনো উপকারে আসবে না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ১/২২৫, নং ৮৪৪; মুসলিম ১/৪১৪, নং ৫৯৩। আর দু ব্রাকেটের মাঝের অংশ বুখারীতে বর্ধিত এসেছে, নং ৬৪৭৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ, لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্দাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর। লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহি। লা ইলাহা ইল্লাল্লাহু, ওয়ালা না‘বুদু ইল্লা ইয়্যাহু। লাহুন নি‘মাতু ওয়া লাহুল ফাদলু, ওয়া লাহুসসানাউল হাসান। লা ইলাহা ইল্লাল্লাহু মুখলিসীনা লাহুদ-দ্বীন ওয়া লাও কারিহাল কাফিরূন)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান। আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি নেই। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, আমরা কেবল তাঁরই ইবাদত করি, নেয়ামতসমূহ তাঁরই, যাবতীয় অনুগ্রহও তাঁর এবং উত্তম প্রশংসা তাঁরই। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, আমরা তাঁর দেয়া দ্বীনকে একনিষ্ঠভাবে মান্য করি, যদিও কাফেররা তা অপছন্দ করে”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/৪১৫, নং ৫৯৪। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ (৩৩ বার) لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (সুবহা-নাল্লাহ, আলহামদুলিল্লাহ, আল্লা-হু আকবার) (৩৩বার) (লা ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন কাদীর)। “আল্লাহ কতই না পবিত্র-মহান। সকল প্রশংসা আল্লাহ্‌র জন্য। আল্লাহ সবচেয়ে বড়।” (৩৩ বার) “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সকল প্রশংসা তাঁরই এবং তিনি সবকিছুর উপর ক্ষমতাবান।” প্রত্যেক সালাতের পর একবার, সূরা ইখলাস, সূরা আল-ফালাক ও সূরা আন-নাস:",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ১/৪১৮, নং ৫৯৭; আর তাতে রয়েছে, যে ব্যক্তি প্রতি নামাযের পরে সেটা বলবে, তার পাপরাশি ক্ষমা করে দেওয়া হয়, যদিও তা সমুদ্রের ফেনারাশির মত হয়।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ هُوَ اللّٰهُ اَحَدٌ ۝ۚ اَللّٰهُ الصَّمَدُ لَمْ يَلِدْ ڏ وَلَمْ يُوْلَدْ ۝ وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ ۝ۧ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল হুওয়াল্লা-হু আহাদ। আল্লাহুস্ সামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, তিনি আল্লাহ্, এক-অদ্বিতীয়। আল্লাহ্ হচ্ছেন ‘সামাদ’ (তিনি কারো মুখাপেক্ষী নন, সকলেই তাঁর মুখাপেক্ষী)। তিনি কাউকেও জন্ম দেন নি এবং তাঁকেও জন্ম দেয়া হয় নি। আর তাঁর সমতুল্য কেউই নেই।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۝ مِنْ شَرِّ مَا خَلَقَ ۝ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۝ وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ ۝ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۝﴾، বিসমিল্লাহির রাহমানির রাহীম (ক্বুল আ‘উযু বিরব্বিল ফালাক্ব। মিন শাররি মা খালাক্ব। ওয়া মিন শাররি গা-সিক্বিন ইযা ওয়াক্বাব। ওয়া মিন শাররিন নাফফা-সা-তি ফিল ‘উক্বাদ। ওয়া মিন শাররি হা-সিদিন ইযা হাসাদ)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি ঊষার রবের। তিনি যা সৃষ্টি করেছেন তার অনিষ্ট হতে। ‘আর অনিষ্ট হতে রাতের অন্ধকারের, যখন তা গভীর হয়। আর অনিষ্ট হতে সমস্ত নারীদের, যারা গিরায় ফুঁক দেয়। আর অনিষ্ট হতে হিংসুকের, যখন সে হিংসা করে।” بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝ ﴿قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ اِلٰهِ النَّاسِ ۝ مِنْ شَرِّ الْوَسْوَاسِ ڏ الْخَنَّاسِ ۝ الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ ۝ۧ﴾ বিসমিল্লাহির রাহমানির রাহীম (ক্বুল ‘আউযু বিরাব্বিন্না-স। মালিকিন্না-সি, ইলা-হিন্নাসি, মিন শাররিল ওয়াসওয়া-সিল খান্না-স, আল্লাযি ইউওয়াসউইসু ফী সুদূরিন না-সি, মিনাল জিন্নাতি ওয়ান্না-স।)। রহমান, রহীম আল্লাহর নামে। “বলুন, আমি আশ্রয় প্রার্থনা করছি মানুষের রবের, মানুষের অধিপতির, মানুষের ইলাহের কাছে, আত্মগোপনকারী কুমন্ত্রণাদাতার অনিষ্ট হতে; যে কুমন্ত্রণা দেয় মানুষের অন্তরে, জিনের মধ্য থেকে এবং মানুষের মধ্য থেকে।” আয়াতুল কুরসী। প্রত্যেক সালাতের পর একবার। আর তা হচ্ছে,",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবু দাঊদ ২/৮৬, নং ১৫২৩; তিরমিযী, নং ২৯০৩; নাসাঈ ৩/৬৮, নং ১৩৩৫। আরও দেখুন, সহীহুত তিরমিযী, ২/৮। আর উপর্যুক্ত তিনটি সূরাকে ‘আল-মু‘আওয়াযাত’ বলা হয়। দেখুন, ফাতহুল বারী, ৯/৬২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اَللّٰهُ لَآ اِلٰهَ اِلَّا ھُوَ ۚ اَلْـحَيُّ الْقَيُّوْمُ ڬ لَا تَاْخُذُهٗ سِـنَةٌ وَّلَا نَوْمٌ ۭ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖ ۭ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَھُمْ ۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۗءَ ۚ وَسِعَ كُرْسِـيُّهُ السَّمٰوٰتِ وَالْاَرْضَ ۚ وَلَا يَـــــُٔـــوْدُهٗ حِفْظُهُمَا ۚ وَھُوَ الْعَلِيُّ الْعَظِيْمُ ٢٥٥؁ (আল্লা-হু লা ইলা-হা ইল্লা হুওয়াল হাইয়্যূল কাইয়্যূমু লা তা’খুযুহু সিনাতুঁও ওয়ালা নাউম। লাহূ মা-ফিসসামা-ওয়া-তি ওয়ামা ফিল আরদ্বি। মান যাল্লাযী ইয়াশফা‘উ ‘ইনদাহূ ইল্লা বিইযনিহী। ইয়া‘লামু মা বাইনা আইদীহিম ওয়ামা খালফাহুম। ওয়ালা ইয়ুহীতূনা বিশাইইম মিন্ ইলমিহী ইল্লা বিমা শাআ। ওয়াসি‘আ কুরসিয়্যুহুস সামা-ওয়া-তি ওয়াল আরদ্ব। ওয়ালা ইয়াউদুহূ হিফযুহুমা ওয়া হুয়াল ‘আলিয়্যূল ‘আযীম)। “আল্লাহ্, তিনি ছাড়া কোনো সত্য ইলাহ্ নেই। তিনি চিরঞ্জীব, সর্বসত্তার ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না, নিদ্রাও নয়। আসমানসমূহে যা রয়েছে ও যমীনে যা রয়েছে সবই তাঁর। কে সে, যে তাঁর অনুমতি ব্যতীত তাঁর কাছে সুপারিশ করবে? তাদের সামনে ও পিছনে যা কিছু আছে তা তিনি জানেন। আর যা তিনি ইচ্ছে করেন তা ছাড়া তাঁর জ্ঞানের কোনো কিছুকেই তারা পরিবেষ্টন করতে পারে না। তাঁর ‘কুরসী’ আসমানসমূহ ও যমীনকে পরিব্যাপ্ত করে আছে; আর এ দুটোর রক্ষণাবেক্ষণ তাঁর জন্য বোঝা হয় না। আর তিনি সুউচ্চ সুমহান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসে এসেছে, “যে ব্যক্তি প্রত্যেক সালাতের পরে এটি পড়বে, তাকে মৃত্যু ব্যতীত জান্নাতে প্রবেশে আর অন্য কিছু বাধা হয়ে দাঁড়াবে না।” নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলাহ, নং ১০০; ইবনুস সুন্নী, নং ১২১। আর শাইখ আলবানী হাদীসটিকে সহীহুল জামে‘ ৫/৩৩৯ তে এবং সিলসিলাতুল আহাদীসিস সহীহা ২/৬৯৭, নং ৯৭২ তে সহীহ বলেছেন। আর আয়াতটি দেখুন, সূরা আল-বাকারাহ্‌-২৫৫। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু, লাহুল মূলকু ওয়ালাহুল হাম্‌দু ইয়ুহ্‌য়ী ওয়াইয়ূমীতু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তারই এবং সকল প্রশংসা তাঁর। তিনিই জীবিত করেন এবং মৃত্যু দান করেন। আর তিনি সকল কিছুর উপর ক্ষমতাবান”। মাগরিব ও ফজরের নামাযের পর উপরোক্ত যিকর ১০ বার করে করবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৫১৫, নং ৩৪৭৪; আহমাদ ৪/২২৭, নং ১৭৯৯০। হাদীসটির তাখরীজের জন্য আরও দেখুন, যাদুল মা‘আদ ১/৩০০। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (আল্লা-হুম্মা ইন্নী আস্আলুকা ‘ইলমান না-ফি‘আন্ ওয়া রিয্‌কান ত্বায়্যিবান ওয়া ‘আমালান মুতাক্বাব্বালান)। “হে আল্লাহ! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।” এটি ফজর নামাযের সালাম ফিরানোর পর পড়বে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "ইবন মাজাহ্‌, নং ৯২৫; নাসাঈ, তাঁর আমালুল ইয়াওমি ওয়াল্লাইলাহ গ্রন্থে, হাদীস নং ১০২। আরও দেখুন, সহীহ ইবন মাজাহ, ১/১৫২; মাজমাউয যাওয়াইদ, ১০/১১১। তাছাড়া অচিরেই ৯৫ নং হাদীসেও আসবে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৫. সালাম ফিরানোর পর যিকরসমূহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "জাবের ইবন আব্দুল্লাহ রাদিয়াল্লাহু ‘আনহুমা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে প্রত্যেক কাজেই ইসতিখারা (তথা কল্যাণ কামনার নামায ও দো‘আ) শিক্ষা দিতেন, যেরূপ আমাদেরকে কুরআনের সূরা শিক্ষা দিতেন। তিনি বলেন, যখন তোমাদের কেউ কোনো কাজ করার ইচ্ছা করে, তখন সে যেনো ফরয সালাত ব্যতীত দুই রাক্আত নফল নামায পড়ে, অতঃপর যেন বলে, 74- « اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيمِ؛ فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ - وَيُسَمِّي حَاجَتَهُ - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ – فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ». (আল্লা-হুম্মা ইন্নী আসতাখীরুকা বি‘ইলমিকা ওয়া আস্তাক্বদিরুকা বিক্বুদরাতিকা ওয়া আস্আলুকা মিন ফাদলিকাল আযীম। ফাইন্নাকা তাক্বদিরু ওয়ালা আক্বদিরু, ওয়া তা‘লামু ওয়ালা আ‘লামু, ওয়া আনতা ‘আল্লামূল গুয়ূব। আল্লা-হুম্মা ইন কুনতা তা‘লামু আন্না হা-যাল আম্‌রা (মনে মনে প্রয়োজন উল্লেখ করুন) খাইরুন লী ফী দ্বীনি ওয়া মা‘আ-শী ওয়া ‘আ-ক্বিবাতি আমরী, (অথবা বলেছেন) ‘আজিলিহী ও আজিলিহী, ফাকদুরহু লী, ওয়া ইয়াসসিরহু লী, ছুম্মা বা-রিক লী ফীহি। ওয়াইন কুনতা তা‘লামু আন্না হা-যাল আমরা (মনে মনে প্রয়োজন উল্লেখ করুন) শাররুন লী ফী দ্বীনী ওয়া মা‘আ-শী ওয়া ‘আ-ক্বিবাতি আমরী, (অথবা বলেছেন) ‘আজিলিহী ও আজিলিহী, ফাসরিফহু ‘আন্নী ওয়াসরিফনী ‘আনহু, ওয়াকদুর লিয়াল-খাইরা হাইসু কা-না, সুম্মা আরদ্বিনী বিহ্)। ৭৪- “হে আল্লাহ! আমি আপনার জ্ঞানের সাহায্যে আপনার নিকট কল্যাণ কামনা করছি। আপনার কুদরতের সাহায্যে আপনার নিকট শক্তি কামনা করছি এবং আপনার মহান অনুগ্রহের প্রার্থনা করছি। কেননা আপনিই শক্তিধর, আমি শক্তিহীন। আপনি জ্ঞানবান, আমি জ্ঞানহীন এবং আপনি গায়েবী বিষয় সম্পর্কে মহাজ্ঞানী। হে আল্লাহ! এই কাজটি (এখানে উদ্দিষ্ট কাজ বা বিষয়টি মনে মনে উল্লেখ করবে) আপনার জ্ঞান অনুযায়ী যদি আমার দ্বীন, আমার জীবিকা এবং আমার কাজের পরিণতির দিক দিয়ে, (অথবা বলেছেন) ইহকাল ও পরকালের জন্য কল্যাণকর হয়, তবে তা আমার জন্য নির্ধারিত করুন এবং তাকে আমার জন্য সহজলভ্য করে দিন, তারপর তাতে আমার জন্য বরকত দান করুন। আর এই কাজটি আপনার জ্ঞান অনুযায়ী যদি আমার দ্বীন, আমার জীবিকা এবং আমার কাজের পরিণতির দিক দিয়ে, (অথবা বলেছেন) ইহকাল ও পরকালের জন্য ক্ষতিকর হয়, তবে আপনি আমাকে তা থেকে দূরে সরিয়ে রাখুন এবং যেখানেই কল্যাণ থাকুক আমার জন্য সেই কল্যাণ নির্ধারিত করে দিন। অতঃপর তাতেই আমাকে সন্তুষ্ট রাখুন।”[1] আর যে ব্যক্তি স্রষ্টার কাছে কল্যাণ চাইবে, মুমিনদের সাথে পরামর্শ করবে এবং যে কোনো কাজ করার আগে খোঁজ-খবর নিয়ে করবে, সে কখনো অনুতপ্ত হবে না। কেননা, আল্লাহ সুবহানাহু ওয়া তা‘আলা বলেন, ﴿ وَشَاوِرْھُمْ فِي الْاَمْرِ ۚ فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَي اللَّهِ﴾. “আর আপনি কাজে কর্মে তাদের সাথে পরামর্শ করুন, তারপর আপনি কোনো দৃঢ় সংকল্প হলে আল্লাহ্‌র উপর নির্ভর করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ৭/১৬২, নং ১১৬২। সূরা আলে-ইমরান: ১৫৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "২৬. ইসতিখারার সালাতের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ؛ فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ، إِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ، [وَلاَ يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنا وَتَعَالَيْتَ (আল্লা-হুম্মাহদিনী ফীমান হাদাইতা ওয়া ‘আ-ফিনী ফীমান ‘আ-ফাইতা ওয়া তাওয়াল্লানী ফীমান তাওয়াল্লাইতা ওয়াবা-রিক লী ফীমা আ‘ত্বাইতা ওয়াক্বিনী শাররা মা ক্বাদাইতা ফাইন্নাকা তাক্ব‌্দ্বী ওয়ালা ইউক্ব্‌দ্বা ‘আলাইকা। ইন্নাহু লা ইয়াযিল্লু মাও ওয়া-লাইতা, [ওয়ালা ইয়া‘ইয্যু মান ‘আ-দাইতা।] তাবা-রক্‌তা রব্বানা ওয়া তা‘আ-লাইতা)। “হে আল্লাহ! আপনি যাদেরকে হেদায়াত করেছেন তাদের মধ্যে আমাকেও হেদায়াত দিন, আপনি যাদেরকে নিরাপত্তা প্রদান করেছেন তাদের মধ্যে আমাকেও নিরাপত্তা দিন, আপনি যাদের অভিভাবকত্ব গ্রহণ করেছেন, তাদের মধ্যে আমার অভিভাবকত্বও গ্রহণ করুন, আপনি আমাকে যা দিয়েছেন তাতে বরকত দিন। আপনি যা ফয়সালা করেছেন তার অকল্যাণ থেকে আমাকে রক্ষা করুন। কারণ আপনিই চুড়ান্ত ফয়সালা দেন, আপনার বিপরীতে ফয়সালা দেওয়া হয় না। আপনি যার সাথে বন্ধুত্ব করেছেন সে অবশ্যই অপমানিত হয় না [এবং আপনি যার সাথে শত্রুতা করেছেন সে সম্মানিত হয় না।] আপনি বরকতপূর্ণ হে আমাদের রব্ব! আর আপনি সুউচ্চ-সুমহান” ।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান গ্রন্থকারগণ, আহমাদ, দারামী ও বাইহাকী এ হাদীসটি সংকলন করেছেন। আবূ দাউদ, নং ১৪২৫; তিরমিযী, নং ৪৬৪; নাসাঈ, নং ১৭৪৪; ইবন মাজাহ, নং ১১৭৮; আহমাদ, নং ১৭১৮; দারামী, নং ১৫৯২; হাকিম, ৩/১৭২; বাইহাকী, ২/২০৯। আর দু’ ব্রাকেটের মাঝখানের অংশ বাইহাকীর। আরও দেখুন, সহীহুত তিরমিযী ১/১৪৪, সহীহ ইবন মাজাহ্‌, ১/১৯৪; ইরওয়াউল গালীল, লিল আলবানী, ২/১৭২। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُــــوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ (আল্লা-হুম্মা ইন্নী আঊযুবিরিদ্বা-কা মিন সাখাত্বিকা, ওয়া বিমু‘আ-ফা-তিকা মিন ‘উক্বুবাতিকা, ওয়া আঊযু বিকা মিনকা, লা উহ্‌সী সানা-আন আলাইকা, আনতা কামা আসনাইতা ‘আলা নাফসিকা)। “হে আল্লাহ! আমি আপনার সন্তুষ্টির মাধ্যমে অসন্তুষ্টি থেকে, আর আপনার নিরাপত্তার মাধ্যমে আপনার শাস্তি থেকে আশ্রয় চাই। আর আমি আপনার নিকটে আপনার (পাকড়াও) থেকে আশ্রয় চাই। আমি আপনার প্রশংসা গুনতে সক্ষম নই; আপনি সেরূপই, যেরূপ প্রশংসা আপনি নিজের জন্য করেছেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সুনান গ্রন্থকারগণ ও আহমাদ হাদীসটি সংকলন করেছেন। আবূ দাউদ, নং ১৪২৭; তিরমিযী, নং ৩৫৬৬; নাসাঈ, নং ১৭৪৬; ইবন মাজাহ্‌, নং ১১৭৯; আহমাদ, নং ৭৫১। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮০; সহীহ ইবন মাজাহ্‌, ১/১৯৪, আল-ইরওয়া, ২/১৭৫। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِيَّاكَ نعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِينَ مُلْحَقٌ. اللَّهُمَّ إِنَّا نَسْتَعينُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلاَ نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفرُكَ (আল্লা-হুম্মা ইয়্যাকা না‘বুদু, ওয়ালাকা নুসাল্লী, ওনাসজুদু, ওয়া ইলাইকা নাস‘আ, ওয়া নাহ্‌ফিদু, নারজূ রাহ্‌মাতাকা, ওয়া নাখশা ‘আযা-বাকা, ইন্না ‘আযা-বাকা বিলকাফিরীনা মুলহাক্ব। আল্লা-হুম্মা ইন্না নাসতা‘ঈনুকা ওয়া নাসতাগফিরুকা, ওয়া নুসনী ‘আলাইকাল খাইরা, ওয়ালা- নাকফুরুকা, ওয়ানূ’মিনু বিকা, ওয়া নাখদ্বা‘উ লাকা, ওয়ানাখলা‘উ মাই ইয়াকফুরুকা।) “হে আল্লাহ! আমরা আপনারই ইবাদত করি; আপনার জন্যই সালাত আদায় করি ও সিজদা করি; আমরা আপনার দিকেই দৌড়াই এবং দ্রুত অগ্রসর হই; আমরা আপনার করুণা লাভের আকাঙ্ক্ষা করি এবং আপনার শাস্তিকে ভয় করি। নিশ্চয় আপনার শাস্তি কাফেরদেরকে পাবে।” “হে আল্লাহ! নিশ্চয় আমরা আপনার কাছে সাহায্য চাই, আপনার কাছে ক্ষমা চাই, আপনার উত্তম প্রশংসা করি, আপনার সাথে কুফরি করি না, আপনার উপর ঈমান আনি, আপনার প্রতি অনুগত হই, আর যে আপনার সাথে কুফরি করে আমরা তার সাথে সম্পর্ক ছিন্ন করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি বায়হাকী তাঁর ‘আস-সুনানুল কবরা’ গ্রন্থে সংকলন করেছেন এবং তার সনদ বিশুদ্ধ বলেছেন, ২/২১১। আর শাইখ আলবানী ইরওয়াউল গালীল এর ২/১৭০ এ বলেন, ‘এর সনদ বিশুদ্ধ। আর তা উমর রা. থেকে মওকূফ হাদীসে বর্ণিত।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩২.বিত্‌রের কুনুতের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سُبْحَانَ المَلِكِ القُدُّوسِ (সুবহা-নাল মালিকিল ক্বুদ্দূস) “কতই না পবিত্র-মহান সেই মহাপবিত্র বাদশা!” তিনবার বলতেন; তৃতীয়বারে উচ্চস্বরে টেনে টেনে পড়ে বলতেন, « [رَبِّ الْمَلاَئِكَةِ وَالرُّوحِ]». ([রাব্বিল মালা-ইকাতি ওয়ার-রূহ])। “[যিনি ফেরেশতা ও রূহ -এর রব।]”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নাসাঈ, ৩/২৪৪, নং ১৭৩৪; দারা কুতনী, ২/৩১ ও অন্যান্যগণ। আর দুই ব্রাকেটের মাঝখানের অংশ দারা কুতনীতে ২/৩১, নং ২ বেশি বর্ণিত। যার সনদ বিশুদ্ধ। আরও দেখুন, শু‘আইব আল-আরনাঊত ও আবদুল কাদের আল-আরনাঊত এর ‘যাদুল মা‘আদ’ গ্রন্থের সম্পাদনা ১/৩৩৭। ",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৩. বিত্‌রের নামায থেকে সালাম ফিরানোর পরের যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ (আ‘ঊযু বিল্লা-হি মিনাশ শাইত্বানির রাজীম) “বিতাড়িত শয়তান থেকে আমি আল্লাহ্‌র আশ্রয় নিচ্ছি।” অতঃপর বাম দিকে তিনবার থুতু ফেলবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/১৭২৯, ২২০৩। সেখানে এসেছে, উসমান ইবনুল ‘আস রাদিয়াল্লাহু ‘আনহু বলেন, আমি বললাম, হে আল্লাহর রাসূল! শয়তান আমার ও আমার নামাযের মাঝে অনুপ্রবেশ করে এবং কিরাআতে বিভ্রান্তি সৃষ্টি করে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সেটা বলার নির্দেশ দেন, তিনি সেটা করার পর আল্লাহ তাঁকে সেটা থেকে মুক্ত করেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪২. সালাতে ও কেরাআতে শয়তানের কুমন্ত্রণায় পতিত ব্যক্তির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ القَبْرِ (আল্লা-হুম্মা আ‘য়িযহু মিন আযা-বিল ক্বাবরি) “হে আল্লাহ! এ শিশুকে কবরের আযাব থেকে রক্ষা করুন।” আর যদি নিম্নোক্ত দো‘আটি পড়া হয় তবে তাও উত্তম: «اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوَالِدَيْهِ، وَشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِينَهُمَا، وَأَعْظِمْ بِهِ أُجورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيمِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لِأَسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالْإِيمَانِ». (আল্লা-হুম্মাজ‘আলহু ফারাত্বান ওয়া যুখরান লিওয়লিদায়হি, ওয়াশাফী‘আন মুজাবান। আল্লা-হুম্মা সাক্কিল বিহী মাওয়াযীনাহুমা, ওয়াআ‘যিম বিহী উজূরাহুমা, ওয়া আলহিক্বহু বিসা-লিহিল মু’মিনীন, ওয়াজ‘আলহু ফী কাফা-লাতি ইবরাহীমা, ওয়াক্বিহি বিরাহমাতিকা ‘আযা-বাল জাহীম, ওয়া আবদিলহু দা-রান খাইরান মিন দা-রিহি, ওয়া আহলান খায়রান মিন আহলিহি, আল্লা-হুম্মাগফির লি’আসলাফিনা ওয়া আফরাত্বিনা ওয়া মান সাবাক্বানা বিল ঈমান।) “হে আল্লাহ, তাকে তার পিতা-মাতার জন্য অগ্রগামী প্রতিনিধি বা সওয়াব ও সযত্নে গচ্ছিত সওয়াব হিসেবে কবুল করুন। আর তাকে এমন শাফা‘আতকারী বানান, যার শাফা‘আত কবুল হয়। হে আল্লাহ, এ শিশুর দ্বারা তার পিতা মাতার ওজনসমূহ আরও ভারী করে দিন। আর এর দ্বারা তাদের দু’জনের সওয়াব আরও বাড়িয়ে দিন। আর তাকে নেককারদের সঙ্গী-সাথী বানান এবং তাকে ইবরাহীম আলাইহিসসালামের যিম্মায় রাখুন। আর আপনার রহমতের অসীলায় তাকে জাহান্নামের শাস্তি থেকে রক্ষা করুন। তাকে তার এ বাসস্থানের পরিবর্তে উত্তম বাসস্থান প্রদান করুন, এখানকার পরিবার-পরিজনের পরিবর্তে উত্তম পরিবার-পরিজন প্রদান করুন। হে আল্লাহ, আমাদের পূর্ববর্তী নর-নারী ও নাবালক অগ্রগামী সন্তান-সন্ততিদের মাফ করুন এবং যারা ঈমান সহকারে আমাদের পূর্বে মারা গেছে তাদেরকেও।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সা‘ঈদ ইবনুল মুসাইয়্যেব বলেন, আমি আবু হুরাইরা রাদিয়াল্লাহু আনহুর পিছনে একটি শিশুর জানাযার সালাত আদায় করেছি, যে শিশু কখনও কোনো গুনাহ করে নি, তখন আমি তাকে (উপরোক্ত দো‘আটি) বলতে শুনলাম....। হাদীসটি ইমাম মালেক তার মুওয়াত্তা গ্রন্থে সংকলন করেন, ১/২৮৮; ইবন আবী শাইবাহ তার মুসান্নাফ গ্রন্থে, ৩/২১৭; বাইহাকী, ৪/৯। আর শাইখ শু‘আইব আল-আরনাউত শারহুস সুন্নাহ লিল বাগভীর তাহকীকে ৫/৩৫৭, এটার সনদকে সহীহ বলেছেন। দেখুন, আল-মুগনী, লি ইবন কুদামা, ৩/৪১৬; আরও দেখুন, আদ-দুরুসুল মুহিম্মাহ লি ‘আম্মাতিল উম্মাহ, লিশ শাইখ আবদিল আযীয ইবন আব্দিল্লাহ ইবন বায, রাহেমাহুল্লাহ, পৃ. ১৫।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً (আল্লা-হুম্মাজ‘আলহু লানা ফারাত্বান ওয়া সালাফান ওয়া আজরান) “হে আল্লাহ, আমাদের জন্য তাকে অগ্রগামী প্রতিনিধি, অগ্রিম পূণ্য এবং সওয়াব হিসেবে নির্ধারণ করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাসান বসরী রাহেমাহুল্লাহ যখন ছোট শিশুদের জানাযা পড়তেন তখন তার উপর সূরা ফাতেহা পড়তেন এবং উপরোক্ত দো‘আ বলতেন। হাদীসটি ইমাম বাগভী তার শারহুস সুন্নাহ ৫/৩৫৭ এ বর্ণনা করেছেন। আরও বর্ণনা করেছেন, আব্দুর রায্‌যাক তার মুসান্নাফে, নং ৬৫ ৮৮। তাছাড়া ইমাম বুখারী, কিতাবুল জানায়েয এর, ৬৫, বাবু কিরাআতি ফাতিহাতিল কিতাব আলাল জানাযাত ২/১১৩; ১৩৩৫ নং হাদীসের পূর্বে এটাকে তা‘লীক বা সনদ ব্যতীত বর্ণনা করেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৬. নাবালক শিশুদের জন্য জানাযার সালাতে দো‘আ",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "সাওম [রোজা]",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالْإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ. (আল্লা-হু আকবার, আল্লা-হুম্মা আহিল্লাহু ‘আলাইনা বিলআমনি ওয়ালঈমানি ওয়াস্‌সালা-মাতি ওয়াল-ইসলা-মি, ওয়াত্তাওফীকি লিমা তুহিব্বু রব্বানা ওয়া তারদ্বা, রব্বুনা ওয়া রব্বুকাল্লাহ) “আল্লাহ সবচেয়ে বড়। হে আল্লাহ! এই নতুন চাঁদকে আমাদের উপর উদিত করুন নিরাপত্তা, ঈমান, শান্তি ও ইসলামের সাথে; আর হে আমাদের রব্ব! যা আপনি পছন্দ করেন এবং যাতে আপনি সন্তুষ্ট হন তার প্রতি তাওফীক লাভের সাথে। আল্লাহ আমাদের রব্ব এবং তোমার (চাঁদের) রব্ব।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৫০৪, নং ৩৪৫১; আদ-দারিমী, শব্দ তাঁরই, ১/৩৩৬। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৭. নতুন চাঁদ দেখে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ (যাহাবায-যামাউ ওয়াবতাল্লাতিল ‘উরূকু ওয়া সাবাতাল আজরু ইনশা-আল্লা-হু)। “পিপাসা মিটেছে, শিরাগুলো সিক্ত হয়েছে এবং আল্লাহ্‌ চান তো সওয়াব সাব্যস্ত হয়েছে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন আবূ দাউদ ২/৩০৬, নং ২৩৫৭ ও অন্যান্য। আরও দেখুন, সহীহুল জামে‘ ৪/২০৯।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِي (আল্লা-হুম্মা ইন্নী আসআলুকা বিরহ্‌মাতিকাল্লাতী ওয়াসি‘আত কুল্লা শাই’ইন আন তাগফিরা লী)। “হে আল্লাহ! আপনার যে রহমত সকল কিছু পরিব্যাপ্ত করে রেখেছে তার উসীলায় আবেদন করি, আপনি আমাকে ক্ষমা করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, ইবন মাজাহ্‌ ১/৫৫৭, নং ১৭৫৩; যা মূলত আবদুল্লাহ ইবন আমর রাদিয়াল্লাহু আনহুমার দো‘আ। আর হাফেয ইবন হাজার তাঁর তাখরীজুল আযকারে এটার সনদকে হাসান বলেছেন। শরহুল আযকার, ৪/৩৪২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬৮. ইফতারের সময় রোযাদারের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যদি কাউকে খাবারের দাওয়াত দেওয়া হয় সে যেন তাতে সাড়া দেয়; তারপর যদি সে রোযাদার হয়, তবে যেন সে তার (খাবার ওয়ালার) জন্য দো‘আ করে, আর যদি রোযা ভঙ্গকারী হয়, তবে যেন সে খায়।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ২/১০৫৪, নং ১১৫০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৪. রোযাদারের নিকট যদি খাবার উপস্থিত হয়, আর সে রোযা না ভাঙ্গে তখন তার দো‘আ করা",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ (ইন্নি সা‘ইমুন, ইন্নি সা’ইমুন) “নিশ্চয় আমি রোযাদার, নিশ্চয় আমি রোযাদার।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৪/১০৩, নং ১৮৯৪; মুসলিম, ২/৮০৬, নং ১১৫১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৫. রোযাদারকে কেউ গালি দিলে যা বলবে",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "হজ্জ ও উমরা",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ (লাব্বাইকাল্লা-হুম্মা লাব্বাইকা, লাব্বাইকা লা শারীকা লাকা লাব্বাইক। ইন্নাল-হামদা ওয়ান-নি‘মাতা লাকা ওয়াল মুলক, লা শারীকা লাকা)। “আমি আপনার দরবারে হাযির, হে আল্লাহ! আমি আপনার দরবারে উপস্থিত। আমি আপনার দরবারে হাযির, আপনার কোনো শরীক নেই, আমি আপনার দরবারে উপস্থিত। নিশ্চয় সকল প্রশংসা ও নেয়ামত আপনার, আর রাজত্বও। আপনার কোনো শরীক নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৩/৪০৮, নং ১৫৪৯; মুসলিম ২/৮৪১, নং ১১৮৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৫. হজ্জ বা উমরায় মুহরিম ব্যক্তি কিভাবে তালবিয়াহ পড়বে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উটের উপর আরোহণ করে কা‘বা ঘর তাওয়াফ করলেন; যখনই তিনি হাজরে আসওয়াদের কাছে পৌছতেন, তখনই সেদিকে তার নিকটস্থ কিছু দিয়ে ইঙ্গিত করতেন এবং ‘আল্লাহু আকবার’ বলতেন’।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৩/৪৭৬, নং ১৬১৩। আর ‘কোনো কিছু’ বলে এখানে বাঁকা লাঠি বোঝানো হয়েছে। দেখুন, বুখারী, (ফাতহুল বারীসহ), ৩/৪৭২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৬. হাজরে আসওয়াদের কাছে আসলে তাকবীর বলা",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ ٢٠١؁ (রব্বানা আ-তিনা ফিদ্দুনিয়া হাসানাতাওঁ ওয়াফিল আ-খিরাতি হাসানাতাওঁ ওয়াকিনা ‘আযা-বান্না-র)। “হে আমাদের রব্ব! আমাদেরকে দুনিয়াতে কল্যাণ দিন এবং আখেরাতেও কল্যাণ দিন এবং আমাদেরকে আগুনের শাস্তি থেকে রক্ষা করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/১৭৯, নং ১৮৯৪; মুসনাদে আহমাদ ৩/৪১১, নং ১৫৩৯৮; আল-বাগভী ফী শারহিস সুন্নাহ, ৭/১২৮। আর শাইখ আলবানী সহীহ আবি দাউদে ১/৩৫৪ একে সহীহ বলেছেন। আয়াতটি সূরা আল-বাকারাহ্‌র আয়াত নং ২০১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৭. রুকনে ইয়ামানী ও হাজরে আসওয়াদের মাঝে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফা পর্বতের নিকটবর্তী হলেন, তখন এই আয়াত পড়লেনঃ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ (ইন্নাস্‌সাফা ওয়াল-মারওয়াতা মিন শা‘আ-ইরিল্লা-হ)। “নিশ্চয়ই সাফা ও মারওয়া আল্লাহ্‌র নিদর্শনসমূহের অন্তর্ভুক্ত।” আর বলেন, “আল্লাহ্‌ যেখান থেকে শুরু করেছেন আমিও সেখান থেকে শুরু করব।” অতঃপর তিনি সাফা পর্বতে আরোহণ করতে লাগলেন যতক্ষণ না কা‘বা দেখলেন, অতঃপর কিবলামুখী হলেন, তারপর আল্লাহ্‌র তাওহীদ (লা ইলাহা ইল্লাল্লাহ) ঘোষণা করেন এবং তাকবীর (আল্লাহু আকবার) বলেন, অতঃপর এই দো‘আ পড়েন, لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর। লা ইলাহা ইল্লাল্লা-হু ওয়াহদাহু, আনজাযা ওয়া‘দাহু, ওয়ানাসারা ‘আবদাহু, ওয়া হাযামাল-আহযা-বা ওয়াহদাহু)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর; আর তিনি সকল কিছুর উপর ক্ষমতাবান। একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি তাঁর ওয়াদা পূর্ণ করেছেন, তিনি তাঁর বান্দাকে সাহায্য করেছেন, আর তিনি সকল বিরোধী দল-গোষ্ঠীকে একাই পরাস্ত করেছেন।” এভাবে তিনি এর মধ্যবর্তী স্থানেও দো‘আ করতে থাকেন। এই দো‘আ তিনবার পাঠ করেন। হাদীসটিতে আরও আছে, “তিনি সাফা পাহাড়ে যেমন করেছিলেন মারওয়াতেও অনুরূপ করেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৮৮৮, নং ১২১৮; আর আয়াতটি সূরা আল-বাকারার আয়াত নং ১৫৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৮. সাফা ও মারওয়ায় দাঁড়িয়ে যা পড়বে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “শ্রেষ্ঠ দো‘আ হচ্ছে আরাফাত দিবসের দো‘আ। আর আমি এবং আমার পূর্ববর্তী নবীগণ যা বলেছি তার মধ্যে শ্রেষ্ঠ হচ্ছে: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, লাহুল মূলকু ওয়া লাহুল হামদু, ওয়া হুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর; আর তিনি সকল কিছুর উপর ক্ষমতাবান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী নং ৩৫৮৫; আর শাইখুল আলবানী সহীহুত তিরমিযীতে হাদীসটিকে হাসান বলেছেন, ৩/১৮৪; অনুরূপভাবে সিলসিলা সহীহায় ৪/৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১৯. আরাফাতের দিনে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘কাসওয়া’ নামক উষ্ট্রীতে আরোহণ করলেন, অবশেষে তিনি যখন মাশ‘আরুল হারামে (মুযদালিফার একটি স্থানে) আসেন, তখন তিনি কিবলামুখী হয়ে দো‘আ করেন এবং তাকবীর বলেন, লা ইলাহা ইল্লাল্লাহু পাঠ করেন এবং তাঁর তাওহীদ বা একত্ব ঘোষণা করেন। তারপর তিনি (আকাশ) পূর্ণ ফর্সা না হওয়া পর্যন্ত সেখানেই অবস্থান করেন। অতঃপর সূর্য উদিত হওয়ার পূর্বেই তিনি মুযদালিফা ত্যাগ করেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৮৯১, নং ১২১৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২০. মাশ‘আরুল হারাম তথা মুযদালিফায় যিক্‌র",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] তিনটি জামরায় প্রতিটি কংকর নিক্ষেপের সময় ‘আল্লাহু আকবার’ বলতেন, অতঃপর কিছুটা অগ্রসর হয়ে কিবলামুখী হয়ে দাঁড়াতেন এবং প্রথম জামরা ও দ্বিতীয় জামরায় দুই হাত উঁচু করে দো‘আ করতেন। কিন্তু জামরাতুল ‘আক্বাবায় প্রতিটি কংকর নিক্ষেপের সময় ‘আল্লাহু আকবার’ বলতেন এবং সেখানে অবস্থান না করে ফিরে আসতেন।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৩/৫৮৩, নং ১৭৫১; সেখানে তার শব্দ দেখুন, আরও দেখুন, বুখারী, (ফাতহুল বারীসহ) ৩/৫৮৩, ৩/৫৮৪, ৩/৫৮১ নং ১৭৫৩; অনুরূপ মুসলিম নং ১২১৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২১. জামরাসমূহে প্রত্যেক কংকর নিক্ষেপকালে তাকবীর বলা",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ وَلَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي (বিসমিল্লা-হি ওয়াল্লা-হু আকবার, [আল্লা-হুম্মা মিনকা ওয়ালাকা], আল্লা-হুম্মা তাকাব্বাল মিন্নী) “আল্লাহ্‌র নামে, আর আল্লাহ সবচেয়ে বড়। [হে আল্লাহ! এটা আপনার নিকট থেকে প্রাপ্ত এবং আপনার জন্যই।] হে আল্লাহ! আপনি আমার তরফ থেকে তা কবুল করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৩/১৫৫৭, নং ১৯৬৭; বায়হাকী ৯/২৮৭, দু ব্রাকেটের মাঝখানের অংশ বাইহাকী থেকে, ৯/২৮৭, ইত্যাদি। তবে সর্বশেষ বাক্যটি ইমাম মুসলিমের বর্ণনা থেকে অর্থ হিসেবে গৃহীত।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৭. পশু যবেহ বা নাহর করার সময় যা বলবে",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "দুশ্চিন্তা, মুসীবত, রোগ ও মৃত্যু",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُــــلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي (আল্লা-হুম্মা ইন্নী ‘আবদুকা ইবনু ‘আবদিকা ইবনু আমাতিকা, না-সিয়াতী বিয়াদিকা, মা-দ্বিন ফিয়্যা হুকমুকা, ‘আদলুন ফিয়্যা কাদ্বা-য়ুকা, আসআলুকা বিকুল্লি ইসমিন্ হুয়া লাকা সাম্মাইতা বিহি নাফসাকা, আও আনযালতাহু ফী কিতা-বিকা আও ‘আল্লামতাহু আহাদাম্-মিন খালক্বিকা আও ইস্তা’সারতা বিহী ফী ‘ইলমিল গাইবি ‘ইনদাকা, আন্ তাজ‘আলাল কুরআ-না রবী‘আ ক্বালবী, ওয়া নূরা সাদ্‌রী, ওয়া জালা’আ হুযনী ওয়া যাহা-বা হাম্মী)। “হে আল্লাহ! আমি আপনার বান্দা, আপনারই এক বান্দার পুত্র এবং আপনার এক বাঁদীর পুত্র। আমার কপাল (নিয়ন্ত্রণ) আপনার হাতে; আমার উপর আপনার নির্দেশ কার্যকর; আমার ব্যাপারে আপনার ফয়সালা ন্যায়পূর্ণ। আমি আপনার কাছে প্রার্থনা করি আপনার প্রতিটি নামের উসীলায়; যে নাম আপনি নিজের জন্য নিজে রেখেছেন অথবা আপনার আপনি আপনার কিতাবে নাযিল করেছেন অথবা আপনার সৃষ্টজীবের কাউকেও শিখিয়েছেন অথবা নিজ গায়েবী জ্ঞানে নিজের জন্য সংরক্ষণ করে রেখেছেন—আপনি কুরআনকে বানিয়ে দিন আমার হৃদয়ের প্রশান্তি, আমার বক্ষের জ্যোতি, আমার দুঃখের অপসারণকারী এবং দুশ্চিন্তা দূরকারী।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ১/৩৯১, নং ৩৭১২। আর শাইখ আলবানী তাঁর সিলসিলাতুল আহাদীসিস সহীহাহ গ্রন্থে ১/৩৩৭ একে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ (আল্লা-হুম্মা ইন্নি আ‘ঊযু বিকা মিনাল হাম্মি ওয়াল হাযানি, ওয়াল ‘আজযি ওয়াল কাসালি, ওয়াল বুখলি ওয়াল জুবনি, ওয়া দালা‘ইদ দ্বাইনে ওয়া গালাবাতির রিজা-লি) “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ৭/১৫৮, নং ২৮৯৩; সেখানে এসেছে, রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দো‘আটি বেশি বেশি করতেন। আরও দেখুন, বুখারী, (ফাতহুল বারীসহ) ১১/১৭৩; আরও দেখুন যা পৃষ্ঠায় ১৩৭ নং এ বর্ণিত হবে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৪. দুঃখ ও দুশ্চিন্তার সময় পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ (লা ইলা-হা ইল্লাল্লা-হুল ‘আযীমূল হালীম। লা ইলা-হা ইল্লাল্লা-হু রব্বুল ‘আরশিল ‘আযীম। লা ইলাহা ইল্লাল্লা-হু রব্বুস সামা-ওয়া-তি ওয়া রব্বুল আরদ্বি ওয়া রব্বুল ‘আরশিল কারীম)। “আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান ও সহিষ্ণু। ‘আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান আরশের রব্ব। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি আসমানসমূহের রব্ব, যমীনের রব্ব এবং সম্মানিত আরশের রব্ব।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৭/১৫৪, নং ৬৩৪৫; মুসলিম ৪/২০৯২, নং ২৭৩০।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ (আল্লা-হুম্মা রহ্‌মাতাকা আরজু ফালা তাকিলনী ইলা নাফসী ত্বারফাতা ‘আইন, ওয়া আসলিহ্ লী শা’নি কুল্লাহু, লা ইলা-হা ইল্লা আনতা)। “হে আল্লাহ! আমি আপনার রহমতেরই আশা করি। তাই আপনি এক নিমেষের জন্যও আমাকে আমার নিজের কাছে সোপর্দ করবেন না। আপনি আমার সার্বিক বিষয়াদি সংশোধন করে দিন। আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, ৪/৩২৪, নং ৫০৯০; আহমাদ ৫/৪২, নং ২০৪৩০। আর শাইখ আলবানী সহীহ আবি দাউদ গ্রন্থে ৩/৯৫৯ এটাকে হাসান হাদীস বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظّالِمِينَ (লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুনতু মিনায-যা-লিমীন)। “আপনি ছাড়া কোনো হক্ব ইলাহ নেই, আপনি পবিত্র-মহান, নিশ্চয় আমি যালেমদের অন্তর্ভুক্ত।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৫২৯, নং ৩৫০৫; হাকেম এবং তিনি একে সহীহ বলেছেন, যাহাবী সেটা সমর্থন করেছেন, ১/৫০৫। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৬৮। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ اللَّهُ رَبِّي لاَ أُشْرِكُ بِهِ شَيْئاً (আল্লাহু আল্লাহু, রব্বী, লা উশরিকু বিহী শাই’আন)। “আল্লাহ! আল্লাহ! (তিনি) আমার রব্ব! আমি তাঁর সাথে কোনো কিছু শরীক করি না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, আবূদাউদ, ২/৮৭, নং ১৫২৫; ইবন মাজাহ্‌, নং ৩৮৮২। আরও দেখুন, সহীহ ইবন মাজাহ্‌, ২/৩৩৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৫. দুর্দশাগ্রস্ত ব্যক্তির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِم، وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ (আল্লা-হুম্মা ইন্না নাজ্‘আলুকা ফী নুহূরিহিম ওয়া না‘উযু বিকা মিন শুরূরিহিম)। “হে আল্লাহ! আমরা আপনাকে তাদের গলদেশে রাখছি এবং তাদের অনিষ্ট থেকে আপনার নিকট আশ্রয় প্রার্থনা করছি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবু দাঊদ ২/৮৯, নং ১৫৩৭; আর হাকেম হাদীসটিকে সহীহ বলেছেন এবং ইমাম যাহাবী একে সমর্থন করেছেন ২/১৪২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيرِي، بِكَ أَحُولُ وَبِكَ أَصُولُ، وَبِكَ أُقاتِلُ (আল্লহুম্মা আনতা ‘আদ্বুদী, ওয়া আনতা নাসীরী, বিকা আহূলু, ওয়া বিকা আসূলু, ওয়া বিকা উক্বা-তিলু)। “হে আল্লাহ! আপনি আমার শক্তি এবং আপনি আমার সাহায্যকারী; আপনারই সাহায্যে আমি বিচরণ করি, আপনারই সাহায্যে আমি আক্রমন করি এবং আপনারই সাহায্যে আমি যুদ্ধ করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৩/৪২, নং ২৬৩২; তিরমিযী ৫/৫৭২, নং ৩৫৮৪। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "حَسْبُنا اللَّهُ وَنِعْمَ الْوَكِيلُ (হাসবুনাল্লা-হু ওয়া নি‘মাল ওয়াকীল)। “আল্লাহই আমাদের জন্য যথেষ্ট, আর তিনি কতই না উত্তম কর্মবিধায়ক”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৫/১৭২, নং ৪৫৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৬. শত্রু এবং শক্তিধর ব্যক্তির সাক্ষাতকালে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ ربَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لِي جَاراً مِنْ فُلاَنِ بْنِ فُلاَنٍ، وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلاَ إِلَهَ إِلاَّ أَنْتَ (আল্লা-হুম্মা রব্বাস্ সামা-ওয়া-তিস সাব‘ঈ, ওয়া রব্বাল ‘আরশিল ‘আযীম। কুন লী জারান মিন্ ফুলানিবনি ফুলানিন, ওয়া আহযাবিহী মিন খালায়েক্বিকা, আঁই ইয়াফরুত্বা ‘আলাইয়্যা আহাদুম মিনহুম আও ইয়াত্বগা, আয্যা জা-রুকা, ওয়া জাল্লা সানা-উকা, ওয়া লা ইলা-হা ইল্লা আনতা)। “হে আল্লাহ, সাত আসমানের রব্ব! মহান আরশের রব্ব! আপনার সৃষ্টিকুলের মধ্য থেকে অমুকের পুত্র অমুকের বিপক্ষে এবং তার বাহিনীর বিরুদ্ধে আপনি আমার আশ্রয়দানকারী হোন; যাতে তাদের কেউ আমার উপর দ্রুত আক্রমণ বা সীমালঙ্ঘন করতে না পারে। আপনার আশ্রিত তো শক্তিশালী, আপনার প্রশংসা তো অতি মহান। আর আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, আল-আদাব আল-মুফরাদ, নং ৭১২। আর শাইখ আলবানী সহীহ আল-আদাবুল মুফরাদ গ্রন্থে, নং ৫৪৫, একে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ أَكْبَرُ، اللَّهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيعاً، اللَّهُ أَعَزُّ مِمَّا أَخَافُ وَأَحْذَرُ، أَعُوذُ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الْأَرْضِ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وَجُنُودِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ، مِنْ الْجِنِّ وَالإِنْسِ، اللَّهُمَّ كُنْ لِي جَاراً مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ».(৩ বার) (আল্লা-হু আকবার, আল্লা-হু আ‘আয্যু মিন খালক্বিহী জামী‘আন। আল্লাহু আ‘আয্যু মিম্মা আখা-ফু ওয়া আহযারু। আউযু বিল্লা-হিল্লাযী লা ইলা-হা ইল্লা হুওয়াল মুমসিকুস্ সামা-ওয়া-তিস সাব‘ঈ, আন ইয়াকা‘না আলাল্ আরদ্বি ইল্লা বিইযনিহী, মিন শাররি ‘আবদিকা ফুলা-নিন, ওয়া জুনূদিহী ওয়া আতবা‘ইহী ওয়া আশইয়া‘ইহী মিনাল জিন্নি ওয়াল ইনসি। আল্লা-হুম্মা কুন লী জা-রান মিন শাররিহিম, জাল্লা সানা-উকা ওয়া ‘আয্যা জা-রুকা ওয়াতাবা-রকাসমুকা ওয়া লা ইলা-হা গাইরুকা)। (৩ বার) “আল্লাহ সবচেয়ে বড়, আল্লাহ তাঁর সমস্ত সৃষ্টি থেকে মহামর্যাদাবান। আমি যা থেকে ভীত ও শঙ্কিত তার চেয়ে আল্লাহ মহাপরাক্রমশালী। আমি আল্লাহ্‌র কাছে আশ্রয় চাই, যিনি ছাড়া আর কোনো হক্ব ইলাহ নেই, যিনি সাত আসমানের ধারণকারী, তার অনুমতি ব্যতীত পৃথিবীর উপর পতিত হওয়া থেকে— (আশ্রয় চাই) তাঁর অমুক বান্দা, তার সৈন্য-সামন্ত, তার অনুসারী ও তার অনুগামী জিন ও ইনসানের অনিষ্ট থেকে। হে আল্লাহ! তাদের ক্ষতি থেকে আপনি আমার জন্য আশ্রয়দানকারী হোন। আপনার গুণগান অতি মহান, আপনার আশ্রিত প্রবল শক্তিশালী, আপনার নাম অতি বরকতময়। আর আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”(৩ বার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, আল-আদাব আল-মুফরাদ, নং ৭০৮। আর শাইখ আলবানী সহীহ আল-আদাবুল মুফরাদ গ্রন্থে, নং ৫৪৬, একে সহীহ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৭. শাসকের অত্যাচারের ভয় করলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهزِمْهُمْ وَزَلْزِلْهُمْ (আল্লা-হুম্মা মুনযিলাল কিতা-বি সারী‘আল হিসা-বি ইহযিমিল আহযা-ব। আল্লা-হুম্মাহযিমহুম ওয়া যালযিলহুম)। “হে আল্লাহ, কিতাব নাযিলকারী, দ্রুত হিসাব গ্রহণকারী! আপনি শত্রুবাহিনীকে পরাভূত করুন। হে আল্লাহ! আপনি তাদেরকে পরাজিত করুন এবং তাদের মধ্যে ত্রাস সৃষ্টি করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৩/১৩৬২, নং ১৭৪২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৮. শত্রুর উপর বদ-দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اكْفِنِيهِمْ بِمَا شِئْتَ (আল্লা-হুম্মাকফিনীহিম বিমা শি’তা)। “হে আল্লাহ! আপনি যা ইচ্ছে তা দ্বারাই এদের মোকাবিলায় আমার জন্য যথেষ্ট হোন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/২৩০০, নং ৩০০৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৩৯. কোনো সম্প্রদায়কে ভয় করলে যা বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ (আল্লা-হুম্মাকফিনী বিহালা-লিকা ‘আন হারা-মিকা ওয়া আগনিনী বিফাদ্বলিকা ‘আম্মান সিওয়া-ক)। “হে আল্লাহ! আপনি আমাকে আপনার হালাল দ্বারা পরিতুষ্ট করে আপনার হারাম থেকে ফিরিয়ে রাখুন এবং আপনার অনুগ্রহ দ্বারা আপনি ছাড়া অন্য সকলের থেকে আমাকে অমুখাপেক্ষী করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী ৫/৫৬০, নং ৩৫৬৩। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮০।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ (আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিনাল হাম্মি ওয়াল হাযানি, ওয়া আ‘ঊযু বিকা মিনাল-‘আজযি ওয়াল-কাসালি, ওয়া আ‘ঊযু বিকা মিনাল-বুখলি ওয়াল-জুবনি, ওয়া আ‘ঊযু বিকা মিন দ্বালা‘য়িদ্দাইনি ওয়া গালাবাতির রিজা-ল)। “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ৭/১৫৮, নং ২৮৯৩। তাছাড়া পূর্বে পৃষ্ঠায় ১২১ নং এ গত হয়েছে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪১. ঋণ মুক্তির জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً (আল্লা-হুম্মা লা সাহ্‌লা ইল্লা মা জা‘আলতাহু সাহ্‌লান, ওয়া আনতা তাজ্‘আলুল হাযনা ইযা শি’তা সাহ্‌লান)। “হে আল্লাহ! আপনি যা সহজ করেছেন তা ছাড়া কোনো কিছুই সহজ নয়। আর যখন আপনি ইচ্ছা করেন তখন কঠিনকেও সহজ করে দেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "সহীহ ইবন হিব্বান ২৪২৭, (মাওয়ারিদ); ইবনুস সুন্নী, নং ৩৫১। আর হাফেয (ইবন হাজার) বলেন, এটি সহীহ হাদীস। তাছাড়া আবদুল কাদের আরনাউত ইমাম নওয়াবীর আযকার গ্রন্থের তাখরীজে পৃ. ১০৬, একে সহীহ বলে মত প্রকাশ করেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৩. কঠিন কাজে পতিত ব্যক্তির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "قَدَرُ اللَّه وَمَا شَاءَ فَعَلَ (কাদারুল্লা-হ, ওয়ামা শা-আ ফা‘আলা) “এটি আল্লাহ্‌র ফয়সালা, আর তিনি যা ইচ্ছা করেছেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসে এসেছে, “শক্তিশালী ঈমানদার আল্লাহর নিকট উত্তম ও প্রিয় দুর্বল ঈমানদারের চেয়ে। আর তাদের (ঈমানদারদের) প্রত্যেকের মধ্যেই কল্যাণ নিহিত রয়েছে। তোমার যা কাজে লাগবে সেটা করার ব্যাপারে সচেষ্ট হও আর আল্লাহর সাহায্য চাও, অপারগ হয়ে যেও না। আর যদি তোমার কোনো অনাকাঙ্খিত বিষয় উদয় হয়, তখন বলো না যে, ‘যদি আমি এরকম করতাম তাহলে তা এই এই হতো’, বরং বলো, “এটা আল্লাহর ফয়সালা, আর তিনি যা ইচ্ছে করেছেন।” কেননা, ‘যদি’ শয়তানের কাজের সূচনা করে দেয়। মুসলিম, ৪/২০৫২, নং ২৬৬৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৬. যখন অনাকাঙ্খিত কিছু ঘটে, বা যা করতে চায় তাতে বাধাপ্রাপ্ত হয়, তখন পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ بأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ (লা বা’সা তুহুরুন ইন শা-আল্লা-হ)। “কোনো ক্ষতি নেই, আল্লাহ যদি চান তো (রোগটি গুনাহ থেকে) পবিত্রকারী হবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী (ফাতহুল বারীসহ) ১০/১১৮, নং ৩৬১৬। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَسْأَلُ اللَّهَ الْعَظيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفيَكَ (সাতবার) (আসআলুল্লা-হাল ‘আযীম, রব্বাল ‘আরশিল ‘আযীম, আঁই ইয়াশফিয়াকা)। (সাতবার) “আমি মহান আল্লাহ্‌র কাছে চাচ্ছি, যিনি মহান আরশের রব, তিনি যেন আপনাকে রোগমুক্তি প্রদান করেন।” (সাতবার)",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কেউ মৃত্যু আসন্ন নয় এমন কোনো রোগীকে দেখতে গেলে, সে তার সামনে এই দো‘আ সাতবার পাঠ করবে, এর ফলে আল্লাহ তাকে (মৃত্যু আসন্ন না হলে) রোগমুক্ত করবেন। এ দো‘আ সাতবার পড়বে। তিরমিযী, নং ২০৮৩; আবূ দাউদ, নং ৩১০৬। আরও দেখুন, ২/২১০; সহীহুল জামে‘ ৫/১৮০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৯. রোগী দেখতে গিয়ে তার জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, “যখন কোনো লোক তার মুসলিম ভাইকে দেখতে যায়, তখন সে না বসা পর্যন্ত যেন জান্নাতে ফল আহরণে বিচরণ করতে থাকে। অতঃপর যখন সে (রোগীর পাশে) বসে, (আল্লাহ্‌র) রহমত তাকে ঢেকে ফেলে। সময়টা যদি সকাল বেলা হয় তবে সত্তর হাজার ফেরেশতা তার জন্য ক্ষমা ও কল্যাণের দো‘আ করতে থাকে বিকাল হওয়া পর্যন্ত। আর যতি সময়টা বিকাল বেলা হয় তবে সত্তর হাজার ফেরেশতা তার জন্য রহমতের দো‘আ করতে থাকে সকাল হওয়া পর্যন্ত।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৯৬৯; ইবন মাজাহ্‌, নং ১৪৪২; আহমাদ, নং ৯৭৫। আরও দেখুন, সহীহ ইবন মাজাহ্ ১/২৪৪; সহীহুত তিরমিযী, ১/২৮৬। তাছাড়া শাইখ আহমাদ শাকেরও হাদীসটি বিশুদ্ধ বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫০. রোগী দেখতে যাওয়ার ফযীলত",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "ا للَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيقِ الْأَعْلَى (আল্লা-হুম্মাগফিরলী ওয়ারহামনী ওয়া আলহিক্বনী বির রফীক্বিল আ‘লা)। “হে আল্লাহ! আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন এবং আমাকে সর্বোচ্চ বন্ধুর সঙ্গ পাইয়ে দিন।” “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃত্যুর সময় তাঁর দু’হাত পানিতে প্রবেশ করিয়ে তা দিয়ে তাঁর চেহারা মুছছিলেন এবং বলছিলেন, لاَ إِلَهَ إِلاَّ اللَّهُ إِنَّ لِلْمَوْتِ سَكَرَاتٍ (লা ইলা-হা ইল্লাল্লা-হ, ইন্না লিল মাওতি সাকারা-তিন) “আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, নিশ্চয় মৃত্যুর রয়েছে বিভিন্ন প্রকার ভয়াবহ কষ্ট।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৭/১০, নং ৪৪৩৫; মুসলিম ৪/১৮৯৩, নং ২৪৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ لَهُ المُلْكُ وَلَهُ الْحَمْدُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ (লা ইলা-হা ইল্লাল্লা-হু, আল্লা-হু আকবার, লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু, লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, লা ইলা-হা ইল্লাল্লা-হু লাহুল মুলকু ওয়ালাহুল হামদু, লা ইলা-হা ইল্লাল্লা-হু ওয়ালা হাউলা ওয়ালা কুওয়াতা ইল্লা বিল্লা-হ) “আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, আল্লাহ মহান। একমাত্র আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই। একমাত্র আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, যাবতীয় রাজত্ব তাঁরই, তার জন্যই সকল প্রশংসা, আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই, আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ), ৮/১৪৪, নং ৪৪৪৯; তবে হাদীসে মিসওয়াকের উল্লেখও এসেছে। ",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫১. জীবনের আশা ছেড়ে দেওয়া রোগীর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যার শেষ কথা হবে- لاَ إِلَهَ إِلاَّ اللَّهُ. (লা ইলা-হা ইল্লাল্লা-হ) ‘আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই’— সে জান্নাতে প্রবেশ করবে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৩/১৯০, নং ৩১১৬; আরও দেখুন, সহীহুল জামে‘ ৫/৪৩২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫২. মরণাপন্ন ব্যক্তিকে তালক্বীন (কালেমা স্মরণ করিয়ে দেওয়া)",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرَاً مِنْهَا (ইন্না লিল্লা-হি ওয়া ইন্না ইলাইহি রাজি‘উন। আল্লা-হুম্মা আজুরনী ফী মুসীবাতী ওয়াখলুফ লী খাইরাম মিনহা)। “আমরা তো আল্লাহ্‌রই। আর নিশ্চয় আমরা তাঁর দিকেই প্রত্যাবর্তনকারী। হে আল্লাহ! আমাকে আমার বিপদে সওয়াব দিন এবং আমার জন্য তার চেয়েও উত্তম কিছু স্থলাভিষিক্ত করে দিন।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৬৩২, নং ৯১৮।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৩. কোনো মুসিবতে পতিত ব্যক্তির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لِفُلاَنٍ (بِاسْمِهِ) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ، وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ، وَافْسَحْ لَهُ فِي قَبْرِهِ، وَنَوِّرْ لَهُ فِيهِ (আল্লা-হুম্মাগফির লি ফুলা-নিন (মৃতের নাম বলবে) ওয়ারফা‘ দারাজাতাহু ফিল মাহদিয়্যীন, ওয়াখলুফহু ফী ‘আক্বিবিহী ফিল গা-বিরীন, ওয়াগফির লানা ওয়ালাহু ইয়া রব্বাল আ-লামীন। ওয়াফসাহ্‌ লাহু ফী ক্বাবরিহী ওয়া নাউইর লাহু ফী-হি)। “হে আল্লাহ! আপনি অমুককে (মৃত ব্যক্তির নাম ধরে) ক্ষমা করুন; যারা হেদায়াত লাভ করেছে, তাদের মাঝে তার মর্যাদা উঁচু করে দিন; যারা রয়ে গেছে তাদের মাঝে তার বংশধরদের ক্ষেত্রে আপনি তার প্রতিনিধি হোন। হে সৃষ্টিকুলের রব! আমাদের ও তার গুনাহ মাফ করে দিন। তার জন্য তার কবরকে প্রশস্ত করে দিন এবং তার জন্য তা আলোকময় করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৬৩৪, নং ৯২০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৪. মৃত ব্যক্তির চোখ বন্ধ করানোর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ [وَعَذَابِ النَّارِ] (আল্লা-হুম্মাগফির লাহু, ওয়ারহামহু, ওয়া ‘আ-ফিহি, ওয়া‘ফু ‘আনহু, ওয়া আকরিম নুযুলাহু, ওয়াওয়াসসি‘ মুদখালাহু, ওয়াগসিলহু বিলমা-য়ি ওয়াস্‌সালজি ওয়ালবারাদি, ওয়ানাক্বক্বিহি মিনাল খাতা-ইয়া কামা নাক্কাইতাস সাওবাল আবইয়াদা মিনাদদানাসি, ওয়া আবদিলহু দা-রান খাইরাম মিন দা-রিহি, ওয়া আহলান খাইরাম মিন আহলিহি, ওয়া যাওজান খাইরাম মিন যাওজিহি, ওয়া আদখিলহুল জান্নাতা, ওয়া আ‘য়িযহু মিন ‘আযা-বিল ক্বাবরি [ওয়া ‘আযাবিন্না-র])। “হে আল্লাহ! আপনি তাকে ক্ষমা করুন, তাকে দয়া করুন, তাকে পূর্ণ নিরাপত্তায় রাখুন, তাকে মাফ করে দিন, তার মেহমানদারীকে মর্যাদাপূর্ণ করুন, তার প্রবেশস্থান কবরকে প্রশস্ত করে দিন। আর আপনি তাকে ধৌত করুন পানি, বরফ ও শিলা দিয়ে, আপনি তাকে গুনাহ থেকে এমনভাবে পরিষ্কার করুন যেমন সাদা কাপড়কে ময়লা থেকে পরিষ্কার করেছেন। আর তাকে তার ঘরের পরিবর্তে উত্তম ঘর, তার পরিবারের বদলে উত্তম পরিবার ও তার জোড়ের (স্ত্রী/স্বামীর) চেয়ে উত্তম জোড় প্রদান করুন। আর আপনি তাকে জান্নাতে প্রবেশ করান এবং তাকে কবরের আযাব [ও জাহান্নামের আযাব] থেকে রক্ষা করুন”।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৬৬৩, নং ৯৬৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبيرِنَا، وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلاَمِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ، وَلاَ تُضِلَّنَا بَعْدَهُ (আল্লা-হুম্মাগফির লিহায়্যিনা ওয়া মায়্যিতিনা ওয়া শা-হিদিনা ওয়া গা-য়িবিনা ওয়া সগীরিনা ওয়া কাবীরিনা ওয়া যাকারিনা ওয়া উনসা-না। আল্লা-হুম্মা মান আহ্ইয়াইতাহু মিন্না ফা’আহয়িহি ‘আলাল-ইসলাম। ওয়ামান তাওয়াফ্‌ফাইতাহু মিন্না ফাতাওয়াফফাহু ‘আলাল ঈমান। আল্লা-হুম্মা লা তাহরিমনা আজরাহু ওয়ালা তুদ্বিল্লান্না বা‘দাহু)। “হে আল্লাহ! আমাদের জীবিত ও মৃত, উপস্থিত ও অনুপস্থিত, ছোট ও বড় এবং নর ও নারীদেরকে ক্ষমা করুন। হে আল্লাহ! আপনি আমাদের মধ্যে যাদের আপনি জীবিত রাখবেন তাদেরকে ইসলামের উপর জীবিত রাখুন এবং যাদেরকে মৃত্যু দান করবেন তাদেরকে ঈমানের সাথে মৃত্যু দান করুন। হে আল্লাহ! আমাদেরকে তার (মৃত্যুতে ধৈয্যধারণের) সওয়াব থেকে বঞ্চিত করবেন না এবং তার (মৃত্যুর) পর আমাদেরকে পথভ্রষ্ট করবেন না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাঊদ, নং ৩২০১; তিরমিযী, নং ১০২৪; নাসাঈ, নং ১৯৮৫; ইবন মাজাহ, ১/৪৮০, নং ১৪৯৮; আহমাদ ২/৩৬৮, নং ৮৮০৯। আরও দেখুন, সহীহ ইবন মাজাহ্‌ ১/২৫১।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ، وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الغَفُورُ الرَّحيمُ (আল্লা-হুম্মা ইন্না ফুলানাবনা ফুলা-নিন ফী যিম্মাতিকা, ওয়া হাবলি জিওয়ারিকা, ফাক্বিহি মিন ফিতনাতিল ক্বাবরি ওয়া আযা-বিন না-রি, ওয়া আনতা আহলুল ওয়াফাই ওয়াল হাক্ক, ফাগফির লাহু ওয়ারহামহু, ইন্নাকা আনতাল গাফুরুর রাহীম)। “হে আল্লাহ, অমুকের পুত্র অমুক আপনার যিম্মাদারীতে, আপনার প্রতিবেশিত্বের নিরাপত্তায়; সুতরাং আপনি তাকে কবরের পরীক্ষা থেকে এবং জাহান্নামের শাস্তি থেকে রক্ষা করুন। আর আপনি প্রতিশ্রুতি পূর্ণকারী এবং প্রকৃত সত্যের অধিকারী। অতএব, আপনি তাকে ক্ষমা করুন এবং তার উপর দয়া করুন। নিশ্চয় আপনি ক্ষমাশীল, দয়ালু।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "ইবন মাজাহ্‌, নং ১৪৯৯। দেখুন, সহীহ ইবন মাজাহ ১/২৫১। তাছাড়া হাদীসটি আবূ দাউদও বর্ণনা করেছেন, ৩/২১১, নং ৩২০২।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْهُ (আল্লা-হুম্মা ‘আবদুকা, ওয়াবনু আমাতিকা, এহতাজা ইলা রাহমাতিকা, ওয়া আনতা গানিয়্যুন ‘আন ‘আযা-বিহি, ইন কা-না মুহসিনান ফাযিদ ফী হাসানা-তিহি, ওয়া ইনকা-না মুসীআন ফা তাজা-ওয়ায ‘আনহু) “হে আল্লাহ, আপনার এক দাস, আর এক দাসীর পুত্র, আপনার অনুগ্রহের মুখাপেক্ষী, আপনি তাকে শাস্তি দেওয়া থেকে অমুখাপেক্ষী। যদি সে নেককার বান্দা হয়, তবে তার সওয়াব আরও বাড়িয়ে দিন, আর যদি বদকার বান্দা হয়, তবে তার অপরাধকর্ম এড়িয়ে যান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলণ করেন, হাকেম তাঁর মুস্তাদরাকে এবং সহীহ বলেছেন, ১/৩৫৯; আর যাহাবী সেটা সমর্থন করেছেন। আরও দেখুন, আলবানী, আহকামুল জানায়েয, পৃ. ১২৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৫. মৃত ব্যক্তির জন্য জানাযার সালাতে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "إِنَّ للَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّى... فَلْتَصْبِرْ وَلْتَحْتَسِبْ. (ইন্না লিল্লা-হি মা আখাযা, ওয়ালাহু মা আ‘তা, ওয়া কুল্লু শাই’ইন ‘ইনদাহু বিআজালিম মুসাম্মা, ফালতাসবির ওয়াল তাহতাসিব) “নিশ্চয় যা নিয়ে গেছেন আল্লাহ্‌ তা তাঁরই, আর যা কিছু প্রদান করেছেন তাও তাঁর। তাঁর কাছে সব কিছুর একটি নির্দিষ্ট সময় রয়েছে। কাজেই সবর করা এবং সওয়াবের আশা করা উচিৎ।” আর নিম্নোক্ত দো‘আটি পড়াও ভালো:",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, ২/৮০, নং ১২৮৪; মুসলিম, ২/৬৩৬, নং ৯২৩।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعْظَمَ اللَّهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتِكَ. (আ‘যামাল্লাহু আজরাকা, ওয়া আহসানা ‘আযা-’আকা, ওয়াগাফারা লিমাইয়্যিতিকা) “আল্লাহ আপনার সওয়াব বর্ধিত করুন, আপনার (শোকার্ত মনে) সুন্দর ধৈর্য ধরার তাওফীক দিন, আর আপনার মৃতকে ক্ষমা করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আল-আযকার লিন নাওয়াওয়ী, পৃ. ১২৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৭. শোকার্তদের সান্ত্বনা দেওয়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ (বিসমিল্লা-হি ওয়া আলা সুন্নাতি রাসুলিল্লা-হি)। “আল্লাহর নামে এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিয়মে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ৩/৩১৪, নং ৩২১৫ সহীহ সনদে; অনুরূপভাবে আহমাদ, নং ৫২৩৪; আর ৪৮১২ এর শব্দ হচ্ছে, ‘বিসমিল্লাহ ওয়া আলা মিল্লাতি রাসূলিল্লাহ’ অর্থাৎ ‘আল্লাহর নামে এবং রাসূলুল্লাহর মিল্লাতের উপর।’ তার সনদও বিশুদ্ধ।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৮. মৃতকে কবরে প্রবেশ করানোর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ (আল্লা-হুম্মাগফির লাহু, আল্লা-হুম্মা সাববিতহু)। “হে আল্লাহ! আপনি তাকে ক্ষমা করুন, হে আল্লাহ্‌ আপনি তাকে (প্রশ্নোত্তরের সময়) স্থির রাখুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃত ব্যক্তিকে দাফন করার পর কবরের পাশে দাঁড়াতেন এবং বলতেন, ‘তোমাদের ভাইয়ের জন্য ক্ষমা প্রার্থনা কর, আর তার জন্য দৃঢ়তা চাও। কেননা এখনই তাকে জিজ্ঞাসা করা হবে’। আবু্দাউদ ৩/৩১৫, নং ৩২২৩; হাকেম এবং তিনি একে সহীহ বলেছেন, আর যাহাবী সমর্থন করেছেন, ১/৩৭০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৫৯. মৃতকে দাফন করার পর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، [وَيَرْحَمُ اللَّهُ الْمُسْتَقدِمِينَ مِنَّا وَالْمُسْتأْخِرِينَ] أَسْاَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ (আস্‌সালা-মু আলাইকুম আহলাদ্দিয়ারি মিনাল মু’মিনীনা ওয়াল মুসলিমীনা, ওয়াইন্না ইনশা-আল্লা-হু বিকুম লা-হিকুনা, ওয়া ইয়ারহামুল্লাহুল মুসতাক্বদিমীনা মিন্না ওয়াল মুসতা’খিরীনা, নাসআলুল্লাহা লানা ওয়ালাকুমুল ‘আ-ফিয়াহ)। “হে গৃহসমূহের অধিবাসী মুমিন ও মুসলিমগণ! তোমাদের প্রতি শান্তি বর্ষিত হোক। আর নিশ্চয় আমরা ইনশাআল্লাহ আপনাদের সাথে মিলিত হবো। [আল্লাহ আমাদের পুর্ববর্তীদের এবং পরবর্তীদের প্রতি দয়া করুন।] আমি আল্লাহ্‌র নিকট আমাদের জন্য এবং তোমাদের জন্য নিরাপত্তা প্রার্থনা করি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৬৭১, নং ৯৭৫; ইবন মাজাহ্‌, ১/৪৯৪, আর শব্দ তাঁরই, নং ১৫৪৭; বুরাইদা রাদিয়াল্লাহু ‘আনহু থেকে। আর দু ব্রাকেটের মাঝখানের অংশ আয়েশা রাদিয়াল্লাহু আনহার হাদীস থেকে, যা সংকলন করেছেন, মুসলিম, ২/৬৭১, নং ৯৭৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৬০. কবর যিয়ারতের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“আপনার দেহের যে স্থানে আপনি ব্যথা অনুভব করছেন, সেখানে আপনার হাত রেখে তিনবার বলুন, بِسْمِ اللَّهِ (বিসমিল্লাহ) “আল্লাহর নামে।” আর সাতবার বলুন, أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (আ‘ঊযু বিল্লা-হি ওয়া ক্বুদরাতিহী মিন শাররি মা আজিদু ওয়া উহা-যিরু)। “এই যে ব্যথা আমি অনুভব করছি এবং যার আমি আশঙ্কা করছি, তা থেকে আমি আল্লাহ্‌র এবং তাঁর কুদরতের আশ্রয় প্রার্থনা করছি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ৪/১৭২৮, নং ২২০২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৪. শরীরে কোনো ব্যথা অনুভব করলে যা করবে ও বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ! (লা ইলা-হা ইল্লাল্লা-হ !) “আল্লাহ ব্যতীত কোনো হক্ব উপাস্য নেই!”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/৩৮১, নং ৩৩৪৬; মুসলিম ৪/২২০৮, নং ২৮৮০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৬. ভীত অবস্থায় যা বলবে",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "বিবাহ ও দাম্পত্য বিষয়াবলী",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بَارَكَ اللَّهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَشَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ (বা-রাকাল্লা-হু লাকা ফিল মাউহুবি লাক, ওয়া শাকারতাল ওয়া-হিবা, ওয়া বালাগা আশুদ্দাহু, ওয়া রুযিক্তা বিররাহু)। “আল্লাহ আপনাকে যা দিয়েছেন তাতে আপনার জন্য বরকত দান করুন, সন্তান দানকারীর শুকরিয়া আদায় করুন, সন্তানটি পরিপূর্ণ বয়সে পদার্পণ করুক এবং তার সদ্ব্যবহার প্রাপ্ত হোন।” অভিনন্দনের জবাবে বলবে",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "এটি হাসান বসরী রাহিমাহুল্লাহর বাণী হিসেবে উল্লেখিত হয়েছে। দেখুন, তুহফাতুল মাওদূদ লি ইবনিল কাইয়্যেম, পৃ. ২০; তিনি একে ইবনুল মুনযির এর আল-আওসাত্ব গ্রন্থের দিকে সম্পর্কযুক্ত করেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ، وَجَزَاكَ اللَّهُ خَيْراً، وَرَزَقَكَ اللَّهُ مِثْلَهُ، وَأَجْزَلَ ثَوَابَكَ (বা-রাকাল্লা-হু লাকা ওয়া বা-রাকা ‘আলাইকা, ওয়া জাযা-কাল্লা-হু খাইরান, ওয়া রাযাক্বাকাল্লা-হু মিসলাহু ওয়া আজযালা সাওয়া-বাকা)। “আল্লাহ আপনাকে বরকত দান করুন, আর আপনার উপর বরকত নাযিল করুন। আল্লাহ আপনাকে উত্তম প্রতিদান দিন, আর আপনাকেও অনুরূপ দান করুন এবং আপনার সওয়াব বহুগুণ বৃদ্ধি করুন।”.",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "এটি ইমাম নাওয়াবী তার আল-আযকার গ্রন্থে পৃ. ৩৪৯ উল্লেখ করেছেন। আরও দেখুন, সহীহুল আযকার লিন নাওয়াবী, সলীম আল-হিলালী, ২/৭১৩। আর এর বিস্তারিত তাখরীজ দেখার জন্য গ্রন্থকারের ‘আয-যিকর ওয়াদ দো‘আ ওয়াল ‘ইলাজ বির রুকা’ গ্রন্থটি দেখুন, পৃ. ১/৪১৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৭. সন্তান লাভকারীকে অভিনন্দন ও তার জবাব",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসান ও হুসাইন রাদিয়াল্লাহু ‘আনহুমা-এর জন্য এই বলে (আল্লাহ্‌র) আশ্রয় প্রার্থনা করতেন- أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ (উ‘ইযুকুমা বিকালিমা-তিল্লা-হিত তা-ম্মাতি মিন কুল্লি শাইতানিওঁয়া হা-ম্মাহ্‌, ওয়ামিন কুল্লি আইনিল্লা-ম্মাহ্‌)। “আমি তোমাদের দু’জনকে আল্লাহ্‌র পরিপূর্ণ কালেমাসমূহের আশ্রয়ে নিচ্ছি যাবতীয় শয়তান ও বিষধর জন্তু থেকে এবং যাবতীয় ক্ষতিকর চক্ষু (বদনযর) থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৪/১১৯, নং ৩৩৭১; ইবন আব্বাস রাদিয়াল্লাহু আনহুমার হাদীস থেকে।3",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৮. যা দ্বারা শিশুদের জন্য আশ্রয় প্রার্থনা করা হয়",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ (বা-রাকাল্লা-হু লাকা ওয়াবা-রাকা ‘আলাইকা ওয়া জামা‘আ বাইনাকুমা ফী খাইরিন্)। “আল্লাহ আপনার জন্য বরকতদান করুন, আপনার উপর বরকত নাযিল করুন এবং কল্যাণের সাথে আপনাদের উভয়কে একত্রিত করুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি নাসাঈ ব্যতীত সকল সুনানগ্রন্থকারগণই সংকলন করেছেন। আবু দাঊদ, নং ২১৩০; তিরমিযী, নং ১০৯১; ইবন মাজাহ, নং ১৯০৫; নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ২৫৯। আরও দেখুন, সহীহুত তিরমিযী ১/৩১৬।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৭৯. নব বিবাহিতের জন্য দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যখন তোমাদের কেউ কোনো মেয়েকে বিয়ে করে, অথবা কোনো খাদেম গ্রহণ করে, তখন যেন সে বলে, اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ، وَإِذَا اشْتَرَى بَعِيراً فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ (আল্লা-হুম্মা ইন্নি আসআলুকা খাইরাহা ওয়া খাইরা মা জাবালতাহা ‘আলাইহি, ওয়া আ‘ঊযু বিকা মিন শাররিহা ওয়া শাররি মা জাবালতাহা ‘আলাইহি) “হে আল্লাহ, আমি এর যত কল্যাণ রয়েছে এবং যত কল্যাণ তার স্বভাবে আপনি দিয়েছেন তা চাই। আর এর যত অকল্যাণ রয়েছে এবং যত অকল্যাণ ওর স্বভাব-চরিত্রে আপনি রেখেছেন তা থেকে আপনার আশ্রয় চাই।” “আর যখন কোনো উট তথা বাহন খরিদ করে, তখন যেন সে তার কুঁজের সর্বোচ্চ স্থানে হাত রাখে এবং অনুরূপ বলে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবু দাঊদ-২/২৪৮, নং ২১৬০; ইবন মাজাহ্‌ ১/৬১৭, নং ১৯১৮। আরও দেখুন, সহীহ ইবন মাজাহ, ১/৩২৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮০. বিবাহিত ব্যক্তির দো‘আ এবং বাহন ক্রয়ের পর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا (বিসমিল্লাহি আল্লা-হুম্মা জান্নিবনাশ্-শাইত্বানা ওয়া জান্নিবিশ্-শাইত্বানা মা রযাকতানা)। “আল্লাহ্‌র নামে। হে আল্লাহ! আপনি আমাদের থেকে শয়তানকে দূরে রাখুন এবং আমাদেরকে আপনি যে সন্তান দান করবেন তার থেকেও শয়তানকে দূরে রাখুন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী ৬/১৪১, নং ১৪১; মুসলিম ২/১০২৮, নং ১৪৩৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৮১. স্ত্রী-সহবাসের পুর্বের দো‘আ",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "ঈমান সুরক্ষা",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "আল্লাহ্‌র কাছে আশ্রয় প্রার্থনা করবে (‘আঊযু বিল্লা-হ’ বলবে)। যে সন্দেহে নিপতিত হয়েছে তা দূর করবে।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/৩৩৬, নং ৩২৭৬; মুসলিম ১/১২০, নং ১৩৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "বলবে, آمَنْتُ بِاللَّهِ وَرُسُلِهِ (আ-মানতু বিল্লা-হি ওয়া রুসুলিহি) “আমি আল্লাহ ও তাঁর রাসূলগণের উপর ঈমান আনলাম।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/৩৩৬, নং ৩২৭৬; মুসলিম ১/১২০, ১৩৪।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "আল্লাহ্‌ তা‘আলার নিম্নোক্ত বাণী পড়বে, « ﴿هُوَ الْأوَّلُ وَالْآخِرُ وَالظّاهِرُ وَالْباطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴾ (হুয়াল আউওয়ালু ওয়াল আ-খিরু ওয়ায্যা-হিরু ওয়াল-বা-ত্বিনু ওয়া হুয়া বিকুল্লি শাই’ইন ‘আলীম)। “তিনিই সর্বপ্রথম, তিনিই সর্বশেষ, তিনিই সকলের উপরে, তিনিই সকলের নিকটে এবং তিনি সব কিছু সম্পর্কে সর্বজ্ঞ।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/১১৯-১২০, নং ১৩৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪০. ঈমানের মধ্যে সন্দেহে পতিত ব্যক্তির দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যদি কোনো বান্দা কোনো পাপ কাজ করে ফেলে, অতঃপর সে উত্তমরূপে পবিত্রতা অর্জন করে এবং দাঁড়িয়ে যায় ও দু রাক‘আত সালাত আদায় করে, তারপর আল্লাহ্‌র কাছে ক্ষমা প্রার্থনা করে, তাহলে আল্লাহ তাকে ক্ষমা করে দেবেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ২/৮৬, ১৫২১; তিরমিযী ২/২৫৭, নং ৪০৬; আর শাইখ আলবানী সহীহ আবি দাউদে ১/২৮৩ একে সহীহ বলে মত প্রকাশ করেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৪. পাপ করে ফেললে যা বলবে এবং যা করবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "‘তার থেকে আল্লাহ্‌র নিকট আশ্রয় প্রার্থনা করবে’ (অর্থাৎ ‘আ‘ঊযু বিল্লাহ’ পড়বে)।",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ ১/২০৩, ইবন মাজাহ্‌ ১/২৬৫, নং ৮০৭। আর পূর্বে ৩১ নং হাদীসে এর তাখরীজ চলে গেছে। আরও দেখুন, সূরা আল-মুমিনূন এর ৯৭-৯৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "‘আযান দিবে।’",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ১/২৯১; নং ৩৮৯; বুখারী, ১/১৫১, নং ৬০৮।",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "‘যিক্‌র করবে এবং কুরআন পড়বে।’",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, “তোমরা তোমাদের ঘরসমূহ কবরে পরিণত করুন না। নিশ্চয় শয়তান ঐ ঘর থেকে পলায়ন করে যেখানে সূরা বাকারাহ্‌ পাঠ করা হয়।” মুসলিম ১/৫৩৯, হাদীস নং ৭৮০। তাছাড়া আরও যা শয়তানকে তাড়িয়ে দেয় তা হচ্ছে, সকাল বিকালের যিক্‌রসমূহ, ঘুমের যিক্‌র, জাগ্রত হওয়ার যিক্‌র, ঘরে প্রবেশের ও ঘর থেকে বের হওয়ার যিক্‌রসমূহ, মসজিদে প্রবেশের ও মসজিদ থেকে বের হওয়ার যিক্‌রসমূহ, ইত্যাদী শরী‘আতসম্মত যিক্‌রসমূহ। যেমন, ঘুমের সময় আয়াতুল কুরসী, সূরা আল-বাকারার সর্বশেষ দু’টি আয়াত। তাছাড়া যে ব্যক্তি “লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়াহুয়া ‘আলা কুল্লি শাইয়িন কাদীর” একশতবার পড়বে, সেটা তার জন্য সে দিনটির জন্য পুরোপুরিই হেফাযতের কাজ দিবে। তদ্রুপ আযান দিলেও শয়তান পলায়ন করে।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৪৫. শয়তান ও তার কুমন্ত্রণা দূর করার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "ا للَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ (আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা আন উশরিকা বিকা ওয়া ‘আনা আ‘লামু ওয়া আস্তাগফিরুকা লিমা লা আ‘লামু)। “হে আল্লাহ! আমি জ্ঞাতসারে আপনার সাথে শির্ক করা থেকে আপনার নিকট আশ্রয় চাই এবং অজ্ঞতাসারে (শির্ক) হয়ে গেলে তার জন্য ক্ষমা চাই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ৪/৪০৩, নং ১৯৬০৬; ইমাম বুখারীর আল-আদাবুল মুফরাদ, নং ৭১৬। আরও দেখুন, সহীহ আল জামে ৩/২৩৩; সহীহুত তারগীব ওয়াত তারহীব লিল আলবানী, ১/১৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯২. শির্কের ভয়ে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যখন তোমাদের কেউ তার ভাইয়ের, অথবা নিজের কোনো বিষয়ে, অথবা নিজের কোনো সম্পদে এমন কিছু দেখে যা তাকে চমৎকৃত করে, [তখন সে যেন সেটার জন্য বরকতের দো‘আ করে;] কারণ, চোখ লাগার (বদ নজরের) বিষয়টি সত্য।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসনাদে আহমাদ ৪/৪৪৭, নং ১৫৭০০; ইবন মাজাহ্, নং ৩৫০৮; মালেক ৩/১১৮-১১৯। আর শাইখুল আলবানী, সহীহুল জামে‘ গ্রন্থে সহীহ বলেছেন, ১/২১২; আরও দেখুন, আরনাঊতের এর যাদুল মা‘আদ এর তাহকীক ৪/১৭০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৫. কোনো কিছুর উপর নিজের চোখ লাগার ভয় থাকলে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ: مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلاَّ طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ (আ‘ঊযু বিকালিমা-তিল্লা-হিত্-তা-ম্মা-তিল্লাতী লা ইয়ুজাউইযুহুন্না বাররুন ওয়ালা ফা-জিরুম মিন শাররি মা খালাক্বা, ওয়া বারা’আ, ওয়া যারা’আ, ওয়ামিন শাররি মা ইয়ানযিলু মিনাস্ সামা-য়ি, ওয়ামিন শাররি মা যারাআ ফিল আরদ্বি, ওয়ামিন শাররি মা ইয়াখরুজু মিনহা, ওয়ামিন শাররি ফিতানিল-লাইলি ওয়ান-নাহা-রি, ওয়ামিন শাররি কুল্লি ত্বা-রিকিন ইল্লা ত্বা-রিকান ইয়াত্বরুকু বিখাইরিন, ইয়া রহ্‌মানু)। “আমি আল্লাহ্‌র ঐ সকল পরিপূর্ণ বাণীসমূহের সাহায্যে আশ্রয় চাই যা কোনো সৎলোক বা অসৎলোক অতিক্রম করতে পারে না— আল্লাহ যা সৃষ্টি করেছেন, অস্তিত্বে এনেছেন এবং তৈরি করেছেন তার অনিষ্ট থেকে, আসমান থেকে যা নেমে আসে তার অনিষ্ট থেকে, যা আকাশে উঠে তার অনিষ্ট থেকে, যা পৃথিবীতে তিনি সৃষ্টি করেছেন তার অনিষ্ট থেকে, যা পৃথিবী থেকে বেরিয়ে আসে তার অনিষ্ট থেকে, দিনে-রাতে সংঘটিত ফেতনার অনিষ্ট থেকে, আর রাত্রিবেলা হঠাৎ করে আগত অনিষ্ট থেকে, তবে রাতে আগত যে বিষয় কল্যাণ নিয়ে আসে তা ব্যতীত; হে দয়াময়!”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ৩/৪১৯, নং ১৫৪৬১, সহীহ সনদে। আর ইবনুস সুন্নী, নং ৬৩৭; আরনাঊত তার ত্বাহাভীয়ার তাখরীজে এর সনদকে বিশুদ্ধ বলেছেন, পৃ.১৩৩। আরও দেখুন, মাজমা‘উয যাওয়ায়েদ ১০/১২৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১২৮. দুষ্ট শয়তানদের ষড়যন্ত্র প্রতিহত করতে যা বলবে",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "চলাচল, সফর [ভ্রমন]",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ، وَالْحَمْدُ للَّهِ ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ (বিস্‌মিল্লা-হি, আলহাম্‌দু লিল্লা-হি, সুব্‌হা-নাল্লাযী সাখখারা লানা হা-যা ওয়ামা কুন্না লাহু মুক্বরিনীন। ওয়া ইন্না ইলা রব্বিনা লামুনক্বালিবূন, আলহামদুলিল্লা-হ, আলহামদুলিল্লা-হ, আলহামদুলিল্লা-হ, আল্লা-হু আকবার, আল্লা-হু আকবার, আল্লা-হু আকবার, সুবহা-নাকাল্লা-হুম্মা ইন্নী যালামতু নাফসী ফাগফির লী। ফাইন্নাহু লা ইয়াগফিরুয্যুনূবা ইল্লা আনতা)। “আল্লাহ্‌র নামে; আর সকল প্রশংসা আল্লাহ্‌র জন্য। পবিত্র মহান সেই সত্তা, যিনি একে আমাদের জন্য বশীভূত করে দিয়েছেন, অন্যথায় আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই প্রত্যাবর্তন করবো আমাদের রব্বের দিকে। সকল প্রশংসা আল্লাহ্‌র জন্য, সকল প্রশংসা আল্লাহ্‌র জন্য, সকল প্রশংসা আল্লাহ্‌র জন্য। আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়। হে আল্লাহ! আপনি পবিত্র-মহান; আমি আমার নিজের উপর যুলুম করেছি, সুতরাং আপনি আমাকে মাফ করে দিন। কেননা, আপনি ছাড়া গুনাহ মাফ করার আর কেউ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবু দাঊদ ৩/৩৪, ২৬০২; তিরমিযী ৫/৫০১, নং ৩৪৪৬। আরও দেখুন, সহীহুত তিরমিযী ৩/১৫৬। আর আয়াত দু’টি হচ্ছে, সূরা আয-যুখরুফের ১৩-১৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৫. বাহনে আরোহণের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾ «اللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَليفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ» (আল্লা-হু আকবার আল্লা-হু আকবার আল্লা-হু আকবার। সুব্‌হা-নাল্লাযী সাখখারা লানা হা-যা ওয়ামা কুন্না লাহু মুক্বরিনীনা। ওয়া ইন্না ইলা রব্বিনা লামুনক্বালিবূন। আল্লা-হুম্মা ইন্না নাস’আলুকা ফী সাফারিনা হা-যাল-বিররা ওয়াত্তাকওয়া, ওয়ামিনাল ‘আমালি মা তারদ্বা। আল্লা-হুম্মা হাউইন ‘আলাইনা সাফারানা হা-যা ওয়াতউই ‘আন্না বু‘দাহু। আল্লা-হুম্মা আনতাস সা-হিবু ফিস সাফারি ওয়াল-খালীফাতু ফিল আহ্‌লি। আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা মিন ওয়া‘আসা-ইস্ সাফারি ওয়া কা’আবাতিল মানযারি ওয়া সূ-ইল মুনক্বালাবি ফিল মা-লি ওয়াল আহল)। “আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়। পবিত্র মহান সেই সত্তা, যিনি আমাদের জন্য একে বশীভূত করে দিয়েছেন, অন্যথায় আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই আমাদের রব্বের নিকট প্রত্যাবর্তন করব। হে আল্লাহ! আমরা এই সফরে আপনার কাছে চাই পূণ্য ও তাকওয়া এবং এমন কাজ যা আপনি পছন্দ করেন। হে আল্লাহ! আমাদের জন্য এই সফরকে সহজ করে দিন এবং এর দুরত্বকে আমাদের জন্য কমিয়ে দিন। হে আল্লাহ্! আপনিই সফরে আমাদের সাথী এবং আমাদের পরিবার-পরিজনের তত্ত্বাবধায়ণকারী। হে আল্লাহ! আমরা আপনার আশ্রয় প্রার্থনা করি সফরের কষ্ট-ক্লেশ থেকে, অবাঞ্ছিত অবস্থার দৃশ্য থেকে এবং সম্পদ ও পরিবারে অনিষ্টকর প্রত্যাবর্তন থেকে।” আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফর থেকে ফেরার সময়ও তা পড়তেন এবং তাতে যোগ করতেন, «آيِبُونَ، تائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ». (আ-ইবূনা তা-ইবূনা ‘আ-বিদূনা, লিরব্বিনা হা-মিদূন)। “আমরা প্রত্যাবর্তনকারী, তওবাকারী, ইবাদতকারী এবং আমাদের রব্বের প্রশংসাকারী।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম ২/৯৭৮, হাদীস নং ১৩৪২।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৬. সফরের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّياطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ، وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا (আল্লা-হুম্মা রব্বাস্ সামা-ওয়া-তিস্ সাব‘ঈ ওয়ামা আযলালনা, ওয়ারব্বাল আরাদ্বীনাস সাব‘ঈ ওয়ামা আক্বলালনা, ওয়া রব্বাশ শাইয়া-তী-নি ওয়ামা আদ্বলালনা, ওয়া রব্বাররিয়া-হি ওয়ামা যারাইনা, আস’আলুকা খাইরা হা-যিহিল কারইয়াতি ওয়া খাইরা আহলিহা ওয়া খাইরা মা ফীহা। ওয়া আ‘ঊযু বিকা মিন শাররিহা ওয়া শাররি আহলিহা ওয়া শাররি মা ফীহা)। “হে আল্লাহ! সাত আসমান এবং তা যা কিছু ছায়া দিয়ে রেখেছে তার রব্ব! সাত যমীন এবং তা যা ধারণ করে রেখেছে তার রব্ব! শয়তানদের এবং ওদের দ্বারা পথভ্রষ্টদের রব্ব! বাতাসসমূহ এবং তা যা উড়িয়ে নেয় তার রব্ব! আমি আপনার নিকট চাই এ জনপদের কল্যাণ, এ জনপদবাসীর কল্যাণ এবং এর মাঝে যা আছে তার কল্যাণ। আর আমি আপনার নিকট আশ্রয় চাই এ জনপদের অনিষ্ট থেকে, তাতে বসবাসকারীদের অনিষ্ট থেকে এবং এর মাঝে যা আছে তার অনিষ্ট থেকে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাকেম, আর তিনি একে সহীহ বলেছেন এবং ইমাম যাহাবী সেটা সমর্থন করেছেন ২/১০০; ইবনুস সুন্নী, নং ৫২৪। তাছাড়া হাফেয ইবন হাজার তাঁর তাখরীজুল আযকার ৫/১৫৪, একে হাসান বলেছেন। আল্লামা ইবন বায রাহেমাহুল্লাহ বলেন, ‘হাদীসটি নাসাঈ হাসান সনদে বর্ণনা করেছেন।’ দেখুন, তুহফাতুল আখইয়ার, পৃ. ৩৭।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৭. গ্রাম বা শহরে প্রবেশের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لاِ يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্‌দাহু লা শারীকালাহু লাহুল-মুলকু ওয়ালাহুল হামদু ইয়ুহঈ ওয়াইয়ুমীতু ওয়াহুয়া হায়্যুন লা ইয়ামূতু বিয়াদিহিল খাইরু ওয়া হুওয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর)। “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরিক নেই, রাজত্ব তাঁরই, প্রশংসা মাত্রই তাঁর। তিনিই জীবন দান করেন এবং তিনিই মারেন। আর তিনি চিরঞ্জীব, মারা যাবেন না। সকল প্রকার কল্যাণ তাঁর হাতে নিহিত। তিনি সব কিছুর উপর ক্ষমতাবান।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৩৪২৮; ইবন মাজাহ, ৫/২৯১, নং ৩৮৬০; হাকেম ১/৫৩৮। আর শাইখ আলবানী হাদীসটিকে সহীহ ইবন মাজাহ্‌ ২/২১; সহীহুত তিরমিযী, ৩/১৫২ হাসান হাদীস বলেছেন।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৮.বাজারে প্রবেশের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "بِسْمِ اللَّهِ (বিসমিল্লা-হ) “আল্লাহ্‌র নামে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আবূ দাউদ, ৪/২৯৬, নং ৪৯৮২। আর শাইখ আলবানী একে সহীহ বলেছেন, সহীহ আবি দাউদে, ৩/৯৪১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৯. বাহন হোঁচট খেলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَسْتَوْدِعُكُمُ اللَّهَ الَّذِي لاَ تَضِيعُ وَدَائِعُهُ (আস্তাউদি‘উ কুমুল্লা-হাল্লাযী লা তাদ্বী‘উ ওয়াদা-ই‘উহু)। “আমি তোমাদেরকে আল্লাহ্‌র হেফাযতে রেখে যাচ্ছি, যাঁর কাছে রাখা আমানতসমূহ কখনও বিনষ্ট হয় না।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ২/৪০৩, নং ৯২৩০; ইবন মাজাহ্‌, ২/৯৪৩, নং ২৮২৫। আরও দেখুন, সহীহ ইবন মাজাহ্‌ ২/১৩৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০০. মুক্বীম বা অবস্থানকারীদের জন্য মুসাফিরের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَسْتَوْدِعُ اللَّهَ دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ (আস্তাউদি‘উল্লা-হা দ্বীনাকা ওয়া আমা-নাতাকা ওয়া খাওয়া-তীমা ‘আমালিকা)। “আমি আপনার দ্বীন, আপনার আমানত (পরিবার-পরিজন ও ধন-সম্পদ) এবং আপনার সর্বশেষ আমলকে আল্লাহ্‌র হেফাযতে রাখছি।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ২/৭, ৪৫২৪, তিরমিযী ৫/৪৯৯, নং ৩৪৪৩। আর শাইখ আলবানী একে সহীহু সুনানিত তিরমিযীতে ৩/৪১৯ সহীহ হাদীস বলেছেন। ",
                        "ref-in-english": "",
                        "source": ""
                    },
                    {
                        "audio-url": "",
                        "details-in-bangla": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُ ما كُنْتَ (যাওয়াদাকাল্লাহুত তাক্বওয়া, ওয়াগাফারা যানবাকা, ওয়া ইয়াসসারা লাকাল খাইরা হাইসু মা কুনতা)। “আল্লাহ আপনাকে তাকওয়ার পাথেয় প্রদান করুন, আপনার গুনাহ ক্ষমা করুন, আর যেখানেই থাকুন না কেন আপনার জন্য কল্যাণকে সহজ করে দিন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "তিরমিযী, নং ৩৪৪৪; আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৫।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০১. মুসাফিরের জন্য মুক্বীম বা অবস্থানকারীর দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "‘জাবের রাদিয়াল্লাহু ‘আনহু বলেন, “আমরা যখন উঁচুতে আরোহণ করতাম তখন ‘আল্লাহু আকবার’ বলতাম, আর যখন নীচের দিকে নামতাম তখন ‘সুবহানাল্লাহ’ বলতাম।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী, (ফাতহুল বারীসহ) ৬/১৩৫, নং ২৯৯৩।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০২. সফরে চলার সময় তাকবীর ও তাসবীহ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ، وَحُسْنِ بَلاَئِهِ عَلَيْنَا، رَبَّنَا صاحِبْنَا، وَأَفْضِلْ عَلَيْنَا، عَائِذاً بِاللَّهِ مِنَ النَّارِ (সাম্মা‘আ সা-মি‘উন বিহামদিল্লা-হ, ওয়া হুসনি বালা-ইহী ‘আলাইনা, রাব্বানা সা-হিবনা, ওয়া আফদিল ‘আলাইনা, ‘আ-ইযান বিল্লা-হি মিনান না-রী) “আমরা যে আল্লাহ্‌র প্রশংসা করলাম, আর আমাদের উপর তাঁর উত্তম নেয়ামতের ঘোষণা দিলাম, তা একজন শ্রোতা আমার এ কথা শুনে অন্যের কাছে পৌঁছে দিক। হে আমাদের রব! আপনি আমাদের সাথী হোন, আর আমাদের উপর অনুগ্রহ বর্ষণ করুন। আগুন থেকে আল্লাহ্‌র কাছে আশ্রয়প্রার্থী হয়ে (এ দো‘আ করছি)।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২০৮৬, নং ২৭১৮। আর হাদীসে ব্যবহৃত سَمِعَ سامِعٌ শব্দের অর্থ, ‘একজন সাক্ষ্যদাতা সাক্ষ্য প্রদান করুন যে, আমরা আল্লাহর প্রশংসা করেছি তার যাবতীয় নেয়ামতের উপর, তাঁর উত্তম দান-দয়ার উপর।’ আর যদি হাদীসে ব্যবহৃত শব্দটিকে سَمَّعَ سامِعٌ ধরা হয়, তখন অর্থ হবে, ‘একজন শ্রোতা আমার এ কথা শুনে তা অন্যের কাছে পৌঁছে দিক।’ আর এ-কথাটি তিনি বলেছেন শেষ রাত্রির দো‘আ ও যিকর সম্পর্কে সচেতন করার জন্য। শারহুন নাওয়াওয়ী ‘আলা সহীহ মুসলিম, ১৭/৩৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৩. রাত্রির শেষ প্রহরে মুসাফিরের দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ». (আ‘ঊযু বি কালিমা-তিল্লা-হিত তা-ম্মা-তি মিন শাররি মা খালাক্ব) “আল্লাহ্‌র পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "মুসলিম, ৪/২০৮০, নং ২৭০৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৪. সফরে বা অন্য অবস্থায় কোনো ঘরে নামলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "প্রতিটি উঁচু স্থানে তিন বার তাকবীর দিবে, তারপর বলবে, لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ (লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়াহুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর, আ-ইবূনা, তা-ইবূনা, ‘আ-বিদূনা, লি রাব্বিনা হা-মিদূন। সাদাক্বাল্লা-হু ওয়া‘দাহু, ওয়া নাসারা ‘আবদাহু ওয়া হাযামাল আহযাবা ওয়াহদাহু) “একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর; আর তিনি সকল কিছুর উপর ক্ষমতাবান। আমরা প্রত্যাবর্তনকারী, তওবাকারী, ইবাদতকারী এবং আমাদের রব্বের প্রশংসাকারী। আল্লাহ তাঁর ওয়াদা বাস্তবায়ন করেছেন, তিনি তাঁর বান্দাকে সাহায্য করেছেন, আর তিনি সকল বিরোধী দল-গোষ্ঠীকে একাই পরাস্ত করেছেন।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোনো যুদ্ধ অথবা হজ্জ থেকে ফিরতেন, তখন এগুলো বলতেন। বুখারী, ৭/১৬৩, নং ১৭৯৭; মুসলিম, ২/৯৮০, নং ১৩৪৪।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৫. সফর থেকে ফেরার যিক্‌র",
                "sub-category-in-english": ""
            }
        ]
    },
    {
        "category-in-bangla": "শুভ অশুভ লক্ষন",
        "category-in-english": "",
        "sub-categories": [
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "اللَّهُمَّ لاَ طَيْرَ إِلاَّ طَيْرُكَ، وَلاَ خَيْرَ إِلاَّ خَيْرُكَ، وَلاَ إِلَهَ غَيْرُكَ». (আল্লা-হুম্মা লা ত্বাইরা ইল্লা ত্বাইরুকা ওয়ালা খাইরা ইল্লা খাইরুকা ওয়ালা ইলা-হা গাইরুকা)। “হে আল্লাহ! আপনার পক্ষ থেকে অশুভ মঞ্জুর না হলে অশুভ বলে কিছু নেই। আপনার কল্যাণ ছাড়া কোনো কল্যাণ নেই। আর আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "আহমাদ ২/২২০, নং ৭০৪৫; ইবনুস সুন্নী, হাদীস নং ২৯২। আর শাইখ আলবানী তাঁর সিলসিলাতুল আহাদীসিস সহীহায় ৩/৫৪, নং ১০৬৫, একে সহীহ বলেছেন। তবে সুলক্ষণ নেওয়া রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম পছন্দ করতেন। সে জন্য যখন তিনি কোনো মানুষ থেকে কোনো ভালো বাক্য বা সুবচন শুনতেন, তখন সেটা তাঁর কাছে ভালো লাগত এবং বলতেন, “তোমার মুখ থেকে তোমার সুলক্ষণ গ্রহণ করেছি”। আবু দাউদ, নং ৩৭১৯; আহমাদ, নং ৯০৪০। আর শাইখ আলবানী তাঁর সিলসিলাতুস সহীহায় একে সহীহ বলেছেন, ২/৩৬৩; আবুশ শাইখ, আখলাকুন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম, পৃ. ২৭০।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "৯৪. অশুভ লক্ষণ গ্রহণকে অপছন্দ করে দো‘আ",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে যখন আনন্দায়ক কোনো বিষয় আসত তখন তিনি বলতেন, الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ (আলহামদু লিল্লা-হিল্লাযী বিনি‘মাতিহী তাতিম্মুস সা-লিহা-ত)। “আল্লাহ্‌র জন্য সমস্ত প্রশংসা, যাঁর নেয়ামত দ্বারা সকল ভাল কিছু পরিপূর্ণ হয়।” আর যখন তার কাছে অপছন্দনীয় বিষয় আসত, তখন তিনি বলতেন, الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ (আলহামদুলিল্লা-হি ‘আলা কুল্লি হাল) “সকল অবস্থায় যাবতীয় প্রশংসা আল্লাহ্‌র জন্য।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "হাদীসটি সংকলন করেছেন, ইবনুস সুন্নী, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ৩৭৭; হাকেম এবং তিনি একে সহীহ বলেছেন, ১/৪৯৯। আর শাইখ আলবানী তাঁর সহীহুল জামে‘ ৪/২০১।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১০৬. আনন্দদায়ক অথবা অপছন্দনীয় কিছুর সম্মুখীন হলে যা বলবে",
                "sub-category-in-english": ""
            },
            {
                "data": [
                    {
                        "audio-url": "",
                        "details-in-bangla": "“যখন তোমরা মোরগের ডাক শুনবে, তখন তোমরা আল্লাহ্‌র অনুগ্রহ চাইবে, কেননা সে একটি ফেরেশতা দেখেছে। আর যখন তোমরা কোনো গাধার স্বর শুনবে, তখন শয়তান থেকে আল্লাহ্‌র কাছে আশ্রয় চাইবে; কেননা সে শয়তান দেখেছে।”",
                        "details-in-english": "",
                        "image-url": "",
                        "ref-in-bangla": "বুখারী (ফাতহুল বারীসহ), ৬/৩৫০, নং ৩৩০৩; মুসলিম, ৪/২০৯২, নং ২৭২৯।",
                        "ref-in-english": "",
                        "source": ""
                    }
                ],
                "sub-category-in-bangla": "১১০. মোরগের ডাক ও গাধার স্বর শুনলে পড়ার দো‘আ",
                "sub-category-in-english": ""
            }
        ]
    }
];